{"id":2735,"date":"2014-07-16T12:50:52","date_gmt":"2014-07-16T07:20:52","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2735"},"modified":"2014-07-16T13:05:23","modified_gmt":"2014-07-16T07:35:23","slug":"guaranteed-land-titles-in-india","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","title":{"rendered":"Guaranteed Land Titles in India"},"content":{"rendered":"<p>A title is the foundation of property ownership. It is the owner&#8217;s right to possess, use and transfer property rights. Transferring ownership of an immovable property is different from transferring, say, ownership of a car. Real estate is permanent and can have many owners over the years, as well as rights to use the property. In order to transfer clear title to real property, it is first necessary to determine the rights outstanding on the property. This is done through a title search by a qualified legal expert. A title search is a detailed examination of the historical records concerning a property. These records include deeds, mortgages, court records, encumbrances, Khata, taxes and many other documents. The purpose of the search is to verify the property owner&#8217;s right to sell or mortgage the property and to discover any claims or defects to the property. This situation is more or less applicable to all the major cities in India when dealing with freehold property.<\/p>\n<p>A title search can reveal several types of defects in title, liens, encumbrances and restrictions. Among these are unpaid taxes, easements, unsatisfied mortgages, judgments against the property owner and restrictions of use or transfer. Currently, transfer of property is based on the principle of “caveat emptor” or buyer beware! This is because the sub-registrar or registrar of assurances does not guarantee that the seller has a valid title to transfer the property to the buyer, or mortgagor, as over a period of time due to the sheer volume of transactions, government does not maintain any register of ownership. The revenue department maintains records on Khata \/ mutation and property taxes paid, and not ownership. The sub-registrar only ensures that the sale or mortgage deed is executed in his presence by parties to the contract against consideration and the requisite stamp duty and registration charges are paid.<\/p>\n<blockquote><p>Let us first understand what is this Khata and why it does not indicate ownership of a property. The literal translation of Khata is an account with the revenue department which enables one to pay property taxes, and get electricity and water connections as well as trade and building licenses. Based on the Khata, BBMP in Bangalore has also generated PID or property identification number to move towards E-governance as per the directives of the ministry of urban development. However, Khata is not a document of ownership of the property. Ownership can be established only through a registered sale deed. There are instances where property is sold several times but the Khata continues in the name of the previous owner(s).<\/p>\n<p>In Bangalore there is the concept of <strong>A<\/strong> and <strong>B<\/strong> Khata. <b>A<\/b> Khata is issued by the BBMP, whereas <b>B<\/b> Khata is issued by the local authorities. There is a provision to upgrade to <b>A<\/b> Khata by paying a fee called betterment charges. <b>A<\/b> Khata is required if one wants to take a bank loan.<\/p>\n<p>In Delhi, Chennai, Hyderabad, Kolkata and Pune, one has to make an application to appropriate authority for a mutation certificate in favor of buyer. The property tax assessment will be intimated in the mutation certificate. There is no concept of Khata as prevalent in Karnataka.<\/p>\n<p>In Mumbai realty market both leased land and freehold land are important components. Land is given on long term lease by government authorities ranging from 30 to 999 years. Specific to residential property on leasehold land, one may use the example of the MMRDA&#8217;s Wadala development plan, wherein the land is given on long-term lease to developers who can sell the units constructed on an outright basis. The developer ordinarily pays a substantial value for the long-term lease to the lessor up front. A few examples of such leasehold properties are the collector&#8217;s land on which Nariman Point stands, Mumbai Port Trust lands in Masjid Bunder and Ballard Estate, and Navi Mumbai as well. On completion of the project, the lease is transferred by the developer in the name of the society formed. The owners of the units need to be shareholders in the society. Property transactions are carried out by sale of the shareholdings in the society and transfer of share. The future of such properties after the lease term is uncertain to the extent of the amount that the State demands for renewal, which will need to be paid by the society. A concrete formula is expected with respect to calculating the incremental value required to be paid by the societies for renewal.<\/p><\/blockquote>\n<p>How does it matter whether a property is leasehold or freehold? It should be remembered that in the case of a freehold property, the owner retains complete legal rights over the property indefinitely. However, a person or entity is legally entitled to occupy or use a leasehold property only for a specified period, on the basis of rental consideration. Once this period expires, all legal rights pertaining to occupancy and use of the property return to the owner. Also in case of any transactions on this land by the lessee, an NOC is required from the lessor. In view of this there is no case for guaranteeing land title for leased land. But free hold land requires guaranteed land title.<\/p>\n<p>This is where the concept of “guaranteed land title” comes in.  This concept is not new, especially abroad where there are incorporated companies engaged in the business of guaranteeing land title. Title insurance is provided up to the face value of the policy purchased to both lenders and owners. In the case of any litigation on ownership, if a claim is made against guaranteed property, title insurance, in accordance with the policy, will assure your legal defense, including paying court costs and related fees. If the claim proves valid, you will be reimbursed for your actual loss up to the face amount of the policy. Concept of title insurance is not in vogue in India. With 49% FDA proposed in the recent NDA budget proposals, and with IRDA framing rules and regulations on property title insurance, amendment to insurance act, going forward we may see general insurance companies establishing land title insurance subsidiaries. However, title insurance is no substitute to land title guarantee by the State. In EU countries, the local authorities guarantee the land title.<\/p>\n<p>In India, even though some State governments have initiated action in providing guaranteed title to urban land (for example States of Rajasthan, Karnataka, NCR Delhi and erstwhile AP), it has not actually taken off due to the complexities and the sheer magnitude of the work involved. If guaranteed title is provided by the State government to urban land to start with, there will be an exponential growth in the real estate market, due in part to more transparency and liquidity. The Jawaharlal Nehru National Urban Renewal Mission (JNNURM) of the ministry of urban development has allocated funds for introduction and implementation of guaranteed land title act by the States. The Rajasthan government actually issued an ordinance on guaranteed land title to 11 cities in Rajasthan in 2008. It also proposed a pilot project for urban property acquired through JDA. But it did not become an act as there were elections and the opposition party did not pursue it. The ordinance fell through after the prescribed period.<\/p>\n<p>In Karnataka, the Government proposed a pilot project by <strong>implicitly <\/strong>guaranteeing land title by issuing  urban property ownership cards in Mysore district. <a title=\"Karnataka to soon offer guaranteed land titles\" href=\"http:\/\/www.livemint.com\/Home-Page\/HgnkJSiOIl9JhX6i8dk2eM\/Karnataka-to-soon-offer-guaranteed-land-titles.html\" target=\"_blank\">The cards were proposed to be issued<\/a> under the Urban Property Ownership Records (UPOR) project — which surveyed 275,000 properties in the Mysore urban area—that creates a record of the current owner of the property.<\/p>\n<p>Pioneering work has been done by the ministry of home affairs by setting up a working group which came up with the final guidelines on implementation of guaranteed land title. The executive summary of the <a title=\"National Guidelines for Implementation Of Guaranteed Title to Land and Property\" href=\"http:\/\/urbanindia.nic.in\/programme\/lsg\/project_platinum\/FINAL_REPORT_PLATINUM4711.pdf\" target=\"_blank\">Project Platinum final guidelines<\/a>, prepared by the ministry of urban affairs, gives an insight on implementation of guaranteed land title from a micro angle. The prerequisite is building data on ownership of property by surveying the same and maintaining electronic records of ownership. Not an easy task, but not an impossible one either with the technology available today. Google maps and Map my India can be used as tools for the purposes of the survey.The ministry recommendations are not compulsory but voluntary on the part of the States. The city development authorities like BDA (in Karnataka) can make a beginning by issuing property ownership cards for allottees of newly formed layouts.<\/p>\n<p>Going forward, once the electronic records of title to the property are captured, the owners can maintain demat accounts with NSDL based on the urban property ownership cards, and transfers, hypothecations and mortgages can happen just like demated securities! That is a long way off, and currently in the realms of fantasy! First , the States need to initiate surveys and build up property ownership register.<\/p>\n<p>Guaranteeing land title would involve amendments to the Indian Registration Act 1908 to make registration of title mandatory. It would involve amendments to the Transfer of Property Act 1882 to make verification process for ownership mandatory. It would involve amendment to the Indian Contract Act 1872 making all government contracts on property to be registered. It would involve the setting up of a dedicated Indemnity Fund to compensate for wrong titling and orders of tribunal which cannot be implemented due to certain circumstances.<\/p>\n<p>However, considering that guaranteeing land titles can be done in a systematic and foolproof way by the State governments, based on the ministry guidelines, all the stakeholders should bring pressure on the State governments for early implementation. The advantages, if implemented are several, and result in clean title, increase in real estate deals, boost to the real estate market and the State&#8217;s economy, more revenue to the State government, elimination of litigation, shady deals and corruption, more financiers willing to invest including FDI, setting up REITs and most importantly peace of mind to all parties!<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter size-full wp-image-2747\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Guaranteed-Land-Titles-Glossary.png\" alt=\"Glossary\" width=\"580\" height=\"900\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A title is the foundation of property ownership. It is the owner&#8217;s right to possess, use and transfer property rights. Transferring ownership of an immovable property is different from transferring, say, ownership of a car. Real estate is permanent and can have many owners over the years, as well as rights to use the property.&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[58,59,30],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Guaranteed Land Titles in India - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Guaranteed Land Titles in India - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"A title is the foundation of property ownership. It is the owner&#8217;s right to possess, use and transfer property rights. Transferring ownership of an immovable property is different from transferring, say, ownership of a car. Real estate is permanent and can have many owners over the years, as well as rights to use the property.&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-07-16T07:20:52+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-07-16T07:35:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Guaranteed-Land-Titles-Glossary.png\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\",\"url\":\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\",\"name\":\"Guaranteed Land Titles in India - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-07-16T07:20:52+00:00\",\"dateModified\":\"2014-07-16T07:35:23+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Guaranteed Land Titles in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Guaranteed Land Titles in India - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Guaranteed Land Titles in India - EMI Calculator","og_description":"A title is the foundation of property ownership. It is the owner&#8217;s right to possess, use and transfer property rights. Transferring ownership of an immovable property is different from transferring, say, ownership of a car. Real estate is permanent and can have many owners over the years, as well as rights to use the property.&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","og_site_name":"EMI Calculator","article_published_time":"2014-07-16T07:20:52+00:00","article_modified_time":"2014-07-16T07:35:23+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/Guaranteed-Land-Titles-Glossary.png"}],"author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","url":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","name":"Guaranteed Land Titles in India - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-07-16T07:20:52+00:00","dateModified":"2014-07-16T07:35:23+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Guaranteed Land Titles in India"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-I7","jetpack-related-posts":[{"id":2864,"url":"https:\/\/emicalculator.net\/first-time-apartment-buyers-part-two\/","url_meta":{"origin":2735,"position":0},"title":"A Primer for First Time Apartment Buyers &#8211; Part Two","date":"January 2, 2015","format":false,"excerpt":"Having selected the property to buy, and after checking out the budgeting, it is time to start the process of buying the apartment in right earnest. Choosing a lender and home loan You need to book the apartment selected by paying the booking amount demanded by the seller. Booking amount…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Apartment","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/apartment.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3373,"url":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","url_meta":{"origin":2735,"position":1},"title":"Tax Benefits on Joint Home Loans","date":"January 13, 2016","format":false,"excerpt":"With real estate prices at elevated levels, purchase of a dream house is not easy anymore. Higher residential real estate prices lead to requirement for higher value loans too. If the bank or housing finance company feels that your salary is not enough to service the loan comfortably, it can…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6276,"url":"https:\/\/emicalculator.net\/3-benefits-for-women-home-buyers-in-india\/","url_meta":{"origin":2735,"position":2},"title":"3 Benefits for Women Home Buyers in India","date":"November 9, 2021","format":false,"excerpt":"Asset ownership is one of the ways of women empowerment. Thus, the Government tries to incentivise women house ownership. In this post, let’s look at 3 benefits available to women home buyers in India. #1 Banks Offer Lower Interest Rates to Women The lenders usually offer lower interest rates to…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/4024254468_a87e291efa_w-300x240.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2713,"url":"https:\/\/emicalculator.net\/factors-to-consider-in-buying-vs-renting-a-home\/","url_meta":{"origin":2735,"position":3},"title":"Factors to consider in buying vs. renting a home","date":"July 6, 2014","format":false,"excerpt":"There is an adage which goes something like this: “Foolish people build homes for wise men to live in”. In other words, it is wiser to rent a home rather than invest large sums of money in owning a home. It is true that after you invest, say around ₹40…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2921,"url":"https:\/\/emicalculator.net\/is-buying-property-a-good-investment\/","url_meta":{"origin":2735,"position":4},"title":"Is Buying Property a Good Investment?","date":"January 20, 2015","format":false,"excerpt":"At the outset, let me hasten to clarify that this article is not about renting vs buying a property. This article is purely an analysis on investing in real estate, its plus and minus points. i.e., treating direct investment in real estate as one of the avenues for deploying your…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2834,"url":"https:\/\/emicalculator.net\/home-improvement-loans-dos-donts\/","url_meta":{"origin":2735,"position":5},"title":"Home Improvement Loans: Dos &#038; Don&#8217;ts","date":"November 25, 2014","format":false,"excerpt":"Once you have become a proud owner of an apartment, it requires to be furnished and maintained properly so that you continue to enjoy your investment. In the context of increasing cost of materials and labor, this requires a pretty large outlay of funds. Banks provide home improvement loans for…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Home Renovation","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/home-renovation-e1416891618167.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2735"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2735"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2735\/revisions"}],"predecessor-version":[{"id":2748,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2735\/revisions\/2748"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2735"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2735"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2735"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}