{"id":2750,"date":"2014-07-21T20:54:44","date_gmt":"2014-07-21T15:24:44","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2750"},"modified":"2014-07-21T20:54:44","modified_gmt":"2014-07-21T15:24:44","slug":"budget-2014-and-impact-on-real-estate-market","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","title":{"rendered":"Budget 2014 and Impact on Real Estate Market"},"content":{"rendered":"<p>This time around the budget has many proposals which directly and indirectly impact the real estate market positively. If we take the direct tax proposals, it has many goodies for the middle class and the salaried. Even though premium housing has emerged as a niche segment, the bulk of the housing demand continues to come from the middle and lower income group. This is but natural considering that bulk of the population of this country looks for affordable housing.<\/p>\n<p>The budget proposals which will directly impact investible surplus of this segment relate to:<\/p>\n<ul>\n<li>Increase in threshold limit for personal taxation from ₹2,00,000 to ₹2,50,000 for other than senior citizens and from ₹2,50,000 to ₹3,00,000 to senior citizens. Across the board increase of ₹50,000.<\/li>\n<li>Increase in section 80c exemption limit from ₹1,00,000 to ₹1,50,000. Increase of ₹50,000. The long term investments, for which exemption is available under this section, include principal component repayment of housing loan through EMI.<\/li>\n<li>Tax deductible threshold on Interest on home loans increased from ₹1,50,000 to ₹2,00,000. Increase of ₹50,000.<\/li>\n<\/ul>\n<p>The opposition had dubbed the budget as a 100 crore budget as many project expenditure heads were allocated a measly 100 crores each. But as you can see it was also a ₹50,000 budget as far as personal taxation is concerned!<\/p>\n<p>In the aggregate, the taxable income can get reduced by ₹1,50,000. Some cushion for the home buyers who are seeing their real income shrinking due to persistent inflationary conditions. Will the tax proposals have an impact on a person’s desire to own a home? The first time buyers from middle class and salaried will definitely factor in the tax sops, whereas it will not mean much to the premium home buyers.<\/p>\n<p>There are several other proposals in the budget which will impact the real estate market positively. They are:<\/p>\n<ul>\n<li>In a supply side initiative, banks are now permitted to <a href=\"http:\/\/www.moneycontrol.com\/news\/economy\/rbi-okays-long-term-bondsbanks-cheap-loans-for-infra-cos_1128158.html\">raise funds through issue of long term bonds<\/a> (minimum maturity 7 years with no put or call option) for lending to infrastructure and affordable housing finance. Lending to affordable housing is defined as housing loans eligible under priority sector lending by RBI (which is currently up to ₹25,00,000 loans to individuals in metropolitan centres with population above 10 lakhs, and ₹15,00,000 in other centres for purchase\/construction of a dwelling unit per family excluding loans sanctioned to bank’s own employees). Now the funds raised through the long term bonds can be utilized for funding housing loans to individuals upto ₹50,00,000 for houses of values up to ₹65,00,000 located in the six metropolitan centres viz. Mumbai, New Delhi, Chennai, Kolkata, Bengaluru and Hyderabad and ₹40,00,000 for houses of values upto ₹50,00,000 in other centres for purchase\/construction of dwelling unit per family. These bonds will be exempted from CRR, SLR and priority sector lending norms. This will give the banks some leeway in further expanding their housing loan portfolio and also bring down the interest rates on housing loans.<\/li>\n<li><b>CRR or Cash Reserve Ratio. <\/b>Reserve bank of India, by virtue of the powers vested in it by the Banking regulation act, impounds a certain percentage of the bank’s net demand and time liabilities to manage the money supply and to control inflation as well as tight money conditions, as the case may be, by increasing or lowering  the CRR. Current CRR is 4%. The money impounded has a cost attached to it, as RBI does not pay any interest on money impounded, but banks continue to pay interest to customers on money deposited.<\/li>\n<li><b>SLR or Statutory Liquidity Ratio. <\/b>Reserve Bank of India is required to ensure that the banking system maintains adequate liquidity to repay its depositors at all times. Hence banks are required to maintain certain percentage of their net demand and liabilities in highly liquid assets like cash, sovereign bonds, gold etc. Currently the SLR is to be maintained at 22.5% of net demand and time liabilities. SLR maintenance has a cost attached to it like CRR.<\/li>\n<li>When computing their base rate, the banks factor this in negative carry on account of CRR and SLR. Base rate is the benchmark for the floating interest charged on housing loans by Banks. Hence, waiver of CRR\/ SLR should result in lower interest rates for funds generated through long term bonds. While banks cannot lend below base rate, waiver of CRR and SLR should result in lower spread on floating rate interest on housing loans. The coupon on these long term bonds should be lower, considering risk reward trade off and their long tenure. This will also result in lower cost of funds to banks.<\/li>\n<li>Budget proposals include slum redevelopment under CSR. Large corporate houses can allocate bulk amounts for CSR activity by engaging real estate developers services for this task. Tier-1 cities like Mumbai may see a lot of action in this segment. This initiative could have been incentivised by providing tax breaks to the corporate, but has been omitted. Still some real estate stocks may be positively impacted by this proposal.<\/li>\n<li>Budget indicates Government intentions to <a href=\"http:\/\/www.niticentral.com\/2014\/07\/13\/smart-cities-will-trigger-indias-rurban-growth-233208.html\">develop 100 smart cities<\/a>. Some of the real estate players should benefit from this initiative. For instance, in Karnataka, <a href=\"http:\/\/www.commonfloor.com\/guide\/union-budget-2014-tumkur-gets-smart-city-tag-44508.html\">Tumkur is given the tag of a smart city in the Union Budget<\/a>.<\/li>\n<li>Budget proposals include <a href=\"http:\/\/www.rbi.org.in\/scripts\/FAQView.aspx?Id=26\">relaxation in FDI norms for real estate<\/a>. It has been proposed to reduce the FDI minimum limit from 50,000 square metres to 20,000 square metres and minimum investment from USD 10 million to USD 5 million. This should give access for cheaper funds for real estate companies. The earlier threshold limit was a constraint.<\/li>\n<li>It has been proposed to give tax pass-through status for Real Estate Investment Trusts (REITs) to avoid double taxation. The impact of this proposal is expected to bring in more investments to the sector. For more clarity on this subject, I will expand on this topic in the remainder of this article.<\/li>\n<\/ul>\n<h2><b>What are REITs &amp; what is tax pass-through?<\/b><\/h2>\n<p><a href=\"http:\/\/www.investopedia.com\/terms\/r\/reit.asp\">REIT<\/a> is an investment trust that issues units to its investors for the underlying asset owned by the trust. Or the trust can invite investments from its unit holders and invest in real estate.The trust may invest in ownership of land parcels, rental properties, mortgages, or a combination of these and issue a hybrid instrument. The REIT will earn an income by sale of property, property rentals or as interest on mortgage, based on the way the trust has invested.<\/p>\n<p>Basically an REIT is a close ended real estate mutual fund, and gives an opportunity to small investors to indirectly invest in the real estate market, which otherwise requires large investments and cannot be normally afforded by a small investor. The REITs are actually expected to take shape in 2015 in India. SEBI has put out draft guidelines which, inter alia,  indicate that REITs are to be formed as a trust under the Indian Trust Act. REITs would raise money from the investors and in turn shall make investment in real estate projects. The investors will be holding units which would represent the beneficial interest in the property held by the REITs and these units will be mandatorily listed. The REITs could invest either directly into income generating properties or through a SPV (special purpose vehicle) which shall hold not less than 90% of their shares directly in such properties. An SPV has been defined by SEBI as an Indian company in which the business trust holds controlling interest and any specific percentage of shareholding or interest, as may be required by the regulations under which such trust is granted registration. As can be inferred, the structure is similar to a mutual fund with a sponsor and a trust. But instead of an asset management company, an SPV is managing the investment. The SPV is expected to hold not less than 90% ownership in the property.<\/p>\n<p>REITs should help cash strapped real estate companies who hold large land banks to monetise their holdings and generate liquidity instead of borrowing and creating a highly leveraged balance sheet which affects their profitability. REITs should have a positive impact on some of the highly leveraged, listed real estate stocks. The budget proposes similar structures for PPP and infrastructure projects. The finance minister expects FDI as well as NRI investments, on account of pass-through treatment for taxation which is proposed to be made available for both types of business trusts.<\/p>\n<p>The tax treatment given to an REIT in India is still not very clear, in view of the complicated tax laws. However, it is announced that REIT and infrastructure trusts will be given a pass-through status as far as taxation is concerned.<\/p>\n<p><a href=\"http:\/\/www.taxmann.com\/budget2014-15\/file\/t66\/budget-2014-budget-proposes-tax-transparent-treatment-for-reits-commercial-real-estate-to-get-a-push.aspx\">Pass-through status of an REIT<\/a> can be briefly explained as follows: It basically relates to tax treatment to avoid double taxation, once in the hands of the trust and again in the hands of the investor\/ unit holder or vice versa. An REIT does not distribute income but transfers the cash flow to unit holders. Once the assets are fully disposed off, the close ended REIT comes to an end, as would the SPV. The listed units of a close ended business trust, when traded on a recognised stock exchange, would <a href=\"http:\/\/www.outlookindia.com\/news\/article\/Union-Budget-Tax-Incentives-for-REITs-InvITs-Proposed\/849092\">attract same levy of securities transaction tax (STT), and would be given the same tax benefits<\/a> as in respect of taxability of capital gains tax on the equity shares of a listed company, i.e. long term capital gains, would be exempt and short term capital gains would be taxable at the rate of 15 per cent. The definition of short term and long term investment in the case of equity shares of a listed company will apply mutatis mutandis to REITs units. Capital gains tax exemption will be available to unit holder if he holds them for a minimum period of one year from the date of acquisition either in the NFO (whether it will be called as an NFO or something else, only time will tell!) or from the secondary market.<\/p>\n<p>Now coming to taxation to SPV, REITs and unit holder, following appears to be the scenario on account of pass-through status: some new clauses have been introduced to the IT Act.<\/p>\n<ol>\n<li>Interest income received by the REIT from the SPV is exempt from taxation. But when distributed to investor it will be taxed in his hands as  income from previous year under  Section 115 UA (3) of the newly inserted Chapter XII FA. TDS on this will be @ 10% for residents and 5% for non-residents.<\/li>\n<li>Income other than interest income received by the trust from the SPV and distributed to unit holders will not be taxed in the hands of unit holder, but taxed in the hands of the business trust, as per the newly introduced clause 23 FD.<\/li>\n<\/ol>\n<p>It will take some time for the dust to settle and clarity to emerge on the new sections and chapters introduced through the finance bill. We will have to wait till the finance bill is passed and IT department provides clarifications sought by all the parties. We also have to wait for the comprehensive final guidelines from SEBI.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This time around the budget has many proposals which directly and indirectly impact the real estate market positively. If we take the direct tax proposals, it has many goodies for the middle class and the salaried. Even though premium housing has emerged as a niche segment, the bulk of the housing demand continues to come&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[11],"tags":[54,7,57,30],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Budget 2014 and Impact on Real Estate Market - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Budget 2014 and Impact on Real Estate Market - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"This time around the budget has many proposals which directly and indirectly impact the real estate market positively. If we take the direct tax proposals, it has many goodies for the middle class and the salaried. Even though premium housing has emerged as a niche segment, the bulk of the housing demand continues to come&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-07-21T15:24:44+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\",\"url\":\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\",\"name\":\"Budget 2014 and Impact on Real Estate Market - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-07-21T15:24:44+00:00\",\"dateModified\":\"2014-07-21T15:24:44+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Budget 2014 and Impact on Real Estate Market\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Budget 2014 and Impact on Real Estate Market - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","og_locale":"en_US","og_type":"article","og_title":"Budget 2014 and Impact on Real Estate Market - EMI Calculator","og_description":"This time around the budget has many proposals which directly and indirectly impact the real estate market positively. If we take the direct tax proposals, it has many goodies for the middle class and the salaried. Even though premium housing has emerged as a niche segment, the bulk of the housing demand continues to come&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","og_site_name":"EMI Calculator","article_published_time":"2014-07-21T15:24:44+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","url":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","name":"Budget 2014 and Impact on Real Estate Market - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-07-21T15:24:44+00:00","dateModified":"2014-07-21T15:24:44+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Budget 2014 and Impact on Real Estate Market"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Im","jetpack-related-posts":[{"id":4666,"url":"https:\/\/emicalculator.net\/budget-2019-highlights\/","url_meta":{"origin":2750,"position":0},"title":"Budget 2019 Highlights","date":"February 1, 2019","format":false,"excerpt":"Income Tax Slabs Remain Unchanged Taxable Income Age < 60 years Taxable Income Senior Citizen (60 <= Age < 80 years) Taxable Income Very Senior Citizen (Age >= 80 years) Rs 2.5 lacs - Rs 5 lacs 5% Rs 3 lacs - Rs 5 lacs 5% Rs 5 lacs -…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2726,"url":"https:\/\/emicalculator.net\/expectations-from-the-union-budget-2014-15\/","url_meta":{"origin":2750,"position":1},"title":"Expectations from the Union Budget 2014-15","date":"July 7, 2014","format":false,"excerpt":"The first budget of the Narendra Modi Government is to be unveiled on the 10th of July. There are high expectations from various sectors of the economy that are looking forward to delivery of a promise by Mr. Modi on “Aaache Din”. The economy is passing through high inflation coupled…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2738,"url":"https:\/\/emicalculator.net\/budget-2014-healing-touch-for-the-common-man-and-realty-sector\/","url_meta":{"origin":2750,"position":2},"title":"Budget 2014: Healing touch for the common man and realty sector","date":"July 16, 2014","format":false,"excerpt":"The real estate sector which has gone through the sluggish sales in last couple of years has got some good reasons to cheer now. Increase in deduction on home loan interest, tax pass-through status for REITs, proposal for 100 more cities, proposal for 'home for all' programme, easing of FDI…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2944,"url":"https:\/\/emicalculator.net\/budget-2015-common-mans-perspective\/","url_meta":{"origin":2750,"position":3},"title":"Budget 2015: A Common Man&#8217;s Perspective","date":"March 7, 2015","format":false,"excerpt":"When Finance Minister, Mr Arun Jaitley, presented the NDA government’s first full year budget on 28th February 2015, I was one of the millions of Indians who sat glued to their television sets to catch the budget highlights first hand. To be honest, like most of individual tax payers out…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7087,"url":"https:\/\/emicalculator.net\/union-budget-2023-highlights-of-an-action-packed-budget\/","url_meta":{"origin":2750,"position":4},"title":"Union Budget 2023: Highlights of an Action Packed Budget","date":"February 1, 2023","format":false,"excerpt":"The Finance Minister presented the Union Budget 2023 today. In the past, taxpayers have had big expectations from the Union Budgets but the budget announcement turned out to be a damp squib. Yes, there are always policy changes but not many seem to affect the salaried class directly. The Union…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"remittance rates","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/remittance-rates.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2767,"url":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-1\/","url_meta":{"origin":2750,"position":5},"title":"An Introduction to Savings and Investments &#8211; Part 1","date":"September 9, 2014","format":false,"excerpt":"Managing your money involves optimising your earnings by planning your spending and investing your surpluses wisely. You can manage your spending and savings by budgeting for it and sticking to your budget. A Rupee saved is a Rupee earned. Saving involves certain amount of investment savvy for asset allocation to…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2750"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2750"}],"version-history":[{"count":1,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2750\/revisions"}],"predecessor-version":[{"id":2751,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2750\/revisions\/2751"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2750"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2750"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2750"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}