{"id":2758,"date":"2014-08-23T05:45:23","date_gmt":"2014-08-23T00:15:23","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2758"},"modified":"2014-09-23T11:13:37","modified_gmt":"2014-09-23T05:43:37","slug":"inflation-and-you","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/inflation-and-you\/","title":{"rendered":"Inflation and You"},"content":{"rendered":"<p>Inflation can be defined as across the board sustained increase in prices of domestic as well as imported goods and services and fall in the purchasing power of the home currency. Inflation rate can be measured through a benchmark price index. It can be <strong>wholesale price index (WPI)<\/strong> or <strong>consumer price index (CPI)<\/strong>. A price index is the weighted average price of select goods and services in a given region, during a given interval of time. The change in the weighted average compared to a base period in percentage terms gives an idea of price movement of the basket of goods and services in the index. In our country, the central bank and the government were tracking the movement of the index taking into account the wholesale prices. This can be misleading as the retail or consumer level prices are the ones that  impact the purchasing power in the hands of the individual citizen. In India, the <a title=\"The components of WPI and CPI differ\" href=\"http:\/\/www.livemint.com\/Money\/tdiRmQuAG2MV0MPzImH1LP\/DYK-The-components-of-WPI-and-CPI-differ.html\" target=\"_blank\">components of the two indices are also not similar<\/a>. WPI has got several components such as food items, non-food items, power and oil etc., which aren’t part of the CPI. In developed countries inflation is tracked based on the CPI.  Now RBI has switched over to CPI as a benchmark for inflation. The gaps in data integrity and difficulties in collecting data notwithstanding, WPI was serving as a barometer to the purchasing power parity of the Rupee versus other foreign currencies when calculating real effective exchange rate (REER) of the Rupee. RBI now wants to track the REER taking in to account the CPI. This means the REER will reflect the under or overvaluation of Rupee with the ground level inflation rate. Inflation is the single most important factor influencing the exchange rate. This is  because a weak Rupee results in higher import costs.<\/p>\n<p>The weightage for different components in WPI  in July 2014 were as follows:<\/p>\n<table border=\"#DDDDDD\">\n<tbody>\n<tr>\n<th style=\"width: 200px;\"><b>Particulars<\/b><\/th>\n<th style=\"width: 200px;\"><b>Weight<\/b><\/th>\n<\/tr>\n<tr>\n<td style=\"width: 200px;\">Primary Articles<\/td>\n<td style=\"width: 200px;\">20.12<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 200px;\">Fuel and Power<\/td>\n<td style=\"width: 200px;\">14.91<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 200px;\">Manufactured Products<\/td>\n<td style=\"width: 200px;\">64.97<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 200px;\">Total<\/td>\n<td style=\"width: 200px;\">100<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Energy imports are the biggest contributor to CAD. Increased energy costs further contribute to rise in prices and consequently inflation. Fuel and Power alone contributed nearly 15% to total weight. This impacts the price of primary articles and manufactured products as well. Energy costs impact every facet of the economy directly or indirectly. Since country is heavily dependent on import of petroleum products, the government has no control over prices of these commodities and subsidizes the consumption.<\/p>\n<p>Inflation has a direct impact on household budgets, as it results in increased spending on household goods and services on the one hand and reduced surpluses for savings and investment on the other. The return on investments, especially in fixed income securities like term deposits, debentures, bonds etc. may turn negative when inflation rate is factored in, as majority of debt instruments yield a fixed coupon. This causes an interest rate risk when market interest rates rise or fall on account of inflation\/deflation. To tame inflation by reducing money supply, the central bank will increase the CRR and administered interest rates, resulting in increased cost of borrowings by banks and financial institutions as money supply gets reduced. These will be passed on to the customers who end up paying higher EMI, further decreasing the purchasing power and investible surplus. The manufacturing sector will be impacted on account of higher borrowing cost, higher cost of imported inputs and lower demand. Ultimately, the national gross domestic product (GDP) will fall, and if remedial steps are not taken, it may lead to stagflation, or inflation coupled with stagnation in economic activity.<\/p>\n<h2><b>How Does Inflation Occur?<\/b><\/h2>\n<p><strong>Many economists propound the theory that easy money conditions, or increase in money supply causes inflation.<\/strong> That is, too much money chasing available goods and services causes more money supply and in turn reduces the purchasing power of the Rupee. It impacts most those who have less money to start with. When the government earnings are less than its expenditure, it results in fiscal deficit. This gap needs to be bridged by the government by borrowing through issue of bonds, foreign aid, overseas government to government borrowing, borrowing from multilateral agencies and increased taxation. Bonds are bought by the financial institutions and banks by using the savings which citizens have deposited with them. In other words, government manages its affairs by borrowing from the financial market. The money raised is used by the government for planned as well as unplanned expenses. The expenditure which does not result in investments, gets used up for consumption and fuels inflation. Good examples are subsidies to sectors that do not deserve it. This government expenditure beyond its means, results in more money supply and consequently erosion in the value of money and inflation. This inflationary pressure impacts those who have less money the most, and increases poverty. More taxation results in less money in the hands of consumers leading to lesser demand for goods and services, causing a falling GDP. It also results in weakening of the rupee versus other major international currencies. As can be visualized, inflation impacts every economic activity.<\/p>\n<p><strong>Another school of thought says <a title=\"What Actually Causes Inflation\" href=\"http:\/\/www.forbes.com\/sites\/johntharvey\/2011\/05\/30\/what-actually-causes-inflation\/\" target=\"_blank\">inflation is on account of demand exceeding supply for goods and services.<\/a><\/strong> To illustrate this theory, let us examine Bangalore city as a classic example. 25\/30 years ago Bangalore was a sleepy pensioners paradise and quite economical to live in compared to say, Mumbai. Then came the IT influx. IT companies started hiring people from all over the country at high salaries, because good talent was not plentiful, and demand exceeded supply. This created a class of people with high purchasing power who were looking to spend their high income on luxury food and drink, personal transport, premium housing etc. They then brought their families to settle in Bangalore, and suddenly there was exponential growth, especially in the real estate market. Land prices zoomed to astronomical heights, as Malls, gated communities, hospitals, schools, apartments, shopping complexes, hotels, commercial complexes, bars and restaurants, furniture shops, boutiques, spas, salons etc. sprang up all over the city. Carpenters, plumbers, painters, electricians, drivers, watchmen etc. are in high demand and in short supply. Service providers are dictating their own prices and creating benchmarks. Prices of vegetables and fruits have gone up astronomically, as supply cannot keep up with demand. The purchasing power of rupee has fallen drastically, and the poor have been pushed to the outskirts of the city or slums are created. This situation is replicated in other parts of India including tier two cities. This demand has created purchasing power in the hands of real estate developers, landlords, service providers, professionals etc. and in fact a large and mixed population of the city. Now that there is an ever growing demand for goods and services, and supply is limited, the economic reality of falling purchasing power of the rupee can be felt by the population of these cities in particular and the country as a whole.<\/p>\n<h2><b>How Does Inflation Impact You?<\/b><\/h2>\n<p>If you are an <strong>employee working in the private sector<\/strong>, your salary will not be inflation proof. The employer measures your emolument based on the cost to company or CTC. The components of the CTC unfortunately do not have an inflation allowance!  You will have to submit your annual performance appraisal  and hope for a good raise in your basic pay, so that you will be able to manage your household expenses despite the erosion in the value of money. You may have to take a re-look at what expense is towards a “necessity” and what expense can be postponed. Every company may not have the pricing power and may report lower profits. It means, the raise you were hoping for may not happen, or may not be to the extent you were hoping for. A part of the raise is taken away by the government by way of direct and indirect taxes.<\/p>\n<p>In the case of <strong>public sector employees<\/strong>, among other components of the pay, they receive a dearness allowance. Based on the consumer price index, this allowance changes at periodical intervals. Does this insulate government servants from inflation? Not fully, as the index does not fully reflect the erosion in the purchasing power of the Rupee. Plus, the income tax takes away some portion of the DA. Sometimes this DA increase may push you to a higher tax slab, and your net pay may become less than what it was before the DA increase!<\/p>\n<p>If you are a <strong>businessman<\/strong>, the postponing of purchases by consumers will mean less revenue for you. Of course, certain businesses that have the pricing power will not be impacted much. Take cigarette companies for example. Whatever be the excise increase, they pass on the entire burden to the consumer, and their profitability hardly gets impacted. Or, take the example of a daily consumption article of a family, like milk. Even though households may grumble, they do not curtail consumption, because it is a necessity at whatever price. But families do reduce expenditure on entertainment, going out etc., and postpone buying luxury articles.<\/p>\n<p>If you are <strong>young<\/strong> and your talents are in demand in the job market, inflation may not impact you much. This is because, your pay packet may get a hike sooner than later. But if you are mediocre, and you are easily replaceable you may get the axe sooner or later. Companies tend to cut what they term as “flab” in an inflationary environment with falling growth. If you are a <strong>retired person<\/strong>, you have a lot to worry about as you have to depend entirely on your balance sheet.<\/p>\n<h2><b>Inflation and Investments<\/b><\/h2>\n<p>One should invest in a <strong>residential house\/apartment<\/strong> which is an effective hedge against inflation. The value of a house only appreciates in tandem with rise in inflation. This is because the cost of all the materials which go into building a house would also have gone up due to inflation, and a new dwelling will cost much more than what you have invested in before inflation set in. Sale of a house should generate good capital appreciation in an inflationary market environment. Renting your house should also give you good return, considering that in an inflationary market the rentals would have also gone up. Reasonable level of inflation is actually good for the real estate market. <strong>REITs<\/strong> units, when available for investment, should  also provide good hedge against inflation.<\/p>\n<p>Another asset class, which can help you in an inflationary economy, is <strong>equity shares<\/strong>. Even though demand slump may impact earnings of some companies, there are some sectors that do not get impacted. A good example is FMCG, pharmaceutical and FMCG and Pharma contract manufacturing companies. The share prices of companies in this sector go up during inflationary trends. You will get dividend income as well as capital gains in such investments. You see, people will not stop buying toothpaste, soap, shaving cream, medicines etc. just because prices have gone up by a few rupees. But they may postpone buying an asset like a car  because they can still use a two wheeler or public transport. Investment in FMCG and pharma funds can be an alternative to direct investment in the stock market.<\/p>\n<p>RBI had issued <a title=\"RBI’s inflation index bonds better than bank FD for retirement savings\" href=\"http:\/\/www.moneylife.in\/article\/inflation-index-bonds\/35765.html\" target=\"_blank\"><strong>inflation indexed bonds<\/strong><\/a> in 2013 of ten year tenure, and extended it up to March 2014. These bonds are indexed to CPI instead of WPI. These bonds are long term and there is no secondary market for it and illiquid. The interest is taxed as per extant IT rules. Early redemption is allowed after minimum 1 year for super seniors and 3 years for others with penalty cut. This product, even though designed as a hedge, has a number of deterrents and may not suit all. If you are keen on investing in such instrument, you will need to wait for next issue by RBI. RBI did not find much demand from retail investors for this security, even though it was made available on tap for retail investors.<\/p>\n<p><strong>Tax free bonds<\/strong> which give a return higher than the inflation rate can also be examined as an alternate investment avenue. But these bonds give low returns, are long term and have interest rate risk. But for an HNI in 30% tax slab, it may make sense to invest in these instruments.<\/p>\n<p>Traditionally, gold is considered to be the best asset class to invest in when all else fails. That is why international prices of gold tend to go up in a global economic downturn. In India, gold jewellery is considered as part of the family wealth, and given to a bride as dower. But gold jewellery is not a liquid asset and it does not generate any income. It needs to be melted and  gold separated from other additives when selling. You will get a lower caratage and a lower price. Investing in gold bars and coins is not advisable because of the ever changing government policies. The current duty structure has made smuggled gold cheaper than what you can buy across the counter. Stocking physical gold is risky. Alternatively one can look at <strong>gold ETF<\/strong>.<\/p>\n<h2><b>Conclusion<\/b><\/h2>\n<p>A little inflation is actually good for the economy, compared to a deflationary trend. A good example of deflationary market is Japan, which has a large geriatric population. Domestic consumption is negative and country’s economy is wholly export dependent for growth. After emergence of China as the largest exporter in the world, Japan has lost its importance. Even at practically zero interest rates, Japanese economy is not picking up. Yen is used by speculators for carry trade.<\/p>\n<p>But, inflation level in India needs to be brought down from current levels if any sustained economic growth is to be achieved. Research indicates that inflationary conditions may not abate for at least a couple of years. So, plan your investments and expenditure wisely and reduce the impact of inflation on your household budget.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Inflation can be defined as across the board sustained increase in prices of domestic as well as imported goods and services and fall in the purchasing power of the home currency. Inflation rate can be measured through a benchmark price index. It can be wholesale price index (WPI) or consumer price index (CPI). A price index&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/inflation-and-you\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[63,60,62,64,61],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Inflation and You - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/inflation-and-you\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Inflation and You - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"Inflation can be defined as across the board sustained increase in prices of domestic as well as imported goods and services and fall in the purchasing power of the home currency. Inflation rate can be measured through a benchmark price index. It can be wholesale price index (WPI) or consumer price index (CPI). A price index&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/inflation-and-you\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-08-23T00:15:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-09-23T05:43:37+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/inflation-and-you\/\",\"url\":\"https:\/\/emicalculator.net\/inflation-and-you\/\",\"name\":\"Inflation and You - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-08-23T00:15:23+00:00\",\"dateModified\":\"2014-09-23T05:43:37+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/inflation-and-you\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/inflation-and-you\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/inflation-and-you\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Inflation and You\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Inflation and You - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/inflation-and-you\/","og_locale":"en_US","og_type":"article","og_title":"Inflation and You - EMI Calculator","og_description":"Inflation can be defined as across the board sustained increase in prices of domestic as well as imported goods and services and fall in the purchasing power of the home currency. Inflation rate can be measured through a benchmark price index. It can be wholesale price index (WPI) or consumer price index (CPI). A price index&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/inflation-and-you\/","og_site_name":"EMI Calculator","article_published_time":"2014-08-23T00:15:23+00:00","article_modified_time":"2014-09-23T05:43:37+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/inflation-and-you\/","url":"https:\/\/emicalculator.net\/inflation-and-you\/","name":"Inflation and You - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-08-23T00:15:23+00:00","dateModified":"2014-09-23T05:43:37+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/inflation-and-you\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/inflation-and-you\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/inflation-and-you\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Inflation and You"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Iu","jetpack-related-posts":[{"id":2815,"url":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","url_meta":{"origin":2758,"position":0},"title":"India &#038; China: A Tale of Two Asian Economies","date":"November 20, 2014","format":false,"excerpt":"The Indian economy expanded by 4.7% in the year 2013-2014, registering a second consecutive year of sub 5% growth. Between 2012-’13 and 2013-’14 the main driver of the economy were the farm, financial services, and the real estate sectors. The manufacturing sector continued to languish. After lifting the GDP by…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4200,"url":"https:\/\/emicalculator.net\/time-value-money-important-concept-financial-planning\/","url_meta":{"origin":2758,"position":1},"title":"Time Value of Money — Most Important Concept in Financial Planning","date":"February 16, 2018","format":false,"excerpt":"Editor's Note: In a recent podcast, CIEL's Uma Shashikant suggests that 'Time Value of Money' is the only concept that average person needs to know in personal finance. Deepesh Raghaw attempts to explain this concept to our readers in this article. What would you prefer? Receive Rs 100 today or…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/time-value-of-money.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4318,"url":"https:\/\/emicalculator.net\/time-value-of-money-for-kids\/","url_meta":{"origin":2758,"position":2},"title":"Time Value of Money — For Kids","date":"April 21, 2018","format":false,"excerpt":"When I was kid, a friend made me a hypothetical proposition. He told me he would give me a Maruti 800 car every day (guess that was the fanciest car both of us were aware of at that age and time). In return, I would have to give Re 1 on…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/time-value-of-money-for-kids.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3019,"url":"https:\/\/emicalculator.net\/buy-or-rent-financial-factors-that-you-must-not-ignore-while-making-your-decision\/","url_meta":{"origin":2758,"position":3},"title":"To Buy or Rent &#8211; 5 Financial Factors That You Must Not Ignore While Making Your Decision","date":"April 25, 2015","format":false,"excerpt":"When I relocated to Pune in 2003 due to professional commitments, I decided to rent a flat close to my work place. The idea of buying a flat instead of renting never occurred to me until my boss broached the topic. We did some simple calculations taking into consideration my…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":339,"url":"https:\/\/emicalculator.net\/rbi-hikes-interest-rates-for-12th-time-in-18-months-loan-emis-to-go-up\/","url_meta":{"origin":2758,"position":4},"title":"RBI hikes interest rates for 12th time in 18 months; loan EMIs to go up","date":"September 16, 2011","format":false,"excerpt":"The Reserve Bank of India (RBI) raised its repo rate - rate at which it lends to banks - and reverse repo rate - the rate it pays to banks for deposits - by a quarter of a percentage point to 8.25% and 7.25% respectively. With today's rate hike, RBI has raised…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"RBI Interest Rate Hikes","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/2011\/09\/rbi-interest-rate-hikes.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3071,"url":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","url_meta":{"origin":2758,"position":5},"title":"Should You Invest in Indian Real Estate in 2015?","date":"July 4, 2015","format":false,"excerpt":"The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so,…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2758"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2758"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2758\/revisions"}],"predecessor-version":[{"id":2795,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2758\/revisions\/2795"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2758"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2758"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2758"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}