{"id":2774,"date":"2014-09-10T08:06:44","date_gmt":"2014-09-10T02:36:44","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2774"},"modified":"2014-09-20T20:29:38","modified_gmt":"2014-09-20T14:59:38","slug":"a-credit-card-primer","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/a-credit-card-primer\/","title":{"rendered":"A Credit Card Primer"},"content":{"rendered":"<p>In this age of consumerism one is lost without a credit card. In developed countries, all retail lending by banks happens through credit cards. In India, banks have categorized retail lending into personal loans, loans for purchase of durable utility articles, vehicle loans, home improvement loans etc., and these are separate retail credit products distinct from credit cards. Credit card is a separate profit centre for the banks in India. Initially, when banks in India started issuing credit cards, they were quite aggressive in marketing the product, and the number of cards issued was the yardstick to measure the success of this new product. Some banks had no agreements in place with VISA \/ Mastercard organizations and there was no universal acceptability for the cards. There were complaints from merchant establishments of missing or late reimbursements. Many banks were selling their cards as an incentive to open accounts with them, totally disregarding credit history of the applicant. All this resulted in large credit card defaults, member establishments blacklisting some bank’s cards, customers losing faith in the cards etc. All this is now history and credit cards have come to be accepted as a convenient way to spend. Bank’s have stopped issuing cards without proper credit investigation and assessment. Establishment of CIBIL (Credit Information Bureau of India Limited, formed in association with Dun &amp; Bradstreet) have helped the banks tremendously in credit rating the card applicants. CIBIL  scores are taken into account before okaying card issuance. In addition PAN, IT return, Form 16\/16A are asked for before accepting an application. All credit cards are now international cards with VISA \/ Mastercard affiliation. For domestic usage only, RuPay credit cards (a  National Payment Corporation of India product) are scheduled to be <a title=\"How RuPay plans to battle with Visa and MasterCard\" href=\"http:\/\/www.moneycontrol.com\/news\/business\/this-is-how-rupay-plans-to-battlevisamastercard_686243.html\" target=\"_blank\">launched in March 2015<\/a>. Currently only RuPay debit cum ATM cards are being issued by several Indian banks.<\/p>\n<h2><b>Types of Cards<\/b><\/h2>\n<p>Some banks have also a <b>debit cum credit card<\/b> product. For instance, <a title=\"IDBI Bank Magic Card\" href=\"http:\/\/www.idbi.com\/magic-debit-card.asp\" target=\"_blank\">IDBI Bank has a product called magic card<\/a>. This is a debit card and on exhaustion of available balance in the transaction account, bank gives an overdraft facility up to the credit limit permitted for further debits. There is another category of plastic called <b>charge card<\/b> as opposed to a credit card. A charge card does not provide you credit. It is as good as a debit cum ATM card, and you need to make the full payment (as opposed to minimum payment on credit card) on billing by the charge card issuer.<\/p>\n<p>There is a facility of <b>add-on cards<\/b> that can be utilized for issuance of credit cards to family members, who on their own may not be eligible for a credit card. The add-on card is issued within the overall credit limit of principal cardholder. Those who want to make one time use of credit card on the  internet, can request their bank for a <b>virtual card<\/b> through internet banking. ICICI bank has a product called virtual visa card. The virtual card will have a different card number, CVC and validity from the physical card. The credit limit is carved out of the physical card. It can be useful when you want to make one time online payments but do not want to publish your card information from safety angle. <b>Co-branded cards<\/b> are also issued by several banks like the Indian Oil card, Jet Airways card, Times card etc. Based on the usage, the cardholder is given reward points or cash back which can be encashed for freebies. <b>Corporate credit cards<\/b> are also popular and executives of corporate houses use them for expenses connected with their official engagements. Credit cards are normally issued for a validity period of five years and you can also opt for a photo card, wherein your photograph and signatures will be printed on the card. Some banks charge an annual fee for card issuance but due to competition, many banks waive this off. <b>Super premium cards<\/b> are also available for usage of HNI with deep pockets with unlimited credit limit. Diners club is one such card.<\/p>\n<p>A credit card comes with a cash limit and a credit limit fixed by the bank based on its credit assessment of the applicant. Cash limit can be utilized for withdrawals from ATM and credit limit can be utilized for purchases and payments through internet or POS (Point Of Sale). POS is a handheld device for swiping the card. It is connected to the network server through dedicated telephone line.<\/p>\n<p>There are different operational procedures adopted by different Indian banks. MNC banks have a different set of procedures in place. Most of the public sector banks issue a credit card only if you have a transaction account with them and not otherwise. MNC banks and private sector banks issue credit cards to non account holders as well. Public sector banks mostly do not use courier service for despatch of card and PIN, they ask the customer to personally visit the branch and collect the same, which can be an irritant. Most of the public sector banks have no provision for one time increase in credit limit, but MNC banks and some private sector banks provide this facility at a fee. Among the public sector banks, SBI has been more aggressive in product innovation and proactive in giving better value to the card holders through joint promotions, cash back etc.<\/p>\n<h2><b>How to Get a Credit Card?<\/b><\/h2>\n<p>An applicant needs to fill up the standard application form of the Bank along with all the self certified documentation called for. Know your customer (KYC) guidelines are fully applicable in the case of credit cards. Ensure that your CIBIL score is acceptable to the Bank. Private sector and MNC banks accept credit card applications online, but procedural aspect including KYC and risk containment exercise is done manually. An application which is complete and there are no issues, should get processed and card issued within a maximum period of 15 to 20 days. Select the card which gives maximum value such as lower fees, additional rewards and lower interest charges on revolving credit.<\/p>\n<p><strong>Editor&#8217;s note: You can compare credit cards and <a title=\"Apply for credit cards online\" href=\"http:\/\/emicalculator.bankbazaar.com\/credit-card.html\" target=\"_blank\">apply online here<\/a>.<\/strong><\/p>\n<h2><b>Safety Features<\/b><\/h2>\n<p>Credit card is an oblong piece of plastic with a distinctive card number and your name printed on it along with card issuance and expiry dates. The reverse of the card has a magnetic strip or RFID chip. RBI has instructed banks to issue chip based cards, so that transactions need further authentications by way of a personal identification number (PIN). There is a provision to sign on the back of the card. Please sign immediately on receiving your new card. It is advisable to go for a photo card which is somewhat more safer provided the merchant establishment (ME) bothers to compare your face with the photo! The signature strip at the back also contains a CVV (card verification value) or CVC ( card verification code), which is a minimum 3 digit code unique to your credit card. During usage on the net, you are required to mention this code as it authenticates your physical possession of the card. You should use the card only on websites that are safe and verified; https or hypertext transfer protocol secure sites are the safe sites. In addition you can get your account verified by VISA \/ Mastercard. Here an additional layer of safety is introduced through a one time password generated by the system and communicated through your registered mobile. You can add this safety feature at no extra cost by registering with your bank.<\/p>\n<p>The card and the ATM PIN are separately mailed to you to prevent pilferage and misuse. You should change the PIN on first usage and memorize it. Do not write down the PIN or share it with anyone. When using the card in the ATM or POS, keep one hand over the key pad or cover the keypad with a hanky. Do not disclose your card number to anyone and do not leave your ATM receipt in the ATM booth or the dustbin there. Take it home and destroy it. Your card number is confidential. Hackers can access your account with the card number.<\/p>\n<p>You will need a separate internet password for accessing your account information, statement of account, online payments, online recharge etc. Keep it confidential. Have the habit of checking unbilled credit card transactions so that any fraudulent transaction is found with least time lag. You will also need a T-pin to communicate with phone banking. In case of loss of card, you should immediately inform phone banking and get your card hotlisted. Cardholder liability ceases once the card is hotlisted.<\/p>\n<h2><b>Revolving Credit Facility<\/b><\/h2>\n<p>All the transactions in a 30 days cycle are billed, and 15 days time is made available for payment without any interest charges. Due to this minimum billing cycle, a cardholder can enjoy a interest free credit period of minimum 45 days. However, if the cardholder is unable to pay the full credit card bill, he\/she can pay a minimum of say 5% of the bill and carry over the balance. For the credit period, the card issuer will charge interest which is pretty high. Cash withdrawals also attract high charges. If you are in the habit of regularly rolling over your repayment obligation, you will end up in a debt trap from which it will be difficult to extract yourself apart from losing your CIBIL score.<\/p>\n<p>Some manufacturers provide subvention, in which case, the credit  repayment can be made in EMI free of interest. The EMI will be billed every month till full payment is received in full. For high value individual transactions alone, if you so desire, you can pay in EMI, provided card issuer is prepared to extend this facility to you at a fee.<\/p>\n<h2><b>How do you Pay your Credit Card Bill?<\/b><\/h2>\n<p>If the credit card issuer is the bank with whom you maintain account relationship, you can give a mandate or standing instruction to debit your account. Only, ensure that sufficient balance is always available in the account. If card issuer and the bank where you maintain account relationship are different, you have following payment modes available to you.<\/p>\n<ol>\n<li>Write out a cheque and deposit it at drop boxes available in ATM of card issuing bank<\/li>\n<li>Give an ECS mandate in favor of card issuer to debit your account.<\/li>\n<li>Many card issuers have tie up with service providers like Bill Desk \/ Bill Junction and link is provided on their payment gateway. Make payment through these service providers.<\/li>\n<li>Make payment to card issuer through NEFT from your bank account.<\/li>\n<\/ol>\n<h2><b>What are the Advantages and Disadvantages of Credit Card?<\/b><\/h2>\n<p>Advantage is that you do not need to carry around cash with you. In an emergency, a credit card can be a life saver. One of my friends, who was living away from his family alone in Delhi on account of his job, had a mild heart attack. He had very little cash on his person and balance in his account. This was at the fag end of the month, when salary was yet to be credited. He somehow managed to reach the ATM, withdrew cash on his credit card and got himself admitted to the hospital, wherein he had to shell down ₹30,000 cash. He had no health insurance cover either.<\/p>\n<p>If you plan well, you can enjoy interest free credit. The reward points are freebies you enjoy while spending for your monthly household maintenance. A credit card can be used abroad with no hassles. <a title=\"How do banks make money through credit cards?\" href=\"http:\/\/the-finance-blog.blogspot.in\/2009\/03\/how-do-banks-make-money-through-credit.html\" target=\"_blank\">It is said that advantages to a card issuing bank is more than the card holder!<\/a> But that does not take away the advantages to a card holder. An ME pays a fee called interchange to the banks and network provider in exchange for getting a customer through card usage. Hence, if you bargain with a ME, he may agree for reduction in price provided you pay cash! An ME has to necessarily accept credit cards if it wants to convert customer footfalls  into actual sales.<\/p>\n<p>The disadvantage is that credit cards come in handy for impulsive purchases. Psychologically, we are inclined to spend more when we are using a card rather than when we have to actually shell down hard cash. Irresponsible individuals should never go for a credit card, as they will land themselves in a debt trap.<\/p>\n<p>Use the card responsibly, and enjoy the benefits of a credit card.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this age of consumerism one is lost without a credit card. In developed countries, all retail lending by banks happens through credit cards. In India, banks have categorized retail lending into personal loans, loans for purchase of durable utility articles, vehicle loans, home improvement loans etc., and these are separate retail credit products distinct&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/a-credit-card-primer\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[37,52,69],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A Credit Card Primer - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/a-credit-card-primer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Credit Card Primer - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"In this age of consumerism one is lost without a credit card. In developed countries, all retail lending by banks happens through credit cards. In India, banks have categorized retail lending into personal loans, loans for purchase of durable utility articles, vehicle loans, home improvement loans etc., and these are separate retail credit products distinct&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/a-credit-card-primer\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-09-10T02:36:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-09-20T14:59:38+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/a-credit-card-primer\/\",\"url\":\"https:\/\/emicalculator.net\/a-credit-card-primer\/\",\"name\":\"A Credit Card Primer - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-09-10T02:36:44+00:00\",\"dateModified\":\"2014-09-20T14:59:38+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/a-credit-card-primer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/a-credit-card-primer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/a-credit-card-primer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"A Credit Card Primer\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"A Credit Card Primer - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/a-credit-card-primer\/","og_locale":"en_US","og_type":"article","og_title":"A Credit Card Primer - EMI Calculator","og_description":"In this age of consumerism one is lost without a credit card. In developed countries, all retail lending by banks happens through credit cards. In India, banks have categorized retail lending into personal loans, loans for purchase of durable utility articles, vehicle loans, home improvement loans etc., and these are separate retail credit products distinct&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/a-credit-card-primer\/","og_site_name":"EMI Calculator","article_published_time":"2014-09-10T02:36:44+00:00","article_modified_time":"2014-09-20T14:59:38+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/a-credit-card-primer\/","url":"https:\/\/emicalculator.net\/a-credit-card-primer\/","name":"A Credit Card Primer - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-09-10T02:36:44+00:00","dateModified":"2014-09-20T14:59:38+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/a-credit-card-primer\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/a-credit-card-primer\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/a-credit-card-primer\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"A Credit Card Primer"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-IK","jetpack-related-posts":[{"id":5265,"url":"https:\/\/emicalculator.net\/coronavirus-scare-rbi-provides-emi-deferral-and-cuts-repo-rates\/","url_meta":{"origin":2774,"position":0},"title":"Coronavirus Scare: RBI Provides EMI Deferral and Cuts Repo Rates","date":"March 29, 2020","format":false,"excerpt":"While all of us are staying at home amidst Covid 19 scare, all the expenses including the loan EMIs must still be paid. The salaried employees shouldn’t have much to worry, at least in the very short term since they will continue to get their salaries. However, a certain segment…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7450,"url":"https:\/\/emicalculator.net\/why-an-increase-in-risk-weights-by-rbi-affects-the-loan-interest-rates\/","url_meta":{"origin":2774,"position":1},"title":"Why an Increase in Risk Weights by RBI Affects the Loan Interest Rates?","date":"November 23, 2023","format":false,"excerpt":"The Reserve Bank has recently increased the risk weights on personal loans and credit card receivables. Many questions would have popped up in your mind. What are risk-weights? And how do these risk-weights affect the cost of your loans? In this post, let’s find out. Can the Banks Lend Whatever…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3190,"url":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","url_meta":{"origin":2774,"position":2},"title":"CIBIL Score – Understand How It Affects Your Loan Application","date":"August 31, 2015","format":false,"excerpt":"You had recently applied for home loan with a private bank. You had done thorough research and were really keen to avail loan from this bank. However, your loan application got rejected. You were informed that your loan could not be approved since your CIBIL score was too low. You…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Factors That Affect Your CIBIL Score","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":6792,"url":"https:\/\/emicalculator.net\/how-do-banks-make-money-on-credit-cards\/","url_meta":{"origin":2774,"position":3},"title":"How Do Banks Make Money on Credit Cards?","date":"September 2, 2022","format":false,"excerpt":"You do not pay any interest during the interest-free period on the credit card. But the bank cannot afford to lend you money for free. The bank must be compensated — two major ways and a few minor ways. High Interest on Unpaid Amount First, when you do not pay…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7329,"url":"https:\/\/emicalculator.net\/what-happened-to-my-reward-points\/","url_meta":{"origin":2774,"position":4},"title":"What Happened to My Reward Points?","date":"August 16, 2023","format":false,"excerpt":"Do you use credit cards for cashbacks, discounts, and rewards points? Many of us do. What if the bank were to suddenly reduce such benefits on your credit card? Why Would Your Bank Reduce the Benefits? Yes, the customer may get annoyed and feel cheated. You may use the card…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7439,"url":"https:\/\/emicalculator.net\/5-factors-that-affect-your-credit-score\/","url_meta":{"origin":2774,"position":5},"title":"5 Factors That Affect Your Credit Score","date":"November 16, 2023","format":false,"excerpt":"A good credit score is important. It can provide you with access to a wider range of credit facilities and help reduce the cost of credit. Going forward, your credit score may play an important role in non-financial matters, say employment or taking a house on rent. Fair enough but…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2774"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2774"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2774\/revisions"}],"predecessor-version":[{"id":2784,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2774\/revisions\/2784"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2774"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2774"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2774"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}