{"id":2782,"date":"2014-09-19T09:18:26","date_gmt":"2014-09-19T03:48:26","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2782"},"modified":"2014-09-22T16:12:33","modified_gmt":"2014-09-22T10:42:33","slug":"educational-loans-overview","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/educational-loans-overview\/","title":{"rendered":"Educational Loans: An Overview"},"content":{"rendered":"<p>One of the vital assets a country needs for economic prosperity is an educated population. Economic prosperity cannot be achieved by plentiful natural resources alone. (Of course, there are exceptions like the gulf region which has plentiful deposits of hydrocarbon, and most of the population is not highly educated. They manage with expatriate talent). While Government has a role to play in providing literacy to all the populace, it may not be possible for it to provide higher education free of cost to all the citizens in India. Here, private sector has been playing a vital role. The cost of providing higher education within and outside India being quite exorbitant, students who aspire to pursue higher education, but do not have the financial means look at lending institutions like commercial banks for support. Of course, there are scholarships,  government subsidies etc. available. But there is a lot of competition for it and there are limited number of such opportunities. Banks, especially the public sector ones, have a social responsibility and an obligation to finance educational aspirations of poor but meritorious students.<\/p>\n<h2><b>Why Educational Loans Aren’t Top Priority for Banks?<\/b><\/h2>\n<p>Banks, including the public sector ones, are not very keen to lend to this segment for the following reasons:<\/p>\n<ul>\n<li>It is basically a small ticket business, and requires regular follow up and monitoring disproportionate to the size of the portfolio.<\/li>\n<li>The interest rates have to be necessarily concessional, and as such not a profitable portfolio.<\/li>\n<li>Many borrowers are not in a position to provide tangible collateral, and co-obligation \/ personal guarantees of parent is not a substitute as net worth is either negative or insignificant.<\/li>\n<li>Loan tenures are long and repayments hinge on the student getting a job that generates surpluses sufficient to repay principal and interest. There are no guarantees of securing such a job, and there are no guarantees of the student putting in sufficient efforts to score good marks to be a candidate with good job prospects.<\/li>\n<li>There are many instances of students failing or changing course in the middle or dropping out. Banks are saddled with non-performing asset (NPA) in many such cases.<\/li>\n<li>There are many instances where the whereabouts of borrower and \/ or parents is not available, due to long tenure of the loan forcing bank managers to act as detectives and run around to get an acknowledgment of debt. This happens when the parent is not a permanent resident of the place, and was living there to pursue his vocation or job and shifted without informing the bank deliberately.<\/li>\n<li>Students who have gone abroad for higher studies may migrate to the foreign country and forget about the bank loan. Banks find it immensely difficult to trace such borrowers and even if traced, make them fulfill their legal obligation in India to the lending bank.<\/li>\n<li>Above are some of the reasons why commercial banks are not very keen in India to lend to this segment. Many bankers, while agreeing on the need to finance this sector, also believe that it is not a commercial proposition to lend to this sector for a commercial bank.<\/li>\n<\/ul>\n<h2><b>Educational Loan Schemes and Their Requirements<\/b><\/h2>\n<p>RBI, and Indian Banks Association (IBA) have framed certain guidelines taking into account the needs of the borrowers and the reservations of the banks to lend to this sector. RBI has brought educational loans under priority sector lending. Loans have been broadly classified as loans for inland study up to ₹10 lakhs and loans for foreign studies up to ₹20 lakhs to be eligible to qualify as priority sector lending. (Banks are required to lend up to 40% of their net credit to priority sector or sectors which RBI considers as thrust areas for sustained lending). The guidelines given by RBI \/ IBA are just that. Within the guidelines, banks are free to bring out their own loan schemes. The rate of interest and loan tenure, for example, may differ from bank to bank. Banks may also lend without any collateral whatsoever, if they are comfortable with that. However, banks are required to follow priority sector lending guidelines as far as time limit for disposal of applications for loans are concerned. Banks are required to dispose the loan applications within 15 to 30 days max from date of receipt of applications. This is taking into account compliance of borrower to the documentation requirement of the bank, and not for unnecessary bureaucratic handling. Given below is a standard scheme of  leading banks in the private and public sector combined.<\/p>\n<ul>\n<li>The borrower can be a minor or a major. If he\/she is a minor, then the father\/guardian shall execute the papers with undertaking from minor to ratify the same once he\/she attains majority and execute a binding agreement in favor of the bank.<\/li>\n<li>The borrower should meet the minimum marks\/grade requirement set  by the bank at the qualifying stage for higher studies. For example, if one wants to pursue post graduation, bank may prescribe minimum qualifying mark in graduation as 65% in all subjects or say Grade A pass. In the case of higher studies abroad, GMAT \/ GRE scores may also be taken into account. Banks may also insist on provisional admission letter from the educational institution along with the fee structure. Educational loan component may also include hostel or boarding charges, study tour expenses, cost of reference books, laboratory equipment etc. In the case of studies abroad, loan component may also include the travel fare.<\/li>\n<li>Some educational institutions abroad insist on capability certificate before confirming admission. This may be issued taking into account the solvency of the sponsor to meet the expenses plus the loan component.<\/li>\n<li>Students who have been awarded any meritorious scholarship can also be considered for educational loan for expenses above the scholarship component, treating the scholarship amount as margin for the loan.<\/li>\n<li>Banks have set the maximum loan amount as ₹10 lakhs for inland studies and ₹20 lakhs for foreign studies. As a scheme, this is the ceiling all banks have prescribed. However, banks may at their discretion consider a higher limit on special terms and conditions.<\/li>\n<li>Where parent is affluent and capable of funding educational expenses of the ward on their own, bank may insist on knowing the reason for going in for a loan. If not satisfied and there is reasonable doubt about the intention, then loan may be refused.<\/li>\n<li>Courses leading to diploma, graduation, post graduation, doctorate, vocational qualification etc. are considered for the loans. It includes distance learning courses. Banks, however, may put a condition that courses should be approved by overseeing agencies like AICTE, University etc.. One of the banks had given an educational loan for pursuing graduation in medicine to a borrower in an obscure educational institution in Kiev. The degree was not recognized by the Indian Medical Association, and the borrower was unable to practice in India. Borrower could not earn and repay the loan, and ultimately the loan became a bad loan. Hence, it is in borrower’s own interest to ascertain the legitimacy of the course before and not after completion of the course.<\/li>\n<li>Repayment of the loan is normally set to start at course period + 1 year or 6 months after getting job, whichever is earlier. For loans up to ₹7.5 lakhs, tenure of the loan can be up to 10 years and for loans beyond ₹7.5 lakhs it can stretch up to 15 years. Loans are to be repaid along with accrued interest in EMI. No prepayment penalty shall be levied. No processing charges or any other fee is normally levied on educational loans.<\/li>\n<li>The viability of the loan is judged on the basis of the course for which the borrower is applying and the earning capacity of borrower based on the average earning in such job \/ profession for a newbie.<\/li>\n<li>Courses \/ vocational training etc. after completing 10+2 are considered as higher education under the scheme. Pursuing a graduation course also falls under higher education. An employed person is also eligible to apply for a loan for higher studies. Such persons can have the benefit of adding to their qualifications and hope for better career prospects along with tax rebates on loan taken. IT rebate is available under <a href=\"http:\/\/www.charteredclub.com\/section-80e-education-loan\/\">Section 80E<\/a> for the interest component of EMI on the loan taken and not the principal portion .<\/li>\n<\/ul>\n<h2><b>Conclusion<\/b><\/h2>\n<p>It is desirable for a prospective borrower to study the schemes offered by different banks and opt for the most competitive one. While all the  banks offer fixed spread over base rate of interest, in some cases such as students belonging to backward community, minority community etc., interest subsidy is made available by the state governments under their welfare schemes. The spread over base rates are normally based on quantum of the loan. The slabs are i) up to ₹4 lakhs, ii) up to ₹7.5 lakhs and iii) above ₹7.5 lakhs. As per RBI guidelines, loans up to ₹4 lakhs are to be made available without any sort of collateral, and tangible security may be insisted only if the loan quantum exceeds ₹7.5 lakhs. Banks may, at their discretion, insist on a insurance policy on the life of the borrower, duly assigned to them. The individual bank schemes are more or less based on RBI \/ IBA guidelines but some vital differences like rate of interest need to be ascertained before opting for a bank’s scheme. This is because the base rates of banks differ from bank to bank.<\/p>\n<p>No bank can refuse an educational loan proposal on flimsy grounds. However, a loan is not a right, but a facility made available to meritorious students. If a proposal is falling within the scheme, banks cannot refuse to consider the same without valid reasons. If refused at branch level, aggrieved applicants can approach the reporting authority of the bank for redressal. One of my students who had taken an educational loan from a well known bank was charged processing fees, demand draft commission etc. by the bank. On his taking up with the higher authorities in the bank, it was promptly refunded. I jocularly told the branch manager that because my student had an intention to repay, he was concerned about bank charges!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the vital assets a country needs for economic prosperity is an educated population. Economic prosperity cannot be achieved by plentiful natural resources alone. (Of course, there are exceptions like the gulf region which has plentiful deposits of hydrocarbon, and most of the population is not highly educated. They manage with expatriate talent). While&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/educational-loans-overview\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[70,71,38],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Educational Loans: An Overview - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/educational-loans-overview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Educational Loans: An Overview - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"One of the vital assets a country needs for economic prosperity is an educated population. Economic prosperity cannot be achieved by plentiful natural resources alone. (Of course, there are exceptions like the gulf region which has plentiful deposits of hydrocarbon, and most of the population is not highly educated. They manage with expatriate talent). While&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/educational-loans-overview\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-09-19T03:48:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-09-22T10:42:33+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/educational-loans-overview\/\",\"url\":\"https:\/\/emicalculator.net\/educational-loans-overview\/\",\"name\":\"Educational Loans: An Overview - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-09-19T03:48:26+00:00\",\"dateModified\":\"2014-09-22T10:42:33+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/educational-loans-overview\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/educational-loans-overview\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/educational-loans-overview\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Educational Loans: An Overview\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Educational Loans: An Overview - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/educational-loans-overview\/","og_locale":"en_US","og_type":"article","og_title":"Educational Loans: An Overview - EMI Calculator","og_description":"One of the vital assets a country needs for economic prosperity is an educated population. Economic prosperity cannot be achieved by plentiful natural resources alone. (Of course, there are exceptions like the gulf region which has plentiful deposits of hydrocarbon, and most of the population is not highly educated. They manage with expatriate talent). While&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/educational-loans-overview\/","og_site_name":"EMI Calculator","article_published_time":"2014-09-19T03:48:26+00:00","article_modified_time":"2014-09-22T10:42:33+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/educational-loans-overview\/","url":"https:\/\/emicalculator.net\/educational-loans-overview\/","name":"Educational Loans: An Overview - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-09-19T03:48:26+00:00","dateModified":"2014-09-22T10:42:33+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/educational-loans-overview\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/educational-loans-overview\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/educational-loans-overview\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Educational Loans: An Overview"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-IS","jetpack-related-posts":[{"id":3429,"url":"https:\/\/emicalculator.net\/common-questions-when-applying-for-education-loan\/","url_meta":{"origin":2782,"position":0},"title":"Common Questions When Applying for Education Loan","date":"March 4, 2016","format":false,"excerpt":"Cost of higher education has been rising sharply even for the colleges in India. The fee for many programs has gone up by up to 5 times in the past decade.  The fee for the top business schools ranges anywhere from Rs 15 lacs to Rs 25 lacs. And this…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/sbi-student-scholar-loan-scheme.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4848,"url":"https:\/\/emicalculator.net\/central-sector-interest-subsidy-scheme-csis-for-education-loans\/","url_meta":{"origin":2782,"position":1},"title":"Central Sector Interest Subsidy Scheme (CSIS) for Education Loans","date":"May 17, 2019","format":false,"excerpt":"Education loans have a unique feature. That feature is moratorium on interest payments. On home loans, you get a moratorium on principal repayments (Pre-EMI) and not interest payments. Interest must be paid on time. Even for corporate loans, moratorium is typically only for principal repayments. And there is good rationale…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4540,"url":"https:\/\/emicalculator.net\/comparison-of-education-loan-schemes-from-punjab-national-bank\/","url_meta":{"origin":2782,"position":2},"title":"Comparison of Education Loan Schemes from Punjab National Bank","date":"November 30, 2018","format":false,"excerpt":"In this post, let’s look at a few education loan products from Punjab National Bank. We will compare four education loan products from PNB. PNB Saraswati (For higher education in India) PNB Pratibha (For admission to premier institutes such as IITs\/IIMs\/AIIMS) PNB Udaan (For higher education abroad) PNB Kaushal (For…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4296,"url":"https:\/\/emicalculator.net\/sbi-student-loan-scheme\/","url_meta":{"origin":2782,"position":3},"title":"All You Need to Know about SBI Student Loan Scheme","date":"April 15, 2018","format":false,"excerpt":"Higher education is getting expensive every day. For many families, such education must be financed through an education loan. All the banks and NBFCs provide education loans. In this post, I will discuss a popular education loan scheme from the State Bank of India: SBI Student Loan Scheme. SBI Student Loan:…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/SBI-student-loan-interest-rates.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3831,"url":"https:\/\/emicalculator.net\/tax-benefits-on-education-loan\/","url_meta":{"origin":2782,"position":4},"title":"Tax Benefits on Education Loan","date":"April 4, 2017","format":false,"excerpt":"Higher education is getting expensive each year. Management education at any premier management institute in India will cost north of Rs 15 lacs for two years. And the high cost is not just limited to management education. Not everyone may have the resources to fund such education on own. Those…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4507,"url":"https:\/\/emicalculator.net\/vidya-lakshmi-portal-a-single-window-electronic-platform-to-apply-for-education-loan-from-multiple-banks\/","url_meta":{"origin":2782,"position":5},"title":"Vidya Lakshmi Portal: A Single Window Electronic Platform to Apply for Education Loan from Multiple Banks","date":"November 19, 2018","format":false,"excerpt":"You need an education loan for higher studies. To be on the safer side, you want to apply to multiple banks, but the effort required to make multiple applications scares you. Here is a fine solution for you. The Government of India has launched a portal “Vidya Lakshmi”, where you can search…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/image1-3.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2782"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2782"}],"version-history":[{"count":2,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2782\/revisions"}],"predecessor-version":[{"id":2785,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2782\/revisions\/2785"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2782"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2782"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2782"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}