{"id":2786,"date":"2014-09-22T17:59:46","date_gmt":"2014-09-22T12:29:46","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2786"},"modified":"2014-09-23T11:12:23","modified_gmt":"2014-09-23T05:42:23","slug":"an-introduction-to-savings-and-investments-part-2","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/","title":{"rendered":"An Introduction to Savings and Investments – Part 2"},"content":{"rendered":"<p>We discussed some of the traditional investment products in the <a title=\"An Introduction to Savings and Investments – Part 1\" href=\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-1\">first part of this article<\/a>. In continuation of where we left off, we shall look at some other investment avenues. To start with, let us look at another popular plain vanilla product &#8211; Recurring Deposit (RD). This product is available with all the banks with some variations. The variations are minor and relate to minimum monthly deposit, the rate of interest, the minimum tenure and closure before maturity rules.<\/p>\n<h2><b>Recurring Deposit &#8211; the convenient way to save<\/b><\/h2>\n<p>As the name suggests, you invest a round sum every month till the contracted period. RD is basically a term deposit product, wherein instead of making an individual term deposit every month, you build up savings through a differentiated product. The maturity value of the deposit is indicated upfront. On maturity, you get the <a href=\"http:\/\/www.iba.org.in\/formula.asp\">principal amount plus interest<\/a> in one lump sum provided you have paid the installments regularly on due dates. The interest is compounded quarterly. The main attraction of this deposit is for salary earners, who can deposit a fixed sum every month by giving a mandate or standing instruction to the bank to debit their transaction account. RD interest is exempted from TDS. However, you need to add this accrued interest to your annual income and pay tax on it, based on which tax slab you are in. You can pay tax either every financial year based on accrued interest or at maturity based on the aggregate interest. Banks generally give loans against RD (maximum loan is principal plus accrued interest less margin) at a rate which is 1% higher than the contracted interest rate for RD.<\/p>\n<p>There is no special advantage in this product vis-a-vis a reinvestment term deposit, other than the convenience of a mandate or standing instruction. However, it may be mentioned that you get the contracted interest for the tenure of the  deposit, even though later deposit installments have shorter tenure.<\/p>\n<p>This product is regulated by <a title=\"Reserve Bank of India\" href=\"http:\/\/www.rbi.org.in\/\" target=\"_blank\">RBI <\/a>and <a title=\"Indian Banks' Association\" href=\"http:\/\/www.iba.org.in\/\" target=\"_blank\">IBA<\/a>.<\/p>\n<h2><b>Gold &#8211; The promise of wealth!<\/b><\/h2>\n<p>Do Indians consider gold as an investment? If so, why do they invest in gold jewellery instead of gold bars, biscuits and coins? Gold jewellery is not a liquid investment. It is difficult to sell gold jewellery for cash. Even if it is possible, the net amount you get will be after deducting making charges etc. which you had paid when buying the jewellery. These can be as high as 20 to 25% of the amount you originally paid. Not a good idea to buy gold jewellery as an investment option. Of course, in case of emergencies you can raise a gold loan by pledging the family jewels.<\/p>\n<p>What about gold coins and bars? This is a better option than buying jewellery. However, while banks sell gold coins and bars, they do not buy them. It is therefore advisable to buy from reputed jewellers with a guaranteed buyback and guaranteed 99.9% purity. The main drawback of investment in gold is that, you do not get any return by way of a coupon or dividend as in other investments. You have to only look for capital appreciation. The average return for a medium term holding in gold may be in the range of 10 to 12% PA. Sometimes the wait can be quite long, if you invested at the peak prices. The price of gold in India is influenced by international prices, the exchange rate for USD\/INR, the customs duty, VAT etc. Holding physical gold is fraught with the risk of pilferage. Or you may have to hire a bank locker to keep them safe. Banks do not give loans against gold coins and bars.<\/p>\n<p>You have a choice of investing in paper gold through gold  ETF, gold fund of funds or gold equity funds. Gold equity funds are not traded in India, because we do not have listed Indian companies directly engaged in gold mining, refining etc. Therefore we shall examine ETF and Fund of Funds.<\/p>\n<p>To invest and trade in <a title=\"Gold ETF\" href=\"http:\/\/www.nsegold.com\/KNOW%20ALL%20ABOUT%20GOLD%20ETF.pdf\" target=\"_blank\">Gold ETF<\/a>, you need to have a trading account with a broker and a demat account. Brokerage and Demat charges are additional charges. ETF is a mutual fund product whose units can be bought and sold in the exchange. One unit represents one gram of gold. The units can be redeemed for physical gold only if it is for a minimum quantity of a kilogram of gold.<\/p>\n<p>Fund of funds is one where you need not have a trading or demat account. You are investing in a mutual fund which invests in Gold ETF. The <a title=\"Should you buy a gold fund of funds?\" href=\"http:\/\/timesofindia.indiatimes.com\/business\/india-business\/Should-you-buy-a-gold-fund-of-funds\/articleshow\/15795746.cms\" target=\"_blank\">gold fund of funds have underperformed the ETF<\/a> due to several reasons. It is therefore advisable to invest in an ETF rather than fund of funds.<\/p>\n<p>ETF is taxed like a debt mutual fund. Capital gains where the holding is less than a year is considered as short term capital gain, and gains beyond an year of holding is considered to be a long term capital gain. You can take indexation benefit in the case of long term capital gain as applicable to a debt fund.<\/p>\n<p>Gold in physical form or paper form are attractive when inflation rates are high. This is because gold is considered as a safe haven when all other asset class fail, and demand pushes up the prices.<\/p>\n<h2><b>Initial Public Offering or IPO &#8211; The taste of things to come?<\/b><\/h2>\n<p>You can invest in equity shares or corporate debt instruments through the secondary market or through the IPO route. For both, you need a Demat account. To sell or buy these securities in the stock exchange, you need a trading account. This product is regulated by SEBI.<\/p>\n<p>When a company goes public, it invites applications from the prospective investors after SEBI has approved the issue. A company approaches a merchant banker for all matters connected with the issue including the pricing. The issue also gets rated by a rating agency, which of course does not venture into the pricing aspect or guarantee the ROI. The main terms of the issue are spelt out in the document called the prospectus, or red herring prospectus when it is a book built issue. The difference between the former and latter is that one is an issue at a fixed price, and another is an issue where the price is arrived at through a process of price discovery wherein bids are made through a syndicate. The application for the shares can be made either through an application form submitted physically along with payment to the banker to the issue or through online banking under ASBA. ASBA stands for Application Supported by Blocked Amount. The amount of application money is blocked by the bank from your savings account and you continue to earn interest on it. The blocked amount will be either used to pay for allotted shares or refunded in the case of non-allotment. Only self certified syndicate banks, whose names are listed by SEBI, can accept ASBA. As per <a title=\"More Transparency, less IPOs\" href=\"http:\/\/www.karvy.com\/articles\/ipochange.htm\" target=\"_blank\">current SEBI guidelines<\/a>, an issue is reserved for allotment to the extent of 10% of issue size to small investors. A small investor is one who has applied for shares whose value does not exceed ₹2 lakhs. These rules provide better chances of allotment for smaller applications. But many a times, investors have burnt their fingers by subscribing to shares that have subsequently tanked in the secondary market. This main risk in IPO is now addressed by SEBI by making it mandatory for issuer to have a buy back arrangement in place up to 1000 shares to original allottees up to 6 months from listing as a safety net.<\/p>\n<p><strong>What are the advantages and disadvantages in subscribing to IPO?<\/strong><\/p>\n<p>The main advantage is that the minimum amount of investment is not large. Unlike secondary market investment, you save on brokerage and STT. You can take advantage of price movements on initial listing, provided it is at a premium to issue price. Losses can be minimized through safety net. You can apply through ASBA and online banking with minimum hassles. You may be lucky enough to invest in a <a title=\"Ten Bagger\" href=\"http:\/\/en.wikipedia.org\/wiki\/Ten_bagger\" target=\"_blank\">multi-bagger<\/a>. The investment is quite liquid. The short term capital gain tax is 10% and there is no long term capital gains tax.<\/p>\n<p>The disadvantage is that most good IPO are very highly priced and there is hardly anything left on the table for the investors. Most issues by well known names get highly oversubscribed, and either you get a refund or you are allotted a very small number of shares limiting your gains. You must have a demat account. Transaction costs include brokerage, STT when you sell your IPO shares.<\/p>\n<p>There are professionals who invest in IPO for listing gains and make it their regular activity. There is also a thriving grey market for IPO shares.<\/p>\n<h2><b>Corporate Debt &#8211; The fixed income story<\/b><\/h2>\n<p>Companies issue debt instruments called debentures and bonds. They mostly offer a fixed interest return. Debentures may be partly or fully convertible into shares. Such instruments are called hybrid instruments. Debentures can also be non-convertible, secured or unsecured. They may be redeemable or irredeemable. You rarely see irredeemable debentures or bonds. These are issued by some reputed MNC banks for their tier II capital. Some debenture issues may carry tradable share warrants for subscribing to shares of issuer at indicated price, which would be lower than the market price. Corporate bonds listed in the exchange provide easy liquidity. You can subscribe to IPO of corporate debt instrument or invest through the secondary market. You can increase your yield on investment by going in for debentures and bonds from secondary market which are available at a discount to issue price. Debt instruments issued require to be rated as per SEBI guidelines. A highly rated paper which is secured carries a lower default risk, and can give a steady interest stream. This investment is attractive if you are risk averse and require an uninterrupted fixed income. You need to have a demat account and a trading account for trading in corporate debt.<\/p>\n<p>Current tax laws require TDS to be deducted on interest from debt instruments. TDS may not be deducted if the instrument is issued in demat form, but you need to add the interest income to your taxable income. Capital gains tax is applicable to both short term and long term investments. Indexation benefit can be availed for long term capital gains. Since this is a fixed income investment, it is subject to interest rate risk.<\/p>\n<h2><b>Company Fixed Deposits &#8211; The icing on the cake<\/b><\/h2>\n<p><a title=\"New Companies Act, 2013\" href=\"http:\/\/www.kpmg.com\/IN\/en\/services\/Tax\/FlashNews\/New-Companies-Act-2013-Insight-Series-VolIII.pdf\" target=\"_blank\">Listed companies can accept deposits from the public<\/a> subject to the provisions of the companies act and SEBI regulations. There are a number of well rated companies accepting deposits at interest rates much higher than that offered by your neighborhood bank. However, they are much more risky compared to a bank FD. They are also not liquid as compared to a bank FD. In a bank FD, an investor has an embedded option and can close the deposit before maturity, or a depositor is entitled for a loan against deposit. These facilities are not available with company deposit. There is no TDS on bank deposits if aggregate interest income of all deposits is less than ₹10,000. In a company deposit, the threshold limit is ₹5,000. Interest income is taxable in both the cases. You have the flexibility of depositing for a minimum tenure of 7 days and maximum of 120 months in a bank. Company deposits have a minimum tenure of 1 year and maximum of 3- 5 years.<\/p>\n<p>The higher interest rate offered by corporate is offset by the advantages of a bank deposit. Still if liquidity is not an issue and deposit is for a short term, well rated company deposits are a good option.<\/p>\n<h2><b>Conclusion<\/b><\/h2>\n<p>Which product or asset class is the best out of the lot is debatable. It is dependent on your risk appetite, investment profile and your time horizon. These articles are meant to give you an input on the pros and cons and how the product works. You will have take your own decision as to where to put your hard earned money or consult an investment advisor. In the next part, we shall discuss some additional products such as sovereign bonds, overseas investments, structured products etc..<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We discussed some of the traditional investment products in the first part of this article. In continuation of where we left off, we shall look at some other investment avenues. To start with, let us look at another popular plain vanilla product &#8211; Recurring Deposit (RD). This product is available with all the banks with&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[63,75,74,62,73,72,77],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>An Introduction to Savings and Investments – Part 2 - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An Introduction to Savings and Investments – Part 2 - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"We discussed some of the traditional investment products in the first part of this article. In continuation of where we left off, we shall look at some other investment avenues. To start with, let us look at another popular plain vanilla product &#8211; Recurring Deposit (RD). This product is available with all the banks with&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-09-22T12:29:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-09-23T05:42:23+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\",\"url\":\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\",\"name\":\"An Introduction to Savings and Investments – Part 2 - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-09-22T12:29:46+00:00\",\"dateModified\":\"2014-09-23T05:42:23+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"An Introduction to Savings and Investments – Part 2\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"An Introduction to Savings and Investments – Part 2 - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/","og_locale":"en_US","og_type":"article","og_title":"An Introduction to Savings and Investments – Part 2 - EMI Calculator","og_description":"We discussed some of the traditional investment products in the first part of this article. In continuation of where we left off, we shall look at some other investment avenues. To start with, let us look at another popular plain vanilla product &#8211; Recurring Deposit (RD). This product is available with all the banks with&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/","og_site_name":"EMI Calculator","article_published_time":"2014-09-22T12:29:46+00:00","article_modified_time":"2014-09-23T05:42:23+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/","url":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/","name":"An Introduction to Savings and Investments – Part 2 - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-09-22T12:29:46+00:00","dateModified":"2014-09-23T05:42:23+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"An Introduction to Savings and Investments – Part 2"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-IW","jetpack-related-posts":[{"id":2955,"url":"https:\/\/emicalculator.net\/recurring-deposits-an-incredibly-useful-product\/","url_meta":{"origin":2786,"position":0},"title":"Recurring Deposits: An Incredibly Useful Product","date":"March 9, 2015","format":false,"excerpt":"My neighbour, an employee of a private firm came to me with a strange request last week. She wanted my advice on the type of bank account she should invest her money in so as to earn more than what she was earning in a savings account. Her ultimate goal…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6919,"url":"https:\/\/emicalculator.net\/move-over-bnpl-here-comes-snbl-save-now-buy-later\/","url_meta":{"origin":2786,"position":1},"title":"Move over BNPL, Here Comes SNBL (Save Now, Buy Later)","date":"October 16, 2022","format":false,"excerpt":"We plan for regular monthly expenses. We call it budgeting. We plan for long term goals through a diversified asset allocation portfolio. However, we tend NOT to plan properly for non-monthly but periodic expenses. Common examples are: Insurance premiums Travel and Vacations Birthdays and Anniversaries Vehicle maintenance Gadget purchases Annual…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2767,"url":"https:\/\/emicalculator.net\/an-introduction-to-savings-and-investments-part-1\/","url_meta":{"origin":2786,"position":2},"title":"An Introduction to Savings and Investments &#8211; Part 1","date":"September 9, 2014","format":false,"excerpt":"Managing your money involves optimising your earnings by planning your spending and investing your surpluses wisely. You can manage your spending and savings by budgeting for it and sticking to your budget. A Rupee saved is a Rupee earned. Saving involves certain amount of investment savvy for asset allocation to…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2921,"url":"https:\/\/emicalculator.net\/is-buying-property-a-good-investment\/","url_meta":{"origin":2786,"position":3},"title":"Is Buying Property a Good Investment?","date":"January 20, 2015","format":false,"excerpt":"At the outset, let me hasten to clarify that this article is not about renting vs buying a property. This article is purely an analysis on investing in real estate, its plus and minus points. i.e., treating direct investment in real estate as one of the avenues for deploying your…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":5766,"url":"https:\/\/emicalculator.net\/overspent-during-the-festive-season-what-should-you-do\/","url_meta":{"origin":2786,"position":4},"title":"Overspent during the Festive Season? What Should You Do?","date":"December 16, 2020","format":false,"excerpt":"I spoke to a client a few days ago. She told me that she ended up spending over 5 lacs in the recent Diwali season towards all kinds of purchases including gifts. A few insurance premium payments also came due in the month of November. While she had an idea…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7008,"url":"https:\/\/emicalculator.net\/how-to-plan-for-a-big-ticket-purchase\/","url_meta":{"origin":2786,"position":5},"title":"How to Plan for a Big-Ticket Purchase?","date":"December 14, 2022","format":false,"excerpt":"The keyword here is “plan”. We don’t focus on instances when your big purchases are forced, say your mobile phone or laptop conks off suddenly. Or your bike or car is suddenly showing problems and the cost of repair is too high and not justified. There is not much you…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2786"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2786"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2786\/revisions"}],"predecessor-version":[{"id":2794,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2786\/revisions\/2794"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}