{"id":2797,"date":"2014-10-03T14:31:02","date_gmt":"2014-10-03T09:01:02","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2797"},"modified":"2014-10-03T14:36:29","modified_gmt":"2014-10-03T09:06:29","slug":"apartment-vs-independent-house-make-the-right-choice","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/","title":{"rendered":"Apartment Vs. Independent House &#8211; Make the Right Choice"},"content":{"rendered":"<p>Our cities have started to grow vertically on account of residential apartment complexes, shopping malls and multi-storeyed office space, technology parks etc., being built at a frenetic pace. A City like Mumbai, of course, was forced to grow vertically due to several factors, much before other metros in India had embraced this model of growth. Mumbai also has the dubious distinction of having one of the largest slums in Asia. Apartments as a dwelling was more out of compulsions rather than as a choice of the home owners. Let us try to capture some of the compelling reasons for this vertical growth.<\/p>\n<ul>\n<li>One reason is population explosion and migration resulting in pressure on the land and land prices reaching astronomical proportions and beyond the reach of the common man. In Mumbai, reclamation of land from the sea has also not eased the situation. Even city development authorities are allotting land developed by them at quite high prices and it is only marginally lower than those developed by private parties. It is also a matter of luck to get an allotment and sometimes after a very long wait.<\/li>\n<li>The late 90’s witnessed the corporate sector accessing funds from the capital markets rather than depending on bank borrowings. The Banks had to rework their asset building strategy, and a new word was coined: “retail lending”. In other words, a loan portfolio of individual borrowers. Competition among banks to finance this retail demand resulted in availability of long term finance for housing at competitive rates for acquiring residential houses including apartments. This actually gave the impetus to the real estate market and a demand push. To service this demand many players entered the market and the demand of the masses at the particular price point could be met mainly by offering apartments rather than ready built houses or villas.<\/li>\n<li>The procedural delays in obtaining various approvals, corruption, the role of black money, frequent changes in government rules and regulations, multiplicity of agencies, difficulties in establishing genuineness in land transactions, and general perception that it is better to deal with a single builder, who will hopefully take care of all the aspects and provide a good title to house property also contributed to proliferation of apartment buildings.<\/li>\n<li>Most of all, apartments have a much smaller price tag per sqft compared to an independent house as the land cost is shared by all the apartment owners and share in the undivided land is very small compared to the built up area of the flat.<\/li>\n<\/ul>\n<p>Now that there is acceptability in owning an apartment rather than an independent house we should look at the pros and cons in owning an independent house and an apartment if one had a choice and the financial means to make such a choice.<\/p>\n<h2><b>Advantages in Owning an Apartment<\/b><\/h2>\n<ul>\n<li>You have a wide choice of dwellings at various price points at various locations with specifications according to one’s  means and choices. It is practically a super market out there!<\/li>\n<li>You have an opportunity to live in a gated community and develop lifelong friendships and learn to live as a member of a team. Community living at its best!<\/li>\n<li>The apartment complexes, by virtue of a large number of households, attract a large number of businesses to be set up nearby and within no time the area develops and becomes self sustainable without a need to visit central business district (CBD). This also results in appreciation of the property. Locational advantage over a short period of time!<\/li>\n<li>With amenities like clubhouse, swimming pool, gymnasium, shopping complexes, ATM etc., apartment complexes can provide access to various facilities within the complex.<\/li>\n<li>Apartment complexes are comparatively safer and you can lock your apartment and go out of station with minimum worry.<\/li>\n<li>Apartment complexes have service providers like mason, plumber, electrician, carpenters, laundry etc., on retainership and the services are more easily accessible at standard rates.<\/li>\n<li>Since it is a large group, apartment resident associations have more clout than an individual to make civic agencies heed their complaints and generally deal with common problems.<\/li>\n<li>Garbage segregation and collection is done responsibly without stinking up the neighbourhood.<\/li>\n<li>All common issues are addressed by the association and an individual need not go around trying to address them.<\/li>\n<li>The appreciation in the value of an apartment is commensurate with the initial investment one makes.<\/li>\n<li>Selling and buying an apartment is a much quicker proposition than selling and buying a house mainly because of the higher cost of an independent house on account of land appreciation. The size of the deal in the case of an independent house will be much bigger for this reason. Banks finance the deals based on valuation and residual life of the property whether it is an independent house or an apartment.<\/li>\n<li>Apartments in high rises provide better ventilation and sunlight.<\/li>\n<li>Accessibility to CBD\/workplace, inadequate public transport etc., being important factor for many, it meant going in for apartments constructed in CBD or in close proximity to it at a reasonable cost.<\/li>\n<li>Property experts advise investing in an apartment complex because private land\/house deals are more prone to cheating and fraud. As an individual it is very difficult to remedy such a situation. If the land is allotted by the city development authority, you may not face such situations.<\/li>\n<li>For senior citizens with no supportive family, apartments may be the best choice.<\/li>\n<li>Festivals and national events are celebrated as a community in a grand scale by apartment residents. Individual house owners can not match it in sheer size or grandeur.<\/li>\n<\/ul>\n<h2><b>Disadvantages in Owning an Apartment<\/b><\/h2>\n<ul>\n<li>The biggest drawback is that you cannot do any independent add-on construction or alterations.<\/li>\n<li>The maintenance you need to pay to the owners’ association is a regular monthly cash outgo whether you use the amenities or not. The maintenance charges keep increasing year after year.<\/li>\n<li>One of the main components of maintenance can be water charges. The water requirement is massive in an apartment complex and the civic authorities arrangements for water supply may have to be supplemented by buying water from private vendors at very high cost. It is not possible to control water wastage and water charges end up as a major component of maintenance. Thoughtless residents contribute to wastage of electricity as well in their misuse of elevators, common lighting,  elevator fans left on etc. People somehow do not realize that nothing is free, and the care you take for personal expenses need to be there when you use the common facilities as well!<\/li>\n<li>You are forced to live in very close proximity with your neighbours even if you abhor them! Some neighbours can be pretty bad!<\/li>\n<li>Your immediate neighbour&#8217;s wall may be your wall too! A noisy neighbour who believes in frequent parties or with a brood of noisy children may cause you lot of problems and you will have little or no control over it other than complaining to the association and making your neighbour your number one enemy.<\/li>\n<li>You are bound by decisions taken by your owners’ association even if you personally disagree with them.<\/li>\n<li>You can at the most keep potted plants in your balcony. You cannot dream of having a garden and growing your favourite fruits and vegetables.<\/li>\n<li>Keeping pets is difficult if other residents have problems with it and complain about it.<\/li>\n<li>While regular maintenance is carried out, major works like repainting the apartment building etc., cost a packet and may deplete the corpus fund requiring further contributions in lump sum.<\/li>\n<li>One has no control over the quality of construction and material used by the builder. A builder bent on maximizing profits at any cost may ultimately hand you a lemon! In other words, an unscrupulous builder may end up providing you a substandard dwelling which may even be a hazard to live in! The frequent media coverage of building collapses due to shoddy constructions should be a warning and make one cautious when selecting the project of an unknown builder.<\/li>\n<li>If there are legal hassles which was not disclosed by the builder like large scale deviations, illegal construction etc. your dream dwelling may even be demolished by the authorities or eviction orders issued as in the case of <a title=\"Campa Cola Compound Case\" href=\"http:\/\/en.wikipedia.org\/wiki\/Campa_Cola_Compound_Case\" target=\"_blank\">Campa Cola<\/a> society in Mumbai! This, of course, can happen in the case of an independent house as well!<\/li>\n<li>Human nature being what it is, it is not always hunky dory even in a apartment complex. Sometimes there are groups within groups and infighting which are definitely a negative factor for community well being.<\/li>\n<\/ul>\n<h2><b>What are the Advantages and Disadvantages in Owning an Independent House?<\/b><\/h2>\n<p>The answer to  the above poser can be found in the advantages and disadvantages mentioned in owning an apartment.<\/p>\n<ul>\n<li>The biggest advantage in owning an independent house to my mind is that you have control over the design and architecture of the house along with cost effective use of materials used and the quality. How much of the land is to be used for construction and how much is to be left vacant for gardening or future construction is your decision. Frankly, I have come across many individuals who have regrets over the design and\/or materials used etc. after house construction is complete. This mainly happens when one wants to contain costs. What I mean to say is, constructing your own dwelling is no guarantee that you will be 100% happy with your decisions. Some have constructed houses in 100% of the land and park their cars on the public roads causing a nuisance to other road users and reduced to worrying about the safety of their vehicles. In apartments, you can either buy your parking place or rent it.<\/li>\n<li>If you are the owner of land and planning to construct your dream home later, you always have the threat of encroachment. You need to fence the plot of land and put up notices about your ownership to the land. You may also need to construct a shed and employ a watchman. Now, in cities like Bangalore you also have the nuisance of your plot being used as a garbage dump! These problems are exclusive to independent houses, because the builder takes care of these aspects in the case of construction of apartment complex.<\/li>\n<li>There are people who have borrowed heavily and built their independent house, and later on sold it as they could not service the loans. There are also people who have half built their houses and could not complete it due to lack of funds. Financial viability is very important when you build your own home because cost escalations can be there, unlike in the case of an apartment where you can have a watertight agreement with the builder with no cost escalation clause. Of course, you can build a small house with provision to add floors later, based on the need and your financial situation. This flexibility is not there in an apartment.<\/li>\n<li>In this era of nuclear families with both husband and wife working for a living, the preference is for an apartment, whether on ownership or on rent. Hence, in the cities the rental space is preferred in apartment complexes, and enjoy a better demand as well as rent. The reasons are safety, companionship of other children in the complex, community amenities like indoor\/outdoor sports etc. The children can be with neighbours during long absence of parents with suitable understanding and reciprocity. This is more so because everybody knows everybody in an apartment complex and live closely as one family. Eviction of tenants is an easier proposition in the case of apartment because supply of alternate rental space is much higher in the case of apartments than independent houses.<\/li>\n<li>Longevity of an apartment cannot be compared to an independent house because in the latter case, since the land belongs to an individual or joint owners, the building can be refurbished or demolished and rebuilt. In the case of an apartment complex, all the owners have to agree before any such decision can be taken.<\/li>\n<\/ul>\n<h2><b>Conclusion<\/b><\/h2>\n<p>For a modern nuclear family on a budget, apartment is the only option in a metro city. This financial logic has resulted in tier II cities also opting for apartments. The builders have sensed the demand and are catering to it. There are more apartments being built rather than villas. Now you have the concept of premium apartments and duplexes to cater to a niche segment of buyers. It has become a status symbol to say you live in such and such apartment complex. The builders are also providing all sort of amenities to attract such buyers.<\/p>\n<p>Banks and housing finance companies have no problems in financing whether it is an independent house or an apartment. There is no such thing that one is better than the other. The choice is entirely left to the individual and it depends to a large extent on individual preferences and one&#8217;s financial means which gives one the freedom of choice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our cities have started to grow vertically on account of residential apartment complexes, shopping malls and multi-storeyed office space, technology parks etc., being built at a frenetic pace. A City like Mumbai, of course, was forced to grow vertically due to several factors, much before other metros in India had embraced this model of growth.&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[7],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Apartment Vs. Independent House - Make the Right Choice - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Apartment Vs. Independent House - Make the Right Choice - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"Our cities have started to grow vertically on account of residential apartment complexes, shopping malls and multi-storeyed office space, technology parks etc., being built at a frenetic pace. A City like Mumbai, of course, was forced to grow vertically due to several factors, much before other metros in India had embraced this model of growth.&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-10-03T09:01:02+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-10-03T09:06:29+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\",\"url\":\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\",\"name\":\"Apartment Vs. Independent House - Make the Right Choice - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-10-03T09:01:02+00:00\",\"dateModified\":\"2014-10-03T09:06:29+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Apartment Vs. Independent House &#8211; Make the Right Choice\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Apartment Vs. Independent House - Make the Right Choice - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/","og_locale":"en_US","og_type":"article","og_title":"Apartment Vs. Independent House - Make the Right Choice - EMI Calculator","og_description":"Our cities have started to grow vertically on account of residential apartment complexes, shopping malls and multi-storeyed office space, technology parks etc., being built at a frenetic pace. A City like Mumbai, of course, was forced to grow vertically due to several factors, much before other metros in India had embraced this model of growth.&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/","og_site_name":"EMI Calculator","article_published_time":"2014-10-03T09:01:02+00:00","article_modified_time":"2014-10-03T09:06:29+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/","url":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/","name":"Apartment Vs. Independent House - Make the Right Choice - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-10-03T09:01:02+00:00","dateModified":"2014-10-03T09:06:29+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/apartment-vs-independent-house-make-the-right-choice\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Apartment Vs. Independent House &#8211; Make the Right Choice"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-J7","jetpack-related-posts":[{"id":2735,"url":"https:\/\/emicalculator.net\/guaranteed-land-titles-in-india\/","url_meta":{"origin":2797,"position":0},"title":"Guaranteed Land Titles in India","date":"July 16, 2014","format":false,"excerpt":"A title is the foundation of property ownership. It is the owner's right to possess, use and transfer property rights. Transferring ownership of an immovable property is different from transferring, say, ownership of a car. Real estate is permanent and can have many owners over the years, as well as…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Glossary","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/Guaranteed-Land-Titles-Glossary.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2864,"url":"https:\/\/emicalculator.net\/first-time-apartment-buyers-part-two\/","url_meta":{"origin":2797,"position":1},"title":"A Primer for First Time Apartment Buyers &#8211; Part Two","date":"January 2, 2015","format":false,"excerpt":"Having selected the property to buy, and after checking out the budgeting, it is time to start the process of buying the apartment in right earnest. Choosing a lender and home loan You need to book the apartment selected by paying the booking amount demanded by the seller. Booking amount…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Apartment","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/apartment.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":5206,"url":"https:\/\/emicalculator.net\/hoarding-credit-card-reward-points-may-not-be-a-good-idea\/","url_meta":{"origin":2797,"position":2},"title":"Hoarding Credit Card Reward Points May Not Be a Good Idea","date":"January 5, 2020","format":false,"excerpt":"Who does not like to get things for free? Credit card reward points is a case in point. Many of us accumulate huge reward point balances either due to inertia or wait to use those points in the best possible manner. If you belong to the this category of card…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2432,"url":"https:\/\/emicalculator.net\/banks-must-link-disbursal-of-housing-loans-to-construction-stages-rbi\/","url_meta":{"origin":2797,"position":3},"title":"Banks must link disbursal of housing loans to construction stages: RBI","date":"September 6, 2013","format":false,"excerpt":"Taking serious note of borrower un-friendly home loan schemes introduced by banks in association with developers\/builders, RBI has advised banks to refrain from making upfront disbursal of home loans to the builders without linking the disbursal to various construction stages of housing project. These subvention schemes, popularly known as 80:20…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3510,"url":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-act-key-points\/","url_meta":{"origin":2797,"position":4},"title":"Real Estate Regulation and Development Act &#8211; Key Points","date":"April 5, 2016","format":false,"excerpt":"Real estate developers and agents do not really rate highly on trust factor. And examples are aplenty. It is not difficult to see stalled projects while driving along the city. Just think of those buyers who have purchased apartments (not as an investment) in those projects. They have been waiting…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2750,"url":"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\/","url_meta":{"origin":2797,"position":5},"title":"Budget 2014 and Impact on Real Estate Market","date":"July 21, 2014","format":false,"excerpt":"This time around the budget has many proposals which directly and indirectly impact the real estate market positively. If we take the direct tax proposals, it has many goodies for the middle class and the salaried. Even though premium housing has emerged as a niche segment, the bulk of the…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2797"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2797"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2797\/revisions"}],"predecessor-version":[{"id":2800,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2797\/revisions\/2800"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2797"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2797"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2797"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}