{"id":2815,"date":"2014-11-20T10:09:19","date_gmt":"2014-11-20T04:39:19","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2815"},"modified":"2014-11-21T08:57:20","modified_gmt":"2014-11-21T03:27:20","slug":"india-china-tale-of-two-asian-economies","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","title":{"rendered":"India &#038; China: A Tale of Two Asian Economies"},"content":{"rendered":"<p>The Indian economy expanded by 4.7% in the year 2013-2014, registering a second consecutive year of sub 5% growth. Between 2012-’13 and 2013-’14 the main driver of the economy were the farm, financial services, and the real estate sectors. The manufacturing sector continued to languish. After lifting the GDP by an average of 1.6 percentage points between 2009-’11, the sectors contribution dropped to 0.2 percentage points in 2012-’13 and minus 0.1 percentage points in 2013-’14. Except for a <a title=\"IIP grows to 19-month high of 4.7% in May \" href=\"http:\/\/www.thehindubusinessline.com\/economy\/macro-economy\/iip-grows-to-19month-high-of-47-in-may\/article6201275.ece\" target=\"_blank\">19 month high of 4.7% in the month of May<\/a>, ( i.e. before the budget), there may not be a sustainable increase in IIP.  It entirely depends on improvement in output by the manufacturing, power, mining and capital goods sectors. The new Government spokesmen have stated in several fora their intention to rein down fiscal deficit, have a relook at subsidies and generally aim to return to the high growth trajectory sans inflation. Good  intentions alone will not bring about the change, and there has to be a macro vision and tangible actions to bring about the change inspite of political compulsions. Since it is a global village now, we need to have a look at the global economic situation in which we are operating.<\/p>\n<p>Till the 2008, financial crisis the <a title=\"The Global Economy’s Shifting Center of Gravity\" href=\"http:\/\/www.economonitor.com\/blog\/2010\/08\/the-global-economys-shifting-center-of-gravity\/\" target=\"_blank\">economic gravity<\/a> was centred in the North Americas, Japan and Europe. Thereafter, the US was faced with contracting GDP, unemployment, reduced economic activity and general deflationary economy. To boost the economic activity, Federal Reserve brought down the interest rates and pumped in more money through quantitative easing. That is, the Federal Reserve started buying the treasury bills and released more dollars in to the economy. This activity has not resulted in inflation, but on the contrary, core inflation has averaged 1.2% YOY for past 3 months, barely half the 2% target of the Federal Reserve. For past 2 years core inflation has been falling and not rising. There is no worthwhile credit demand, and banks are not lending but depositing the overnight funds with Federal reserve at 0.35% interest. The QE has not worked and it has not given stimulus to growth. As a result it has not resulted in inflation. US GDP has been posting sub 2.5% growth YOY. (<a title=\"Third-Quarter G.D.P. Rose 3.5%, Lifting Hopes for U.S. Economy\" href=\"http:\/\/www.nytimes.com\/2014\/10\/31\/business\/economy\/us-economy-q3-2014-gdp.html?_r=0\" target=\"_blank\">Third quarter GDP rose 3.5%<\/a>).<\/p>\n<p>Let us take a look at Europe. The situation is not very different, and deflation is worrying the ECB. The policy rates are currently at 0.05%. It cut the rate on overnight funds to minus 0.1% to force the banks to deploy the funds and encourage economic activity. Unemployment is at around 11.5% and GDP growth is an abysmal 1%, and there is deflation.<\/p>\n<p>Asian countries are no longer dependent on their exports to USA and Europe. This myth of US and Europe supporting the Asian economies was busted in the aftermath of 2008 financial crisis. The Asian  economies are generating sufficient demand of their own for their goods and services and they do not have to look elsewhere. They are creating a Germany in their own backyard every 3.5 years! Most of the Asian economies are facing the specter of inflation as opposed to deflation by North America, Europe and Japan. When we talk of Asian economies, China is in a class of its own. IMF released a report recently that Chinese economy in terms of purchasing power parity equals that of USA. Not only Chinese economy has grown exponentially, it has grown much faster compared to any other country on the planet. Where does this leave India, which is a major Asian economy?<\/p>\n<p>What is it that China has got that India has not? Or, rather what India should do to become an economic superpower? The main difference between the two countries is their political set up. Indian federal structure versus the Chinese totalitarian communist structure. The Chinese structure is such that any change can be swiftly implemented even though corruption is at a high and judicial system is neither transparent nor based on principles of justice and fairplay. The state wants it ,and it gets it. In India, by virtue of its federal structure, sometimes the central government and the state governments will be working at cross purposes. The bureaucracy is so entrenched, that it resembles an Anaconda trying to eat itself. Many a times, excellent ideas remain so on paper and do not get implemented due to this. Let us take the issues in a systematic way and study them one by one.<\/p>\n<h2>Capital Formation<\/h2>\n<p>Capital flows to where the economic growth is. Now that growth has tapered off in the west, entrepreneurs and multi-national corporations in the west are looking at investment options in high growth Asia. China is the recipient of 80% of this foreign capital flows including capital flows from India. Why is India is lagging behind, and why is Indian capital itself is moving out of the country? It may be a just trickle, but why?<\/p>\n<ul>\n<li>No consistent policies. Frequent changes in the rules of the game.<\/li>\n<li>Getting permissions\/ authorizations is time consuming and results in time and cost overrun.<\/li>\n<li>Infrastructural bottlenecks which are not addressed time after time.<\/li>\n<li>Labyrinthic and archaic laws in the matter of taxes, labor, and land acquisition.<\/li>\n<li>Insurmountable corruption at every stage.<\/li>\n<li>High cost of inputs like power and gas.<\/li>\n<li>Lack of efficient trained manpower, as most of the personnel are educated but unemployable. Work ethics are nowhere near the Chinese.<\/li>\n<\/ul>\n<p>In China, you pay a bribe and the work gets done. In India, you pay a bribe, but your work may not be got done!<\/p>\n<h2>Current Account Management<\/h2>\n<p>We import more than we export and we have a trade imbalance. We manage our current account deficit through several other means apart from trying to discourage non-essential imports and encouraging exports. We found that we import large quantities of gold and it is depleting our Forex reserves. So the Government put in a quantitative restriction by increasing customs duty on gold. Inflow is now happening through smuggling and Government has lost its legitimate revenue, and now government is spending a lot of money in strengthening its coast guard. Consumption of gold has not tapered off. To encourage exports, Government has decided to provide interest subsidy as a matter of subvention to exporters. This is adding to the subsidy bill and increasing the fiscal deficit and adding to inflation.<\/p>\n<p>We have been managing our CAD mainly through FII investments in capital and debt market. Once the Federal Reserve starts increasing interest rates and stops buying treasury bills, this inflow will taper off. Current account management is important from the point of currency exchange rate management. A large current account deficit coupled with high level of inflation will reduce the PPP of the Rupee and depreciate it. A depreciating currency will make the economy that much vulnerable, especially when large percentage of our energy requirement is import dependent. Any rating downgrade will result in further depreciation of the Rupee. Rupee will remain at 62-63 levels at least for the next 2 years. China follows a fixed rate parity policy for it’s Renminbi. It is not on free float. We on the other hand have a managed float.<\/p>\n<h2>Inflationary Contributors: Political<\/h2>\n<p>State Governments are vying with each other to provide freebies to farmers in power and fertilizer and balancing it with higher state levies adding to inflation. The NREGA scheme has already done a damage by increasing rural wages across the board which has contributed to inflation. Vote bank politics has resulted in many States organizing  waiver of loans given by banks, resulting in higher taxes and farmers taking it for granted that they have a right to take loans, but no obligation to repay. More loans are becoming NPA. The corruption in banks is leading to unethical practices and large number of wilful defaulters and witch hunt by investigating agencies. A time has already come when bank managements will dilly dally in sanctioning even viable proposals. This will impact growth. Earlier, corruption made them sanction non-viable proposals! Surprisingly, no politician seems to be aware that there is no free lunch. Somebody has to pay, and that somebody is the citizen of this country.<\/p>\n<h2>Inflationary Contributors: Non-Political<\/h2>\n<p>After the 2008 crisis, the country followed an easy money policy and reduced indirect taxes to increase consumption and stimulate growth. During this high growth period the inflation also grew. It was not wrong to take steps to stimulate growth, but were we in danger of a reduced demand and slackening growth as in say USA? Definitely not. We were not a export dependent economy, and the 2008 crisis had limited impact on us. This misconception and eager beaver approach is the genesis of today’s high level inflation. Monetary policy of RBI has tried to rectify the situation, but monetary policy can only do little. It is the Government which needs to tighten its profligate spending on subsidies and social programs which only helps the corrupt to line their pockets.<\/p>\n<p>It is expected that CPI will be at 8.1% in fiscal 2014-15 and 7.4% in 2015-16. Much above 5%. GDP may grow above 5% to 5.5% in fiscal 2014-15 and 6.5% in 2015-2016.<\/p>\n<h2>Conclusion<\/h2>\n<p>There can be no comparison between a democratic setup and an autocratic communist set up. India can not grow as fast and in such measure as China has done in the foreseeable future. But we can change the elephant walk into an elephant rock by making some changes in the way we function, and a cohesive policy between the central and state governments. Implementation of GST and direct tax code, review of APMC act, changes and simplification of tax and labor laws, reduction in number of approvals or single window clearance of projects, emphasis on fast implementation of infrastructure projects, stringent punishments for the venal and corrupt, transparent FDI policy, a hard re-look at subsidies etc. are some areas the new government can start with. After all Rome wasn&#8217;t built in a day! But it did not take centuries either.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Indian economy expanded by 4.7% in the year 2013-2014, registering a second consecutive year of sub 5% growth. Between 2012-’13 and 2013-’14 the main driver of the economy were the farm, financial services, and the real estate sectors. The manufacturing sector continued to languish. After lifting the GDP by an average of 1.6 percentage&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[60,82,55,84,83,85],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>India &amp; China: A Tale of Two Asian Economies - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"India &amp; China: A Tale of Two Asian Economies - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"The Indian economy expanded by 4.7% in the year 2013-2014, registering a second consecutive year of sub 5% growth. Between 2012-’13 and 2013-’14 the main driver of the economy were the farm, financial services, and the real estate sectors. The manufacturing sector continued to languish. After lifting the GDP by an average of 1.6 percentage&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-11-20T04:39:19+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-11-21T03:27:20+00:00\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\",\"url\":\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\",\"name\":\"India & China: A Tale of Two Asian Economies - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-11-20T04:39:19+00:00\",\"dateModified\":\"2014-11-21T03:27:20+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"India &#038; China: A Tale of Two Asian Economies\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"India & China: A Tale of Two Asian Economies - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","og_locale":"en_US","og_type":"article","og_title":"India & China: A Tale of Two Asian Economies - EMI Calculator","og_description":"The Indian economy expanded by 4.7% in the year 2013-2014, registering a second consecutive year of sub 5% growth. Between 2012-’13 and 2013-’14 the main driver of the economy were the farm, financial services, and the real estate sectors. The manufacturing sector continued to languish. After lifting the GDP by an average of 1.6 percentage&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","og_site_name":"EMI Calculator","article_published_time":"2014-11-20T04:39:19+00:00","article_modified_time":"2014-11-21T03:27:20+00:00","author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","url":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/","name":"India & China: A Tale of Two Asian Economies - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-11-20T04:39:19+00:00","dateModified":"2014-11-21T03:27:20+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/india-china-tale-of-two-asian-economies\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"India &#038; China: A Tale of Two Asian Economies"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Jp","jetpack-related-posts":[{"id":2170,"url":"https:\/\/emicalculator.net\/rbi-announces-rate-cut-loans-set-to-become-cheaper\/","url_meta":{"origin":2815,"position":0},"title":"RBI announces rate cut; Loans set to become cheaper","date":"January 30, 2013","format":false,"excerpt":"The new year has begun on a positive note for those planning to take on new loan and also for those borrowers who are already paying EMI against their home loan or a car loan. The RBI just announced a repo rate cut by quarter per cent (0.25 per cent)…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2726,"url":"https:\/\/emicalculator.net\/expectations-from-the-union-budget-2014-15\/","url_meta":{"origin":2815,"position":1},"title":"Expectations from the Union Budget 2014-15","date":"July 7, 2014","format":false,"excerpt":"The first budget of the Narendra Modi Government is to be unveiled on the 10th of July. There are high expectations from various sectors of the economy that are looking forward to delivery of a promise by Mr. Modi on “Aaache Din”. The economy is passing through high inflation coupled…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2758,"url":"https:\/\/emicalculator.net\/inflation-and-you\/","url_meta":{"origin":2815,"position":2},"title":"Inflation and You","date":"August 23, 2014","format":false,"excerpt":"Inflation can be defined as across the board sustained increase in prices of domestic as well as imported goods and services and fall in the purchasing power of the home currency. Inflation rate can be measured through a benchmark price index. It can be wholesale price index (WPI) or consumer price…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4631,"url":"https:\/\/emicalculator.net\/pnb-pension-loan\/","url_meta":{"origin":2815,"position":3},"title":"PNB Pension Loan","date":"January 28, 2019","format":false,"excerpt":"When you are working, it is relatively easier to raise short term funds in times of need. If nothing else, you can apply for a personal loan. On the other hand, once you have retired, your ability to take a loan from the formal finance sector goes down. However, the…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":339,"url":"https:\/\/emicalculator.net\/rbi-hikes-interest-rates-for-12th-time-in-18-months-loan-emis-to-go-up\/","url_meta":{"origin":2815,"position":4},"title":"RBI hikes interest rates for 12th time in 18 months; loan EMIs to go up","date":"September 16, 2011","format":false,"excerpt":"The Reserve Bank of India (RBI) raised its repo rate - rate at which it lends to banks - and reverse repo rate - the rate it pays to banks for deposits - by a quarter of a percentage point to 8.25% and 7.25% respectively. With today's rate hike, RBI has raised…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"RBI Interest Rate Hikes","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/2011\/09\/rbi-interest-rate-hikes.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":464,"url":"https:\/\/emicalculator.net\/rbis-13th-rate-hike-in-20-months-will-it-pause-continue-or-end-reverse\/","url_meta":{"origin":2815,"position":5},"title":"RBI&#8217;s 13th rate hike in 20 months &#8211; will it pause &#038; continue OR end &#038; reverse?","date":"October 30, 2011","format":false,"excerpt":"This Diwali, Reserve Bank of India increased the Repo rate (rate at which RBI lends credit to banks) to 8.5% and Reverse Repo rate (rate at which RBI borrows from banks) to 7.5%, both increased by 25 basis points; and thus in last one and a half year it has…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2815"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2815"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2815\/revisions"}],"predecessor-version":[{"id":2818,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2815\/revisions\/2818"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2815"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2815"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2815"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}