{"id":2819,"date":"2014-11-22T10:16:15","date_gmt":"2014-11-22T04:46:15","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2819"},"modified":"2014-11-22T10:41:26","modified_gmt":"2014-11-22T05:11:26","slug":"how-to-pay-for-expenses-when-travelling-abroad","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/","title":{"rendered":"How To Pay For Expenses When Travelling Abroad?"},"content":{"rendered":"<p>When an Indian national is going abroad for whatever purpose &#8211; job-related, business or simply to explore the world &#8211; he\/she has a number of choices as to how it is proposed to carry foreign exchange for expenses abroad. It can be in the form of foreign currency notes, foreign currency travellers cheques, foreign demand draft, travel card, or international debit\/credit card. Each mode of carrying the foreign exchange has its own advantages and disadvantages. All the modes are prepaid instruments except debit and credit cards. That is, you need to buy foreign exchange from an authorized person by paying for it in Indian Rupees before you leave the country in the case of other than debit\/credit card.<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-2825 size-full\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/foreign-travel-e1416632036471.jpg\" alt=\"Foreign Travel\" width=\"580\" height=\"435\" \/><\/p>\n<h2><b>Foreign Currency Notes and Coins<\/b><\/h2>\n<p>In the case of foreign currency notes there are <a title=\"Forex Facilities for Residents (Individuals)\" href=\"http:\/\/www.rbi.org.in\/scripts\/FAQView.aspx?Id=53\" target=\"_blank\">restrictions by RBI<\/a> as to how much foreign currency notes you can carry out of your overall exchange entitlement. The maximum foreign currency notes that you can buy is restricted to US $3,000 or its equivalent in other currencies per trip \/ per person. The only exception is a) Iraq and Libya where foreign currency notes can be bought up to US $5,000 or it’s equivalent in other currencies and b) Islamic Republic of Iran, Russian Federation and commonwealth of independent states, where entire entitlement can be bought in foreign currency notes. The risk in carrying currency notes is the obvious one of loss due to pilferage and no way of getting a replacement or indemnity. You will be stranded abroad for sure!<\/p>\n<p>Authorized persons do not buy or sell foreign coins.<\/p>\n<h2><b>Foreign Currency Travellers Cheques<\/b><\/h2>\n<p>The other popular mode is foreign currency travellers cheques (FCTC). There are no restrictions on how much FCTC you can buy unlike foreign currency notes. You can buy your entire requirement \/ entitlement in FCTC. No Indian Bank issues its own FCTC. They act as selling agents of American express, Citibank, Barclays, Thomas Cook etc.. These may carry the emblem of VISA or Mastercard. This gives it universal acceptability at foreign bank counters \/ money changers and merchant establishments abroad. Can you use FCTC for paying your taxi fare, or your tab at small wayside shops and eateries? Doubtful! You can buy these FCTC in minimum denomination of US $10 and a maximum denomination of US $500. You can buy them denominated in most of the world currencies, if you require exchange other than in US$. They are not bearer instruments like currency notes, but payable to order. Another safety feature is you need to sign it at the purchase point and again at encashment point. Encashment is done based on both signatures matching. When you buy FCTC, you are required to sign a purchase agreement, a copy of which is given to you with instructions not to keep it together with FCTC. Even if you lose the FCTC you will have a record of the serial number of missing FCTC, for informing the issuer for hot listing and claiming a refund against indemnity and after complying with the procedures of the issuer. Some travellers cheques have inbuilt safety features. For example, if any attempt is made to chemically alter the Amex FCTC, it will change color and the words “VOID” will appear on the FCTC!  FCTC have indefinite validity, provided date column is not filled. Unlike foreign currency notes, commission is charged on FCTC either separately or it is included in the bank’s selling rate.<\/p>\n<h2><b>Foreign Demand Drafts<\/b><\/h2>\n<p>It is not advisable to purchase a foreign demand draft payable to yourself for encashing abroad. Encashing a draft is difficult even if it carries your passport number etc.. It can be only bought if a payment is to be made to a third party abroad when you reach the foreign destination. A good example is an Indian student who has got admission in an educational institution abroad wanting to deposit admission fee personally or wanting to open a bank account abroad. A flat commission is charged by the bank for issuing FDD. All the terms and conditions relating to inland DD on cancellation, duplicate issuance, validity etc., are  applicable to FDD as well. A foreign DD is actually a cheque issued by the bank drawn on its current account maintained abroad, which is called as Nostro account.<\/p>\n<h2><b>Travel Card<\/b><\/h2>\n<p>Travel Card has become a popular mode of purchasing foreign exchange and preferred by many travellers. A travel card (TC) is a plastic card on which the traveller&#8217;s name is embossed and it has a validity period. You can also get a card with your photo on it. These cards will be either Visa or Mastercard affiliated and accepted universally. Unlike FCTC you can use these cards at ATM as well as merchant establishments. You are required to purchase the foreign exchange and load your TC. The Bank will charge you a commission for issuance of the card. Most of the TC issued by the Banks in India have following add on features:<\/p>\n<ul>\n<li>You get an SMS as and when you use the card. You may also be able to view the activity through internet banking.<\/li>\n<li>You can replenish your card abroad online, if you have made suitable arrangements before leaving India.<\/li>\n<li>Along with the TC, you are also issued a standby card free of cost. If the original card is lost, you can inform your bank through phone banking and hotlist it. Your standby card can then be activated. This will ensure that you are not stranded abroad.<\/li>\n<li>You get complimentary air accident insurance and comprehensive travel insurance.<\/li>\n<li>Whichever currency you have loaded in the card, you can use the same card for transactions in another currency. You do not have this flexibility with other products mentioned above.<\/li>\n<li>Some banks offer the facility of buying these cards online.<\/li>\n<li>All cash transactions are protected by the 4 digit ATM PIN, and merchant transactions by signature matching. Now chip based cards are available protected by PIN.<\/li>\n<li>If you want a regular record of transactions you can obtain an e-statement from the bank.<\/li>\n<li>There is no hassle of identification, signature matching etc. like the other products.<\/li>\n<li>No risk in case of loss, as TC can be immediately hotlisted and the replacement card made active.<\/li>\n<li>You can not use the card for transactions in India other than for surrendering the unspent exchange.<\/li>\n<\/ul>\n<h2><b>Debit cum ATM card<\/b><\/h2>\n<p>All the ATM cum debit cards issued to individuals are now international cards. That is, you can use your debit card for transactions abroad for both ATM as well as merchant transactions. This is facilitated on account of Visa and MasterCard networks. Only, ensure that you have sufficient balance in your transaction account.<\/p>\n<p>You may well ask, if my domestic debit card can be used abroad, why should I go for a travel card? The reason is simple:<\/p>\n<ul>\n<li>For purchasing TC, the exchange is bought at a particular exchange rate only once, and card is loaded. But when you use the debit card, each transaction is a separate transaction and for each transaction, the foreign exchange is sold to you at different exchange rates.Your exchange rate risk is high.<\/li>\n<li>You do not get the facilities and freebies as in a TC.<\/li>\n<li>The transaction charges are very high.<\/li>\n<li>The advantage is that you will not end up with unspent exchange and will not be required to bear the buying and selling difference. When you buy foreign exchange, the seller charges you his selling price, and when you surrender or sell the unspent exchange, the buyer buys it at his buying price. Like any businessman, the authorized person sells at a high price and buys at a low price.<\/li>\n<\/ul>\n<h2><b>Credit Cards<\/b><\/h2>\n<p>All credit cards issued in India to resident individuals are also international cards. The main advantage in using a credit card is that you can use it up to your credit limit without having ready cash. Normally actual billing will happen after 30 days and you have 15 days time to pay the bill. You can enjoy interest free credit for at least 45 days. In addition, many credit cards give reward points for amounts spent which can be cash back or purchases at specific outlets. Like a debit card, you will not end up with unspent exchange. Abroad, usage of plastic money is phenomenal. Starting with the taxi you caught at the airport, you can settle in plastic money virtually all goods and services. Visa \/ MasterCard network enables you to use the card virtually anywhere in the world. <a title=\"Debit-cum-credit Magic Card for salary account holders\" href=\"http:\/\/articles.economictimes.indiatimes.com\/2011-09-01\/news\/29953844_1_credit-cards-counterfeit-card-credit-limit\" target=\"_blank\">Some banks have developed debit cum credit cards.<\/a> You have the flexibility of using the same plastic card as a debit or a credit card!<\/p>\n<p>Like in the case of a debit card, each transaction is applied a different exchange rate based on the rate on that date. There is higher exchange rate risk and transaction charge.<\/p>\n<h2><b>Miscellaneous Information<\/b><\/h2>\n<p>The maximum foreign exchange that an Indian national is entitled to, is laid down by RBI, based on the purpose of foreign travel. No exchange will be issued for travel to Bhutan and Nepal. Exchange can be drawn maximum 60 days in advance of actual travel. Unspent exchange needs to be surrendered to an authorized person within 180 days of return to India. However, exchange up to US $2,000 or its equivalent in other foreign currencies can be retained by an Indian national indefinitely. There is no value limit for retention of foreign currency coins. Insist on an encashment certificate when you surrender unspent exchange. Any exchange bought whose value in Indian Rupees is 50,000 or more, cannot be paid for in cash. It has to be paid necessarily to the debit of the bank account of the traveller.<\/p>\n<h2><b>Conclusion<\/b><\/h2>\n<p>So, which is the best exchange product when you travel abroad? It depends on the amount of exchange you want to spend and how frequently you travel abroad and duration of your stay. However, you must avail some amount of exchange in foreign currency notes in addition to any of the products mentioned above, to take care of small value transactions. Also, avail exchange in the currency of the country you are visiting rather than blindly buying US Dollars. Personally, I use my credit card abroad as I have very little balance in my savings account. The reward points are encashed to buy goodies like imported chocolates for distribution to friends and relatives, who believe, it was specially bought for them from abroad!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When an Indian national is going abroad for whatever purpose &#8211; job-related, business or simply to explore the world &#8211; he\/she has a number of choices as to how it is proposed to carry foreign exchange for expenses abroad. It can be in the form of foreign currency notes, foreign currency travellers cheques, foreign demand&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[52,89,88,86,90,87],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Pay For Expenses When Travelling Abroad? - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Pay For Expenses When Travelling Abroad? - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"When an Indian national is going abroad for whatever purpose &#8211; job-related, business or simply to explore the world &#8211; he\/she has a number of choices as to how it is proposed to carry foreign exchange for expenses abroad. It can be in the form of foreign currency notes, foreign currency travellers cheques, foreign demand&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2014-11-22T04:46:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2014-11-22T05:11:26+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/foreign-travel-e1416632036471.jpg\" \/>\n<meta name=\"author\" content=\"N V Nayak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"N V Nayak\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\",\"url\":\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\",\"name\":\"How To Pay For Expenses When Travelling Abroad? - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2014-11-22T04:46:15+00:00\",\"dateModified\":\"2014-11-22T05:11:26+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How To Pay For Expenses When Travelling Abroad?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe\",\"name\":\"N V Nayak\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g\",\"caption\":\"N V Nayak\"},\"description\":\"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.\",\"url\":\"https:\/\/emicalculator.net\/author\/nvnayak\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Pay For Expenses When Travelling Abroad? - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/","og_locale":"en_US","og_type":"article","og_title":"How To Pay For Expenses When Travelling Abroad? - EMI Calculator","og_description":"When an Indian national is going abroad for whatever purpose &#8211; job-related, business or simply to explore the world &#8211; he\/she has a number of choices as to how it is proposed to carry foreign exchange for expenses abroad. It can be in the form of foreign currency notes, foreign currency travellers cheques, foreign demand&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/","og_site_name":"EMI Calculator","article_published_time":"2014-11-22T04:46:15+00:00","article_modified_time":"2014-11-22T05:11:26+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/foreign-travel-e1416632036471.jpg"}],"author":"N V Nayak","twitter_misc":{"Written by":"N V Nayak","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/","url":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/","name":"How To Pay For Expenses When Travelling Abroad? - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2014-11-22T04:46:15+00:00","dateModified":"2014-11-22T05:11:26+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/how-to-pay-for-expenses-when-travelling-abroad\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"How To Pay For Expenses When Travelling Abroad?"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/130e22c61390b6c2214e85a12e68ddbe","name":"N V Nayak","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d68679bd750e86eb32e42f30500ad783?s=96&d=mm&r=g","caption":"N V Nayak"},"description":"Narayan V Nayak is a Banking and Finance professional with more than 4 decades of experience in this area. He has worked in various capacities and in diverse banking areas in a leading nationalized bank since 1971. Quit the bank in 2005 and worked as financial advisor to an SME with an export turnover of ₹500 crores for about 3 years. Did voluntary work for an NGO engaged in doing pioneering work in bringing about change in civil society. Thereafter, he joined Manipal group’s initiative as a faculty for their PGDBF program in banking, finance and insurance. He has written a number of articles for the benefit of the students\/faculty and published an e-book on foreign exchange which is available for sale on Amazon.in. His hobbies include but not limited to reading, writing, travel, music and cooking.","url":"https:\/\/emicalculator.net\/author\/nvnayak\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Jt","jetpack-related-posts":[{"id":7243,"url":"https:\/\/emicalculator.net\/tcs-on-using-credit-cards-abroad-what-has-changed-and-how-does-it-affect-you\/","url_meta":{"origin":2819,"position":0},"title":"TCS on Using Credit Cards Abroad — What Has Changed and How Does It Affect You?","date":"June 5, 2023","format":false,"excerpt":"Starting July 1, 2023, using your credit card abroad will involve a cashflow hit. From July 1, there will be Tax Collection at Source (TCS) of 20% on credit card payments while travelling abroad or on foreign websites. Essentially, when you swipe your credit card for USD 100 abroad, your…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"remittance table","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/remittance-table.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3799,"url":"https:\/\/emicalculator.net\/tips-to-prevent-credit-card-fraud\/","url_meta":{"origin":2819,"position":1},"title":"Tips to Prevent Credit Card Fraud","date":"February 8, 2017","format":false,"excerpt":"Credit cards and debit cards provide a lot of convenience. You no longer have to carry currency notes to make any purchase. With so many online shopping portals around, you may not even have to leave confines of your home to make a purchase. However, credit and debit cards come…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3646,"url":"https:\/\/emicalculator.net\/10-credit-card-charges-that-you-must-know-about\/","url_meta":{"origin":2819,"position":2},"title":"10 Credit Card Charges That You Must Know About","date":"September 15, 2016","format":false,"excerpt":"Credit cards can provide you many benefits. You can get discounts and cashbacks on the popular shopping portals. You get discounts at your favourite restaurants. You get discounts while booking flights and hotels. You get rewards point which can be used for future purchases and for exciting gifts or gift…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7407,"url":"https:\/\/emicalculator.net\/do-you-really-need-credit-card-number-printed-on-your-card\/","url_meta":{"origin":2819,"position":3},"title":"Do You Really Need Credit Card Number Printed on Your Card?","date":"October 14, 2023","format":false,"excerpt":"Why do you need a credit card number? I am NOT speaking about the credit card but about the credit card number printed on the card. The merchant clearly does not need it. All the information the merchant needs is encoded in the bar strip which is read by the…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/axis-bank-fibe-numberless-credit-card.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":7477,"url":"https:\/\/emicalculator.net\/what-to-do-if-your-credit-card-is-stolen\/","url_meta":{"origin":2819,"position":4},"title":"What to Do if Your Credit Card Is Stolen?","date":"December 7, 2023","format":false,"excerpt":"Have you ever lost your credit\/debit card? If you have, how did you react? Did you panic? What is the first thing you did? However, do you really need to worry? Don’t credit cards have inbuilt security features? For instance, when you swipe your credit card, you must enter your…","rel":"","context":"In \"credit card fraud\"","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6705,"url":"https:\/\/emicalculator.net\/nris-borrowing-abroad-to-invest-in-india-appreciate-currency-risk\/","url_meta":{"origin":2819,"position":5},"title":"NRIs Borrowing Abroad to Invest in India? Appreciate Currency Risk","date":"July 20, 2022","format":false,"excerpt":"It is common for Non-resident Indians (NRIs) to borrow in their country of residence to invest in India. They borrow to pay off loans in India, purchase real estate or even invest in stocks or mutual funds. Why do it? The borrowing rates may be lower in their country of…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"AED-INR Chart","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/AED-INR-Chart.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2819"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2819"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2819\/revisions"}],"predecessor-version":[{"id":2830,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2819\/revisions\/2830"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2819"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2819"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2819"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}