{"id":2967,"date":"2015-04-20T06:58:13","date_gmt":"2015-04-20T01:28:13","guid":{"rendered":"https:\/\/emicalculator.net\/?p=2967"},"modified":"2015-04-25T07:06:32","modified_gmt":"2015-04-25T01:36:32","slug":"real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/","title":{"rendered":"Real Estate (Regulation and Development) Bill &#8211; What’s In It for Home Buyers?"},"content":{"rendered":"<p>Are you looking to buy a house\/flat? If you scout the internet, you are bound to come across projects being launched at very attractive pre-launch prices. When I started looking out for a house to buy, an advertisement by a well-known builder at rates which were kind of unbelievable caught my attention. Out of sheer curiosity, I visited the project site office only to be told that the advertised rate was an offer for a limited period that got over.<\/p>\n<p>The sales representative present there, however, assured me that he would try and get me a “good rate”, provided I booked a flat within the next couple of days. When I reasoned that two days were too short a time for me to make up my mind, I was told that there were many buyers waiting to buy the property. As a result, the developer was being forced to allot flats on a first come first served basis.<\/p>\n<p>As I was walking out of the site office, I bumped into a colleague of mine who had already booked a flat in the same project. What I got to know from him completely changed the picture projected by the developer’s representative.<\/p>\n<p>My colleague had booked a flat over 6 months ago and was assured of possession of the flat within 2 years. Considering that the project had not taken off for more than six months now, it was unlikely that he would get possession of the flat as promised by the builder.<\/p>\n<p>The worst part was there was not much in the buyer builder agreement that provided recourse to buyers in case of delay in project launch.  Hence my colleague was not left with much option, even though he had paid a sizeable sum as booking amount. The only thing he could do was to frequent the developer’s site office to ascertain the status of the project every now and then!<\/p>\n<p>Although meeting my colleague helped me make my own decision regarding investing in the project, this whole thing got me thinking.  How easy it is for people to get duped by false promises made by the builders\/developers, I wondered? Once we get duped, what are the options available to us?<\/p>\n<p>I am sure most of you would be aware of many such instances where honest and unsuspecting home buyers may have been cheated. In fact, the Indian property market has been tagged as one lacking in credibility and transparency for long. Lack of trust has made the domestic home buyers over-cautious and hesitant to buy property. <a title=\"India’s Super Rich Heavily Investing In Global Real Estate; Their Count To Double In 5yrs\" href=\"http:\/\/trak.in\/tags\/business\/2015\/03\/10\/richest-indians-real-estate-investments\/\" target=\"_blank\">Indian<\/a> and international investors too have not shown much interest in this sector primarily because of this.<\/p>\n<p>In most of the developed countries, there are real estate regulators and standard policies that ensure that dealings between buyers and property developers are completely transparent.  For example, in the US home buyers get a clear picture of what they are getting into when they buy a house because of mandatory disclosures which are required to be made by the builder\/developer.<\/p>\n<p>With a view to introduce transparency and regulate the real estate sector, the Union cabinet approved the <a title=\" Amendments to “The Real Estate (Regulation and Development) Bill, 2013 \" href=\"http:\/\/pmindia.gov.in\/en\/news_updates\/amendments-to-the-real-estate-regulation-and-development-bill-2013\/\" target=\"_blank\">amendments <\/a>in the <a title=\"THE REAL ESTATE (REGULATION AND DEVELOPMENT) BILL, 2013 WITH AMENDMENTS\" href=\"http:\/\/mhupa.gov.in\/W_new\/Real%20Estate%20Bill%20as%20introduced%20in%20the%20Rajya%20Sabha%20on%2014.8.2013.pdf\" target=\"_blank\">Real Estate (Regulation and Development) Bill, 2013<\/a>, on 7 April 2015. This bill will be tabled during the monsoon session of the Parliament.<\/p>\n<p>The bill proposes creation of a Real Estate Regulatory Authority and an Appellate Tribunal that will act as a watchdog for the housing sector.<\/p>\n<p>According to credit rating agency CRISIL, the Bill will improve buyer confidence and boost demand for residential real estate. It will incorporate mandatory disclosure clauses for builders, providing greater clarity on the project standards and time-lines for completion.<\/p>\n<p>According to a statement issued by the government, this bill aims to<\/p>\n<ul>\n<li>protect the interest of consumers,<\/li>\n<li>promote fair play in real estate transactions and<\/li>\n<li>ensure timely execution of projects<\/li>\n<\/ul>\n<p>The statement also mentions that the Bill will promote orderly growth through consequent efficient project execution, professionalism and standardization.<\/p>\n<p>Here are some of the positive aspects of the bill from a home buyer’s perspective.<\/p>\n<p><strong>Watchdog. <\/strong>It is proposed that the real estate regulator play the role of a watchdog to protect interest of home buyers in general.  Typically most of the builder buyer agreements in our country are heavily skewed in favor of builders. Buyers are, therefore, not left with many options in case of default by builders.  The introduction of the real estate regulator is expected to address this issue.<\/p>\n<p>The regulator will be entrusted with the responsibility of keeping an overall check on real estate transactions, ensure compliance and levy penalties as appropriate in case of defaults.<\/p>\n<p><strong> Registration. <\/strong>Once this bill comes into force, it will become mandatory for all new under construction projects (commercial as well as residential) above a certain size to be registered. Registration will be compulsory for all projects with a land area of 4,000 square metres or more.<\/p>\n<p>The bill stipulates that the registration must happen within 3 months of the regulator being set up. At the time of registration, developer has to disclose details in respect of ownership, project layout and plan, development schedule, land status, status of statutory approvals, pro forma agreements, names and addresses of real estate agents, contractors, architects, structural engineers etc.<\/p>\n<p>Post registration, the developer is required to disclose information pertaining to carpet areas of all flats, layout plans, development phases, proforma of agreement, list of bookings, project architect(s) or structural engineer etc on the regulator&#8217;s website.<\/p>\n<p><strong>Carpet Area.<\/strong> Of late most builders advertise projects quoting the “built up” or the “super built up area”.  Rarely are projects priced on the basis of<a title=\"Yes, The New Real Estate Bill Helps You\" href=\"http:\/\/profit.ndtv.com\/news\/opinions\/article-opinion-yes-the-new-real-estate-bill-helps-you-by-manisha-natarajan-753233\" target=\"_blank\"> carpet area<\/a> which is the actual living space a buyer gets on possession. This Bill stipulates that developers sell properties only on the basis of the &#8216;carpet area” which is the net usable floor area of a residential unit.<\/p>\n<p>Unlike super built up area, carpet area does not take into account common areas such as walls, lift shaft, stairs or lobby. This clause will thus ensure that at the time of booking itself home buyers get clear picture of the actual livable area which will be allotted to them.<\/p>\n<p><strong>Penalties.<\/strong> According to this bill, if a builder\/developer fails to register a project, he will be charged a penalty of 10% of the overall cost of the project. In case of continued non-compliance, the developer will have to pay an additional 10% and\/or serve a 3 year jail term.<\/p>\n<p>Developers have to pay penalty for delayed projects as well. With a view to protect interests of home buyers and investors, penalty is proposed to be levied in respect of projects that have not received completion certificates.<\/p>\n<p>Projects will be considered incomplete and fall within purview of this provision in all cases where builders fail to complete a project or receive completion certificate within 5 to 6 years. Persistent violations can also result in the regulatory authority cancelling the registration altogether.<\/p>\n<p>In case of incorrect or incomplete disclosures made by the developer\/ builder, the bill has proposed to levy a penalty of 5% of the project cost.<\/p>\n<p><strong>Changes to original plan\/designs.<\/strong> Once registered, unless two thirds of buyers consent, the bill stipulates that no changes can be made to the original plans or structural designs of a project. This provision aims to restrict developers from altering plans, structural designs and specifications of the plot, apartment or building post registration.<\/p>\n<p>The bill also specifically mentions rights of homebuyers in this regard. Homebuyers will have the right to obtain a stage-wise schedule of a project; and claim possession as per developer declaration. In case of default by the builder, home buyers will have the right to receive refund of the amount they have invested, with interest, and compensation.<\/p>\n<p><strong>Redressal.<\/strong> Home buyers have been given the freedom to choose and approach any consumer forum for raising an appeal. If buyers for any reason are dissatisfied with the Real Estate Regulatory Authority’s decision, they can approach the Appellate Tribunal also.<\/p>\n<p>To ensure timely settlement of disputes raised by home buyers, the bill has recommended appointment of one or more adjudicating officers. The officers will be responsible for fast tracking the dispute settlement and imposing compensation\/interest, as appropriate.<\/p>\n<p><strong>End use of fund.<\/strong> To ensure correct end use of funds collected from home buyers, it is proposed that builders\/developers<a title=\"Road to regulation: Real Estate Bill takes final shape\" href=\"http:\/\/indianexpress.com\/article\/business\/business-others\/real-estate-bill-takes-final-shape\/\" target=\"_blank\"> deposit 50%<\/a> of the amount collected in a separate escrow account. Builders\/developers are required to open the escrow account with a scheduled bank and deposit the amount within 15 days of receipt. This provision aims to ensure that developers do not divert funds meant for a particular project to other projects.<\/p>\n<p><strong>False promises. <\/strong>At the time of pre-launch or soft launch of residential projects, developers normally offer discounts (5-15%) to a select group of buyers. Many buyers get lured by the discount and invest their monies, although the project may not have been approved at all.<\/p>\n<p>To protect buyers&#8217; interests, developers will be allowed to launch projects only after securing statutory clearances from the relevant authorities.<\/p>\n<p>Additionally, a penalty is to be levied in case of <a title=\"Cabinet Approves Real Estate Bill 2013, Brings Protection Against Fake Promises &amp; Frauds\" href=\"http:\/\/trak.in\/tags\/business\/2015\/04\/08\/real-estate-bill-2013-amendments-passed\/\" target=\"_blank\">false promises or misleading advertisements<\/a> made by developers. If misled, buyers will be eligible to claim a full refund of the money deposited, along with interest in case they wish to withdraw from the project.<\/p>\n<h2>The flip side<\/h2>\n<p>As with everything else, the proof of the pudding is in the eating. How well this regulation will be enforced is anybody’s guess. Meanwhile, buyers still need to take their own precautions.<\/p>\n<p>Also, this bill is applicable only for new projects. Home buyers who may have invested in projects launched before the introduction of the bill cannot benefit from it.<\/p>\n<p>Most experts believe that a major aspects which this bill does not cover is the background \/due diligence check of builder\/ developer.  Similarly there is no provision for blacklisting developers who default repeatedly.<\/p>\n<p>Since developers need to deposit only 50% receipts from home buyers in a designated escrow account, this provision does leave scope for developers\/builders to misuse the remaining 50%.<\/p>\n<p>There is no standard process governing the preparation, maintenance and updation of land records in India. Computerization, it is believed, can bring about some kind of order in this respect.  This bill is almost silent on the subject of digitization of land record system.<\/p>\n<h2>Conclusion<\/h2>\n<p>There was an urgent need to regulate the Real Estate sector in India. The government by introducing this bill has taken the first step to usher in the right kind of environment to govern the sector. If implemented in totality and across all states, it is bound to bring in the much needed transparency in real estate transactions. Most importantly it will protect home buyer’s interests and improve the credibility of the sector as a whole.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you looking to buy a house\/flat? If you scout the internet, you are bound to come across projects being launched at very attractive pre-launch prices. When I started looking out for a house to buy, an advertisement by a well-known builder at rates which were kind of unbelievable caught my attention. Out of sheer&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[11],"tags":[97,105,64],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"Are you looking to buy a house\/flat? If you scout the internet, you are bound to come across projects being launched at very attractive pre-launch prices. When I started looking out for a house to buy, an advertisement by a well-known builder at rates which were kind of unbelievable caught my attention. Out of sheer&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2015-04-20T01:28:13+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-04-25T01:36:32+00:00\" \/>\n<meta name=\"author\" content=\"Malathi Iyengar\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Malathi Iyengar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\",\"url\":\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\",\"name\":\"Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2015-04-20T01:28:13+00:00\",\"dateModified\":\"2015-04-25T01:36:32+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Real Estate (Regulation and Development) Bill &#8211; What’s In It for Home Buyers?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4\",\"name\":\"Malathi Iyengar\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g\",\"caption\":\"Malathi Iyengar\"},\"description\":\"Ms Malathi R Iyengar is a freelance writer specializing in subjects of banking and personal finance. She is banking professional with 17 years of experience in personal finance and consumer banking sector. In addition to her professional experience, Ms Iyengar is a yoga enthusiast and a mother of a young girl at home.\",\"url\":\"https:\/\/emicalculator.net\/author\/malathi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/","og_locale":"en_US","og_type":"article","og_title":"Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator","og_description":"Are you looking to buy a house\/flat? If you scout the internet, you are bound to come across projects being launched at very attractive pre-launch prices. When I started looking out for a house to buy, an advertisement by a well-known builder at rates which were kind of unbelievable caught my attention. Out of sheer&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/","og_site_name":"EMI Calculator","article_published_time":"2015-04-20T01:28:13+00:00","article_modified_time":"2015-04-25T01:36:32+00:00","author":"Malathi Iyengar","twitter_misc":{"Written by":"Malathi Iyengar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/","url":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/","name":"Real Estate (Regulation and Development) Bill - What’s In It for Home Buyers? - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2015-04-20T01:28:13+00:00","dateModified":"2015-04-25T01:36:32+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-bill-whats-in-it-for-home-buyers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Real Estate (Regulation and Development) Bill &#8211; What’s In It for Home Buyers?"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4","name":"Malathi Iyengar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g","caption":"Malathi Iyengar"},"description":"Ms Malathi R Iyengar is a freelance writer specializing in subjects of banking and personal finance. She is banking professional with 17 years of experience in personal finance and consumer banking sector. In addition to her professional experience, Ms Iyengar is a yoga enthusiast and a mother of a young girl at home.","url":"https:\/\/emicalculator.net\/author\/malathi\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-LR","jetpack-related-posts":[{"id":5712,"url":"https:\/\/emicalculator.net\/good-news-tax-relief-for-home-buyers-and-real-estate-developers\/","url_meta":{"origin":2967,"position":0},"title":"Good News! Tax Relief for Home Buyers and Real Estate Developers","date":"November 16, 2020","format":false,"excerpt":"The Government of India recently announced certain tax-relief measures for the home buyers and the real estate developers. With such a move, the Government hopes to give a push to the real estate demand in the country. Stamp Duty, Circle Rate, and the Income Tax Problem The real estate industry…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3510,"url":"https:\/\/emicalculator.net\/real-estate-regulation-and-development-act-key-points\/","url_meta":{"origin":2967,"position":1},"title":"Real Estate Regulation and Development Act &#8211; Key Points","date":"April 5, 2016","format":false,"excerpt":"Real estate developers and agents do not really rate highly on trust factor. And examples are aplenty. It is not difficult to see stalled projects while driving along the city. Just think of those buyers who have purchased apartments (not as an investment) in those projects. They have been waiting…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3071,"url":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","url_meta":{"origin":2967,"position":2},"title":"Should You Invest in Indian Real Estate in 2015?","date":"July 4, 2015","format":false,"excerpt":"The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so,…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3019,"url":"https:\/\/emicalculator.net\/buy-or-rent-financial-factors-that-you-must-not-ignore-while-making-your-decision\/","url_meta":{"origin":2967,"position":3},"title":"To Buy or Rent &#8211; 5 Financial Factors That You Must Not Ignore While Making Your Decision","date":"April 25, 2015","format":false,"excerpt":"When I relocated to Pune in 2003 due to professional commitments, I decided to rent a flat close to my work place. The idea of buying a flat instead of renting never occurred to me until my boss broached the topic. We did some simple calculations taking into consideration my…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2858,"url":"https:\/\/emicalculator.net\/first-time-apartment-buyers-part-one\/","url_meta":{"origin":2967,"position":4},"title":"A Primer for First Time Apartment Buyers &#8211; Part One","date":"January 2, 2015","format":false,"excerpt":"Buying a property is not like buying onions and potatoes. Firstly, the financial outgo is huge and may be a lifetime investment for many. Secondly, all properties are  not the same. All apartments in a complex with same dimensions are also not the same! Your selection of a particular apartment…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/apartment-hunting-e1420184146584.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4056,"url":"https:\/\/emicalculator.net\/home-loan-3-99-p\/","url_meta":{"origin":2967,"position":5},"title":"A Home Loan at 3.99% p.a.?","date":"November 28, 2017","format":false,"excerpt":"I recently came across a news item that Tata Housing, a prominent realty company, has tied up with Indiabulls Home Finance to offer home loans at 3.99% p.a. The loan will offered by Indiabulls Housing Finance and the special interest rate of 3.99% p.a. applies for purchases in select projects…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2967"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=2967"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2967\/revisions"}],"predecessor-version":[{"id":3025,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/2967\/revisions\/3025"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=2967"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=2967"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=2967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}