{"id":3071,"date":"2015-07-04T19:01:36","date_gmt":"2015-07-04T13:31:36","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3071"},"modified":"2015-07-04T19:19:37","modified_gmt":"2015-07-04T13:49:37","slug":"should-you-invest-in-indian-real-estate-in-2015","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","title":{"rendered":"Should You Invest in Indian Real Estate in 2015?"},"content":{"rendered":"<p>The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so, as my investment had multiplied almost 4 times!<\/p>\n<p>In fact, I was planning to buy a second home with view to make good profits in the current year. Just when I started scouting for my second home, I came across a report by the<a href=\"https:\/\/rbi.org.in\/scripts\/PublicationsView.aspx?Id=16223\" target=\"_blank\"> Reserve Bank of India on Recent Trends<\/a> in Residential Property Prices in India. Reading this report was an eye opener of sorts for me &#8212; it changed my views on investing in real estate at this point of time.<\/p>\n<p>To begin with, I realized that appreciation in absolute value terms is never the correct indicator of return on an investment. In simple mathematical terms, my above mentioned investment had generated a compounded annual growth rate of around 15% over a period of 10 years. Once we factor in related cost of owning a property like maintenance, property taxes, transaction cost involved in buying the property, interest paid on the loan availed to buy the house, insurance etc, this percentage would reduce significantly to about 8-9%.<\/p>\n<p>Had I invested the same amount during the same period in other assets like bank deposits, gold or equity, I would have earned as much if not more returns.<\/p>\n<p>Secondly during the period 2002-2005, the real estate sector in India witnessed a boom, because of which prices rose significantly at that time. People who invested therefore made handsome gains. Presently the picture is not as rosy as it was a decade ago and hence investments may not yield substantial returns.<\/p>\n<p>Here are some of the key findings of the referred RBI report, which anyone intending to buy property in the near future should be aware of.<\/p>\n<h2>RBI Report<\/h2>\n<p>The Reserve Bank had initiated an information system on residential property prices through a survey. This survey covered transaction level data on housing loans disbursed across select 13 cities, by select 35 scheduled commercial banks\/housing finance companies (HFCs).<\/p>\n<p><b>Data used<\/b><\/p>\n<p>The property price data used for the analysis was the valuation price of the property as appraised by banks\/HFCs. Based on the data compiled on a quarterly basis, a Residential Property Price Index (RPPI) has been arrived at for each city and at All-India level.<\/p>\n<p><b>Key highlights<\/b><\/p>\n<p>Some of the key findings of the survey which covered housing loan transactions carried out during Quarter1: 2009-10 to Quarter 3: 2014-15 are:<\/p>\n<ul>\n<li>RPPI rose up to 172 in Q3:2014-15 from 107 in Q1:2010-11.<\/li>\n<li>House price inflation, as measured by annual growth in RPPI, was at its highest during 2012-13. Thereafter, there’s a gradual decline of the rising trend. In the 3rd quarter of 2014-15, it was below 4%.<\/li>\n<li>In the financial year FY 2013, house prices grew much faster than rents. Thereafter both rent and house prices have moved in the same direction.<\/li>\n<li>Between the 1st quarter of 2011 and 3rd quarter of 2015, equity had better returns than both housing as well as gold.<\/li>\n<\/ul>\n<figure id=\"attachment_3077\" aria-describedby=\"caption-attachment-3077\" style=\"width: 624px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-3077\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg\" alt=\"Real Estate vs Gold vs Equity\" width=\"624\" height=\"276\" srcset=\"https:\/\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg 624w, https:\/\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity-300x133.jpg 300w\" sizes=\"(max-width: 624px) 100vw, 624px\" \/><figcaption id=\"caption-attachment-3077\" class=\"wp-caption-text\">Real Estate vs Gold vs Equity<\/figcaption><\/figure>\n<h2>The affordability factor<\/h2>\n<p>Although the RBI study does not paint a very rosy picture of the real estate sector in the near future, some of the <a href=\"http:\/\/articles.economictimes.indiatimes.com\/2015-05-17\/news\/62277054_1_hdfc-ltd-affordability-property-prices\" target=\"_blank\">conclusions drawn by India’s major mortgage lender HDFC Ltd<\/a> on the home loan market in India is very interesting.<\/p>\n<p>According to data compiled by the HDFC, buying a house is much more affordable now as compared to what it was a decade ago. This is because increase in income levels has been much greater than the rate of increase in home prices.<\/p>\n<p>The study indicates that while average property value of housing units has appreciated to an all-time high of around Rs 52 lakh, currently the annual income of the homebuyer has grown to approximately Rs 12 lakh. Increase in income levels combined with factors like tax incentives and attractive interest rates have contributed to an increased demand for housing loans. Individual home buyers, because of increased level of disposable income can afford to buy homes at the prevailing rates.<\/p>\n<h2>Past, Present and Future<\/h2>\n<p>The RBI findings pertain to the period 2011-2014. Prior to this, backed by rapid economic growth, the real estate sector witnessed a boom during the period 2002 to 2007. Thereafter, in 2008 the world economic crisis led to a temporary fall in both demand and prices for homes. The impact of the global crisis was short lived in India and the sector rebounded pretty quickly.<\/p>\n<p>As indicated by the RBI study, the Residential Property Price Index moved up from 107 in Q1:2010-11 to 172 in Q3:2014-15.<\/p>\n<p>Going forward, purely on the basis of estimates alone the outlook for this sector appears to be positive in the coming years. According to an estimate made by the Planning Commission, about 600 million people will live in cities by the year 2030 in India. Particularly in the low income group, there exists a significant gap between the demand and supply position. Overall the real estate construction market, it is estimated will grow by 20 per cent between now and 2017.<\/p>\n<p>However it is important to bear in mind the facts that these are mere estimates based on certain presumptions. Considering that there is no means of verifying the accuracy of these estimates, should you invest in the real estate sector at this point of time?<\/p>\n<p>The answer to this question will depend on your reason for investing in real estate. More specifically are you looking to buy property as an investment or for self-use?<\/p>\n<h2>Investment option<\/h2>\n<p>Going by the statistics provided in the RBI report, it is unlikely that the returns from this sector will be substantial in the coming years. In fact unless you are prepared to invest and hold on for a period of 8-10 years, you cannot expect reasonable returns. So it may be worthwhile to invest in other asset classes like equity, mutual funds, bank deposits etc. REIT is another option which retail investors looking to invest in the real estate sector can consider.<\/p>\n<p><a href=\"https:\/\/emicalculator.net\/budget-2014-and-impact-on-real-estate-market\" target=\"_blank\">REIT <\/a>which is to be launched in India soon is a trust that buys, sells, develops and manages income-generating real estate property such as malls, commercial office spaces etc. Like mutual funds, REITs pool in money from investors and issue units in exchange.<\/p>\n<p>With entry levels being low, REITs are expected to provide an excellent investment option to small time investors looking to own interest in securitized real estate market. Experts consider it be a safe and diversified option that is managed by professionals. The greatest advantage it offers to retail investors is of fast and easy liquidation of investments in the real estate market.<\/p>\n<p>An investor can earn two types of income from REITs. One is by way of capital gains at the time of sale of REIT units on exchanges and the other is through dividend income.<\/p>\n<p>REITs are considered to be better than investing in stocks and shares because of reduced risks, good returns and investments being made in diversified portfolios.<\/p>\n<h2>Buying ready to move in property for self use<\/h2>\n<p>For people looking to buy property for self-use, a number of factors like financial position, place of work, children’s education, spouse’s job will have to be taken into consideration before arriving at a decision.<\/p>\n<p>You can choose to buy in an established locality or an upcoming one. There are pros and cons of both these options. In an established area although the prices may be  steeper, you have advantages like better chances of appreciation, proximity to essential services and being well connected to other parts of the city.<\/p>\n<p>Purely from a cost angle, it may be cheaper to buy in “upcoming” areas. However the risk here is an “upcoming” area may not develop as quickly or as well as predicted by real estate experts. Hence it is important to verify the claims made by developers before investing in such areas. Do a little bit of research by talking to people already residing in the locality to understand things clearly.<\/p>\n<p>Take into consideration fact like distance from your residence to your\/your spouse’s workplace and your children’s schools before making your final decision. Remember location is the single most important factor based on which the value of two identical homes can increase or decrease as compared to one another. Check out if the property has easy access to well-connected public transport facilities. In cities like Delhi and Mumbai, proximity to Metro train stations is a crucial deciding factor for people looking to buy properties. Existence of health facilities, hospitals and shopping malls in close vicinity is another essential factor which home buyers must not ignore. Similarly availability of uninterrupted supply of power\/water and adequate sewerage facility are some of the things investors must check out before making a decision.<\/p>\n<p>In short, before to buy a ready to move in property you must do a personal evaluation of where to buy after giving due consideration to your financial position and whether it meets certain essential requirements\/specific needs that you may have.<\/p>\n<h2>Buying under construction property for self use<\/h2>\n<p>In the recent past many builders and real estate projects have been in the news for wrong reasons. To ensure that you do not end up buying in projects which may never see the light of the day it is important to do basic due diligence and background check of builders.<\/p>\n<p>To begin with buyers should ascertain the past track record of the builder. How many projects has the builder promoted? Were the projects completed within promised timelines? Has the builder been associated with projects which have violated any government or regulatory norms? What is the financial standing of the builder? In projects which have been completed and delivered by the builder are the residents happy about the quality of construction? Home buyers must try to find out answers to these questions by seeking help from various sources like brokers, real estate online portals and residents in projects already completed by the builder.<\/p>\n<h2>Conclusion<\/h2>\n<p>To buy or not? The answer to this question is never easy specifically in the Indian context. In India, the returns from the real estate sector has diminished in the recent past. However in absolute terms property prices have either risen or remained stagnant.<\/p>\n<p>For an average person belonging to the working class in metropolitan cities of India, living on rent may be an expensive proposition. Hence rather than spending heavily on rent and losing out on income tax benefits of availing a home loan it may be a sensible to buy a house for self-use.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so, as my investment had multiplied&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[115,110,105,38,64,57],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Should You Invest in Indian Real Estate in 2015? - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Should You Invest in Indian Real Estate in 2015? - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so, as my investment had multiplied&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2015-07-04T13:31:36+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-04T13:49:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg\" \/>\n<meta name=\"author\" content=\"Malathi Iyengar\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Malathi Iyengar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\",\"url\":\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\",\"name\":\"Should You Invest in Indian Real Estate in 2015? - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2015-07-04T13:31:36+00:00\",\"dateModified\":\"2015-07-04T13:49:37+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Should You Invest in Indian Real Estate in 2015?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4\",\"name\":\"Malathi Iyengar\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g\",\"caption\":\"Malathi Iyengar\"},\"description\":\"Ms Malathi R Iyengar is a freelance writer specializing in subjects of banking and personal finance. She is banking professional with 17 years of experience in personal finance and consumer banking sector. In addition to her professional experience, Ms Iyengar is a yoga enthusiast and a mother of a young girl at home.\",\"url\":\"https:\/\/emicalculator.net\/author\/malathi\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Should You Invest in Indian Real Estate in 2015? - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","og_locale":"en_US","og_type":"article","og_title":"Should You Invest in Indian Real Estate in 2015? - EMI Calculator","og_description":"The current market value of my flat in Pune is close to Rs 65 lacs. I purchased it for 17 lacs in the year 2005. Until recently, I used to feel really proud about my investment decision. It was something that I boasted about to all and sundry. Rightfully so, as my investment had multiplied&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","og_site_name":"EMI Calculator","article_published_time":"2015-07-04T13:31:36+00:00","article_modified_time":"2015-07-04T13:49:37+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/rppi-gold-equity.jpg"}],"author":"Malathi Iyengar","twitter_misc":{"Written by":"Malathi Iyengar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","url":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/","name":"Should You Invest in Indian Real Estate in 2015? - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2015-07-04T13:31:36+00:00","dateModified":"2015-07-04T13:49:37+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/should-you-invest-in-indian-real-estate-in-2015\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Should You Invest in Indian Real Estate in 2015?"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/342ea486e1ad8b5d25b59da19c4adde4","name":"Malathi Iyengar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b8203beae63ee168af07809681651b7f?s=96&d=mm&r=g","caption":"Malathi Iyengar"},"description":"Ms Malathi R Iyengar is a freelance writer specializing in subjects of banking and personal finance. She is banking professional with 17 years of experience in personal finance and consumer banking sector. In addition to her professional experience, Ms Iyengar is a yoga enthusiast and a mother of a young girl at home.","url":"https:\/\/emicalculator.net\/author\/malathi\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Nx","jetpack-related-posts":[{"id":6705,"url":"https:\/\/emicalculator.net\/nris-borrowing-abroad-to-invest-in-india-appreciate-currency-risk\/","url_meta":{"origin":3071,"position":0},"title":"NRIs Borrowing Abroad to Invest in India? Appreciate Currency Risk","date":"July 20, 2022","format":false,"excerpt":"It is common for Non-resident Indians (NRIs) to borrow in their country of residence to invest in India. They borrow to pay off loans in India, purchase real estate or even invest in stocks or mutual funds. Why do it? The borrowing rates may be lower in their country of…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"AED-INR Chart","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/AED-INR-Chart.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":5712,"url":"https:\/\/emicalculator.net\/good-news-tax-relief-for-home-buyers-and-real-estate-developers\/","url_meta":{"origin":3071,"position":1},"title":"Good News! Tax Relief for Home Buyers and Real Estate Developers","date":"November 16, 2020","format":false,"excerpt":"The Government of India recently announced certain tax-relief measures for the home buyers and the real estate developers. With such a move, the Government hopes to give a push to the real estate demand in the country. Stamp Duty, Circle Rate, and the Income Tax Problem The real estate industry…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3850,"url":"https:\/\/emicalculator.net\/how-does-cap-of-rs-2-lacs-for-loss-under-income-from-house-property-affect-your-tax-liability\/","url_meta":{"origin":3071,"position":2},"title":"How Does Cap of Rs 2 Lacs for Loss under Income from House Property Affect Your Tax Liability?","date":"April 5, 2017","format":false,"excerpt":"This year’s Union Budget brought a few positives in form of lower tax slab rate for tax slab Rs 2.5 lacs-Rs 5 lacs and reduction in holding period for long term capital gains for real estate from 3 years to 2 years. But there was a major shock for real…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4841,"url":"https:\/\/emicalculator.net\/should-you-buy-a-second-house-using-home-loan\/","url_meta":{"origin":3071,"position":3},"title":"Should You Buy a Second House Using Home Loan?","date":"May 10, 2019","format":false,"excerpt":"Real estate is expensive in India, at least in major cities. It is difficult to purchase a house without a loan. And it takes many years to repay the loan. Despite all this difficulty, the desire for house does not end here. For the fortunate few who have been able…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7060,"url":"https:\/\/emicalculator.net\/a-6-point-wishlist-for-union-budget-2023\/","url_meta":{"origin":3071,"position":4},"title":"A 6-Point Wishlist for Union Budget 2023","date":"January 19, 2023","format":false,"excerpt":"The Union Budget 2023 is round the corner. Are you ready with your wish list? What do you want from this budget? Lower taxes? Higher tax deductions? Additional tax exemptions? The Budget announcements may not meet all your demands\/wishes since the Government must strike the right balance between populism, targeted…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3397,"url":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","url_meta":{"origin":3071,"position":5},"title":"How to Save Tax on Sale of a House","date":"February 21, 2016","format":false,"excerpt":"You made a killing recently on a house that you had purchased 15 years ago.  You had bought this house for Rs 7 lacs. Recently, you sold the same house for Rs 1.5 crores. Net absolute gain of Rs 1.43 crores. You are aware of the indexation benefit on sale…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3071"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3071"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3071\/revisions"}],"predecessor-version":[{"id":3078,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3071\/revisions\/3078"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}