{"id":3154,"date":"2015-08-24T14:59:15","date_gmt":"2015-08-24T09:29:15","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3154"},"modified":"2016-09-09T12:13:25","modified_gmt":"2016-09-09T06:43:25","slug":"home-loan-protection-plan-what-bank-officials-wont-tell-you","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","title":{"rendered":"Home Loan Protection Plan – What Bank Officials Won&#8217;t Tell You"},"content":{"rendered":"<p>You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you it is compulsory to purchase a home loan protection plan (home loan insurance) to avail the loan. You were not prepared for this extra expense. You were politely told that you need not worry and that you will not have to pay anything right now. The premium amount would be added to your loan amount. You decide to find out more about home loan protection plans and ask the bank official to hold for a while.<\/p>\n<h2>What Are Home Loan Protection Plans?<\/h2>\n<p>Home Loan Protection Plan (HLPP) is an insurance plan. Under this plan, insurance company settles any outstanding amount on the home loan with the bank\/lender in the event of death of the borrower. The policy term is usually the same as the loan tenure. This way, a borrower can ensure that his\/her family will not have to vacate the house due to non-repayment of home loan after demise of the borrower.<\/p>\n<p><b>Please note a Home Loan Protection Plan is different from <a href=\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\">property\/home insurance<\/a><\/b>. Under property insurance, you purchase cover against risks to property\/home due to earthquake, fire, flood, storm, theft etc.  Home\/property insurance can be mandatory at times. If such is the case, it will be clearly mentioned in the home loan agreement.<\/p>\n<p>Home Loan Protection Plan, on the other hand, is simply to guard against the risk of default on home loan in the event of death of the borrower. In the event of death of the borrower during the loan tenure, the insurance company will settle the outstanding loan with the bank. It is not mandatory to purchase home loan protection plans.<\/p>\n<p><b>The policy could lapse on full repayment of loan or after demise of the borrower or on transfer of loan to another bank. Some policies will continue till the end of the chosen policy term even if the loan has been repaid. (Ex: ICICI Pru Loan Protect). With such policies, the life cover and the policy period will vary from the loan&#8217;s outstanding principal and loan tenor. <\/b>Both general and life insurance companies provide HLPPs.<\/p>\n<p><b>Related:<\/b><a href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\"> <\/a><a href=\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\">ICICI Bank Home Safe Plus — A Review<\/a><\/p>\n<h2>Types Of Home Loan Protection Plans<\/h2>\n<p>HLPPs are available in three variants:<\/p>\n<ol>\n<li>Reducing cover option:  Under this plan, the life cover reduces similar to (but may not be same as) loan repayment schedule i.e., the life cover goes down just like your loan&#8217;s outstanding principal. At any point in time, your life cover is greater than your outstanding loan principal.<\/li>\n<li>Level Cover (aka Fixed Cover) Option: Under this plan, life cover remains constant for the term of the plan.<\/li>\n<li>Fixed Cover for a years followed by reducing cover for the remaining years<\/li>\n<\/ol>\n<p>Since the risk taken by insurance company is higher in case of level cover option, the premium for level cover option will be higher than reducing cover option. <b>Most plans provide reducing option only.<\/b> Hence, depending upon the lender you approach for loan, you may not even have the choice of level option. Particular plans may have optional riders such as job loss (3 EMIs only), accidental death, disability, critical illness etc. Such riders enhance the scope of insured events by payment of additional premium.<\/p>\n<blockquote><p>There is an additional variant of HLPP offered by banks where the home\/property loan insurance is clubbed with home loan insurance. ICICI Lombard Home Safe Plus  and HDFC ERGO home loan protection plan are such plans. Hence, such plans can offer dual benefit of home loan insurance and property insurance. You can expect premium for such plans to higher than pure HLPPs. The term for such policies is typically 5 years. I will discuss such plans in a subsequent post.<\/p><\/blockquote>\n<h3>Premium Payment<\/h3>\n<p><b>HLPPs are mostly single premium policies. However, there are variants available for regular premium and limited premium payment terms.<\/b> Under regular premium plans, premium payment term is same as policy term. Under limited premium payment plans, premium payment term is less than policy term.<\/p>\n<p>In case of single premium plans, banks provide an option to club the premium amount with the loan amount. For example, if the premium for loan amount of Rs 30 lacs comes out to Rs 1 lac, the total loan amount would become Rs 31 lacs. And you would pay EMI for Rs 31 lacs.<\/p>\n<h3>HLPPs Are Different From Regular Life Insurance Plans<\/h3>\n<p>HLPPs are not available in the open market i.e. unlike term insurance plans, you cannot choose HLPP based on fit with your requirements and pocket. These plans are bundled with the home loans taken from banks. The rationale is simple. You need to have a home loan before you purchase such a plan. Bundling of home loan and insurance reduces operational hassles.<\/p>\n<p>The mechanics of a HLPP are slightly different from regular insurance plans. In the event of demise of policy holder, the insurer settles the loan with the bank on policyholder’s behalf. Any excess funds after settling the loan are provided to the nominee of the borrower. For such plans, the insurance company and the bank enter into a master policy agreement for the group insurance plan and the same plan is further extended to bank’s borrowers.<\/p>\n<p>There are other loan protection plans that you can purchase online directly (and provide similar benefits as HLPPs) such as SBI Life Saral e-Shield. This is not a group insurance plan which is further extended to borrowers of the bank. You can simply go to SBI Life website and purchase this plan.<\/p>\n<p><b>Must Read:<\/b><a href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\"> <\/a><a href=\"https:\/\/emicalculator.net\/another-reason-not-to-opt-for-hlpp\">Another Reason Not to Opt for HLPP<\/a><\/p>\n<h2>Is The Purchase Of Home Loan Protection Plan Mandatory?<\/h2>\n<p>No, the purchase of home loan protection plan with home loan has not been made mandatory by law, RBI or IRDA. Even purchase of a term plan is not mandatory. Purchase of an insurance plan is the sole discretion of the buyer and cannot be forced to purchase such plans.<\/p>\n<p>However, banks may have a different policy in this regard to safeguard their interest. If their internal policy mandates the purchase of insurance, it must be mentioned in the loan agreement.<\/p>\n<blockquote><p>Editor&#8217;s Note: Home loan is a secured loan and the bank doesn&#8217;t really need the HLPP. It is you (and your family) who need loan protection. This is a paradoxical situation where the lender is forcibly doing a favour to their customer, but without the altruistic motives. Banks need that <a href=\"http:\/\/www.business-standard.com\/article\/pf\/you-can-say-no-to-term-plan-bundled-with-home-loan-114040700036_1.html\" target=\"_blank\">fat commission from the sale of the insurance<\/a>. To know how you can handle this situation, read on.<\/p><\/blockquote>\n<h2>Benefits Of Home Loan Protection Plans<\/h2>\n<ul>\n<li>In case of unfortunate demise of the loan borrower, the insurance company settles the loan amount with the lender\/bank. The excess amount is paid to the beneficiary of the policy holder.<\/li>\n<li>You get tax benefits under Section 80C.<\/li>\n<li>You can opt for other riders such as critical illness or disability rider. In such a case, your loan amount is covered not just in case of death but also cases of critical illness or disability. Such riders will increase the premium amount though.<\/li>\n<li>A single life cover can cover all the borrowers under a joint loan. You do not need to purchase separate term insurance plan for each borrower.<\/li>\n<\/ul>\n<h2>Issues With Home Loan Protection Plans<\/h2>\n<ul>\n<li>HLPPs are expensive as compared to plain vanilla term plans.<\/li>\n<li>In case of single premium policy, where you choose to club the premium amount with the loan amount, you will not get any tax benefits for the year under Section 80C as you have not paid the premium (but the bank has). Some HLPPs offer to provide separate receipt for premium payment for 5 years to enable you to claim tax deduction, even though the single premium amount is included with the home loan amount. For example, if single premium of Rs 1,50,000 was included in your loan amount, you will receive premium payment receipts of Rs 30,000 for first 5 years.<\/li>\n<li>In case of foreclosure of loan or transfer of loan to another bank, you may lose entire or part of the premium. Different HLPPs have different treatment of such cases. Under a few plans, the risk cover simply ceases with no return of premium. Under other plans, customer&#8217;s life cover continues until the end of policy period.<\/li>\n<li>Surrender value ranged from 50%-70% of remaining premium (after adjusting for coverage provided on pro-rata basis) for single or limited premium payment plans. Regular payment plans do not have any surrender value. These plans cannot be ported to other lenders (as these plans are under the master policy between the lender and the insurance company). If your single premium was Rs 50,000 for 10 years and you prepay the loan after 4 years, you can surrender your policy to get Rs 15,000 (i.e., (50% X 50,000) X (6 \/ 10)) back.<\/li>\n<\/ul>\n<h2>Why Are Home Loan Protection Plans Expensive?<\/h2>\n<ul>\n<li>HLPP, for banks, is a third party product. HLPP is offered by an insurance company. Hence, commission involved might drive up the insurance premium.<\/li>\n<li>Unlike term life insurance, where you can compare and purchase the one with a low premium, HLPPs are not available in the open market. These plans are bundled along with the home loans. And the banks\/NBFCs are unlikely to tie-up with more than a few companies. In fact, the banks are likely to stick to their group insurance companies. For example, ICICI Bank may tie-up with only ICICI Prudential and ICICI Lombard. You are a captive customer. Under such cases, there is little competitive pressure.<\/li>\n<li>You have already spent so much effort to negotiate the best interest rates. You do not want your effort to go waste because of this extra burden of HLPP premium. Even in case of a single premium plan, the insurance premium is unlikely to exceed 5-10% of the total loan amount. Additionally, you might be under time pressure to close the house purchase deal. The insurance companies and banks are aware of this.<\/li>\n<li>Insurance companies follow relaxed underwriting norms for such insurance plans. For example, under ICICI Prudential Loan Protect plan advertised on ICICI Bank website, no medical tests are required for cover up to Rs 3.5 crores for people aged less than 50 years. This relaxation in underwriting norms increases the premium.<\/li>\n<\/ul>\n<h2>Term Plan Vs Home Loan Insurance Plan<\/h2>\n<p>Before we get into any kind of comparison, we need to see why you need life insurance. You need life insurance to ensure that your family does not have to make compromises in life even if you were no longer around. To ensure this, you must have life cover sufficient to cover all your outstanding loans, fund all your important financial goals\/life events and provide for your family’s regular expenses. To know more about how to calculate your life insurance requirement, you can read this<a href=\"http:\/\/www.personalfinanceplan.in\/insurance\/life-insurance-calculator\/\" target=\"_blank\"> post<\/a>.<\/p>\n<p>In the above context, you must understand <b>it is necessary to have an insurance plan cover your home loan liability.<\/b> If your existing term plan can cover your home loan (along with other liabilities and goals) you need not purchase a new plan. A term plan is a better option than home loan insurance plan for the following reasons:<\/p>\n<p><strong>A term plan will be much cheaper for the same Sum Assured.<\/strong> We pick up a loan insurance plan from IDBI Federal and a pure term plan from ICICI Prudential.<\/p>\n<p><b>Loan Amount: Rs 30,00,000, Interest Rate: 10% p.a., Loan Term: 20 years<\/b><\/p>\n<table>\n<thead>\n<tr>\n<td style=\"text-align: right;\"><\/td>\n<td style=\"text-align: right;\"><b>IDBI Federal Loansurance (Level Option)<\/b><\/td>\n<td style=\"text-align: right;\"><b>IDBI Federal Loansurance (Reducing Option)<\/b><\/td>\n<td style=\"text-align: right;\"><b>ICICI Pru iProtect Plan<\/b><\/td>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<td>Premium<\/td>\n<td style=\"text-align: right;\">9,234<\/td>\n<td style=\"text-align: right;\">8,892<\/td>\n<td style=\"text-align: right;\">4,172<\/td>\n<\/tr>\n<tr>\n<td>Premium Payment Term<\/td>\n<td style=\"text-align: right;\">20<\/td>\n<td style=\"text-align: right;\">10<\/td>\n<td style=\"text-align: right;\">20<\/td>\n<\/tr>\n<tr>\n<td>Policy Term<\/td>\n<td style=\"text-align: right;\">20<\/td>\n<td style=\"text-align: right;\">20<\/td>\n<td style=\"text-align: right;\">20<\/td>\n<\/tr>\n<tr>\n<td>Total Premium Paid<\/td>\n<td style=\"text-align: right;\">1,84,680<\/td>\n<td style=\"text-align: right;\">88,920<\/td>\n<td style=\"text-align: right;\">83,440<\/td>\n<\/tr>\n<tr>\n<td colspan=\"4\"><b>Payout to family in the event of death of borrower (after adjusting for o\/s loan)<\/b><\/td>\n<\/tr>\n<tr>\n<td>Death After 5 years<\/td>\n<td style=\"text-align: right;\">3,05,927<\/td>\n<td style=\"text-align: right;\">&#8211;<\/td>\n<td style=\"text-align: right;\">3,05,927<\/td>\n<\/tr>\n<tr>\n<td>Death After 10 years<\/td>\n<td style=\"text-align: right;\">8,09,271<\/td>\n<td style=\"text-align: right;\">&#8211;<\/td>\n<td style=\"text-align: right;\">8,09,271<\/td>\n<\/tr>\n<tr>\n<td>Death After 15 years<\/td>\n<td style=\"text-align: right;\">16,37,427<\/td>\n<td style=\"text-align: right;\">&#8211;<\/td>\n<td style=\"text-align: right;\">16,37,427<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>You can see that the loan insurance plan (level option) is much more expensive than the pure term plan. You can argue that the premium for reducing option is comparable to the term plan. However, you also need to consider the death benefits. Additionally, at discount rate of 8%, the present value of premium under term plan is Rs 44,238 while it is Rs 64,439 under reducing option plan. Under the IDBI Federal plan, the level option was available for “interest only” loans. However, we have used the premium rates for demonstration purposes. Under term plans too, you can purchase additional riders such as accidental death, disability, critical illness etc to enhance to scope of your coverage.<\/p>\n<p><strong>Most home loan insurance plans are reducing in nature and hence the life cover keeps going down as the loan gets repaid.<\/strong> In the above example, in case of death after 15 years, the insurance company will pay Rs 13.6 lacs under HLPP and Rs 30 lacs under a term plan. So, even after settling loan dues, the beneficiary will have Rs 16.4 lacs for own use under a term plan.<\/p>\n<p><strong>A term insurance plan will be agnostic of your lender.<\/strong> In case of a term plan, you can easily shift your loan to another lender without forgoing insurance premium. You can simply change the assignment to the new bank, if the new bank requires. Even if you completely prepay the loan, you and your family can continue to enjoy life cover by paying regular premium or simply stop paying premium if you do not want life cover.<\/p>\n<p><strong>It must be noted that sometimes banks ask you to purchase a regular term plan instead of home loan protection plan. <\/strong>This is a more customer-friendly proposal. However, insurance premium for the term plan purchased from bank will be higher because insurance plan is a third party product (and commission will be involved). You can compare the premium available online with the one offered by bank. If there is a big difference between the insurance premiums, you can purchase the term plan online and assign the policy in the bank’s name.<\/p>\n<h2>What Can You Do If The Bank Officials Insist On Purchase Of HLPP?<\/h2>\n<p>Sometimes, the bank officials may want to push such plans saying that the HLPP is compulsory for availing home loan from the bank. There are a few things that you can do:<\/p>\n<ul>\n<li><b>Ask the official to give the bank policy about mandatory purchase of insurance in writing.<\/b> You can tell the official that you are aware of the rules and ask him\/her to give this in writing. If the bank policy does not mandate the purchase of insurance for availing home loan, the official will not give this to you in writing. You can alternatively ask the official to show the relevant clause in the loan agreement which mentions about the purchase of HLPP. Please remember the loan may have a clause for mandatory purchase of property insurance. As we have discussed above, HLPP is different from home or property insurance.<\/li>\n<li><b>Bluff and reject the loan. <\/b>This trick will resonate with those who have tried to bargain with dealerships while purchasing a car. Everybody has targets and so do bank officials. Though the sale of insurance plan would have sweetened the deal for them, a home loan sanction still goes towards meeting their targets. A bank official would not like to lose a customer simply because you declined to purchase insurance policy from them. They are quite likely to get back to you.  This may not be a wise approach if you are in rush to close the house deal as this approach may take some time.<\/li>\n<li><b>Escalate to Senior Management.<\/b> If the bank official refuses to give this in writing and still insists, you can drop an e-mail to senior management, preferable MD\/CEO of the bank. I doubt escalation to branch manager will work. Even if it does, the entire process will be too slow for your liking. Senior management of a bank is extremely concerned about the retail customer satisfaction and likely to swing into action within a few hours. Though I have never taken a home loan, this approach has worked for me in other cases in both public sector and private sector banks and financial institutions. E-mails also help you maintain a written record for conversation. This written record can also be used in escalation to ombudsman or escalator in future.<\/li>\n<li><b>Return the policy within free-look period.<\/b> There is an additional option of returning the life insurance policy within 15 days of receipt of policy. All insurance policies have a free look period of 15 days. You can return the policy after deduction for pro-rata life coverage provided (no. of days policy was in force), expenses on medical examination and stamp duty charges. There can be certain operational hassles. Use this as a last resort only.<\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p><strong>Do you need an insurance plan to cover the outstanding loan amount? The answer is YES. Should you purchase a HLPP to meet this need? The answer is NO. A simple pure term plan is a more cost effective way to achieve the same goal.<\/strong><\/p>\n<p>You need not give into the pressure tactics used by bank officials. It will be unfair to pin the blame on bank officials. If nothing else, by forcing people to purchase loan insurance, they are doing a great service to those buyers, who have been too lazy to purchase adequate life cover. For those who are adequately insured, they can always fight it out with the banks.<\/p>\n<blockquote><p>I have relied on information available online on bank and insurance websites and various other personal finance websites\/forums. Some of the information may be dated. You are advised to check exact policy details with your lender. Do let us know your experience if you have faced such issues while availing home loans.<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you it is compulsory to purchase&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[119,116,7,117,19,46,104,18,30,118],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Home Loan Protection Plan – What Bank Officials Won&#039;t Tell You - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Home Loan Protection Plan – What Bank Officials Won&#039;t Tell You - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you it is compulsory to purchase&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2015-08-24T09:29:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-09-09T06:43:25+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\",\"url\":\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\",\"name\":\"Home Loan Protection Plan – What Bank Officials Won't Tell You - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2015-08-24T09:29:15+00:00\",\"dateModified\":\"2016-09-09T06:43:25+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Home Loan Protection Plan – What Bank Officials Won&#8217;t Tell You\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Home Loan Protection Plan – What Bank Officials Won't Tell You - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","og_locale":"en_US","og_type":"article","og_title":"Home Loan Protection Plan – What Bank Officials Won't Tell You - EMI Calculator","og_description":"You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you it is compulsory to purchase&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","og_site_name":"EMI Calculator","article_published_time":"2015-08-24T09:29:15+00:00","article_modified_time":"2016-09-09T06:43:25+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","url":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","name":"Home Loan Protection Plan – What Bank Officials Won't Tell You - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2015-08-24T09:29:15+00:00","dateModified":"2016-09-09T06:43:25+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Home Loan Protection Plan – What Bank Officials Won&#8217;t Tell You"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-OS","jetpack-related-posts":[{"id":3488,"url":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","url_meta":{"origin":3154,"position":0},"title":"ICICI Bank Home Safe Plus — A Review","date":"March 14, 2016","format":false,"excerpt":"When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan. Repayment of a home loan…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4475,"url":"https:\/\/emicalculator.net\/hdfc-bank-loan-for-professionals\/","url_meta":{"origin":3154,"position":1},"title":"HDFC Bank: Loan for Professionals","date":"November 6, 2018","format":false,"excerpt":"It is not very difficult to get a personal loan if you are a salaried employee. Not so easy for others. There are professionals who started their practice a few years back and need a loan to expand their practice, redo their office or anything else. For such professionals, there…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6001,"url":"https:\/\/emicalculator.net\/are-home-loan-insurance-products-failing-you\/","url_meta":{"origin":3154,"position":2},"title":"Are Home Loan Insurance Products Failing You?","date":"June 1, 2021","format":false,"excerpt":"Death in the family brings not just emotional trauma but can also bring financial agony to the family. If the deceased was the primary breadwinner, the family can struggle financially unless the deceased had bought adequate life insurance coverage. If the deceased had taken a home loan, the loan needs…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4441,"url":"https:\/\/emicalculator.net\/taking-a-home-loan-beware-of-what-the-bankers-may-sell-you\/","url_meta":{"origin":3154,"position":3},"title":"Taking a Home Loan? Beware of What the Bankers May Sell You","date":"October 27, 2018","format":false,"excerpt":"When you take a home loan, you want to make sure that the loan is repaid even in your absence. After all, you want your family to inherit your house (and not your liabilities). This is a reason why you purchase life insurance. Many times, even banks try to convince\/persuade\/force…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3871,"url":"https:\/\/emicalculator.net\/signing-up-as-loan-guarantor-beware-of-risks\/","url_meta":{"origin":3154,"position":4},"title":"Signing up as Loan Guarantor? Beware of Risks","date":"May 5, 2017","format":false,"excerpt":"Your close friend has been planning to buy a house for a long time. However, when he approached the bank to apply for a home loan, bank insisted to getting someone to sign as a guarantor for the loan. Lenders can ask for a financial guarantor if the credit history is…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4058,"url":"https:\/\/emicalculator.net\/6-things-keep-mind-taking-home-loan\/","url_meta":{"origin":3154,"position":5},"title":"6 Things to Keep in Mind While Taking a Home Loan","date":"November 27, 2017","format":false,"excerpt":"A home loan is a long term commitment. Therefore, if you are planning to take one to purchase a house, here are a few things you must keep in mind when you take a home loan. Focus on the Property First, and Then the Home Loan I am quite sure…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3154"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3154"}],"version-history":[{"count":5,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3154\/revisions"}],"predecessor-version":[{"id":3627,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3154\/revisions\/3627"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}