{"id":3190,"date":"2015-08-31T10:49:44","date_gmt":"2015-08-31T05:19:44","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3190"},"modified":"2015-08-31T10:53:14","modified_gmt":"2015-08-31T05:23:14","slug":"cibil-score-understand-how-it-affects-your-loan-application","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","title":{"rendered":"CIBIL Score – Understand How It Affects Your Loan Application"},"content":{"rendered":"<p>You had recently applied for home loan with a private bank. You had done thorough research and were really keen to avail loan from this bank. However, your loan application got rejected. You were informed that your loan could not be approved since your CIBIL score was too low. You had never heard of CIBIL score before. You always thought the bank’s decision was solely driven by your ability to repay debt. Your cash flows were good enough to meet EMI obligation. But a low CIBIL score stumped you. So, what exactly went wrong? A low CIBIL score certainly played a part. How could a score you weren’t even aware of spoil your case? Let’s try to find out more about CIBIL and CIBIL score and how lenders use the score while considering your case. We will also  discuss the factors that affect your credit score and the ways to improve your credit score.<\/p>\n<h3><b>What Is CIBIL?<\/b><\/h3>\n<p>CIBIL or Credit Information Bureau (India) Limited is India’s oldest Credit Information Company or Credit Bureau. CIBIL maintains payment records of individuals’ and non-individuals’ (commercial entities) pertaining to loans and credit cards. These records are submitted to CIBIL by banks and other lenders on a monthly basis. CIBIL uses this information to generate Credit Information Report (CIR) and Credit Score.<\/p>\n<p>Please understand CIBIL is not only credit bureau in India but it is the oldest and the most popular one. Experian Credit Information Co. Of India Pvt. Ltd and Equifax Credit Information Services are among other credit bureaus where you can access your credit report. All the credit reports provide similar information. All the credit bureaus rely on the information furnished by credit institutions (banks\/other lenders\/credit card companies) to make an assessment about your creditworthiness and arrive at your credit score. In this post, we limit ourselves to CIBIL report and discuss what it conveys.<\/p>\n<h3><b>What Does Your CIBIL Report Contain?<\/b><\/h3>\n<p>A <a href=\"https:\/\/emicalculator.net\/how-to-read-your-cibil-credit-report\">CIBIL report<\/a> can be divided into six parts.<\/p>\n<ol>\n<ol>\n<li><b>CIBIL TransUnion Score (Credit Score)<\/b>: This reflects your creditworthiness.<\/li>\n<li><b>Personal Details<\/b>: Personal details such as PAN, passport number, Driving license number,  Aadhar number ,Voter id,   Date of Birth etc<\/li>\n<li><b>Contact Information<\/b>: Address, e-mail and phone contact details<\/li>\n<li><b>Employment Information<\/b>: Monthly or annual income details as mentioned by you in your loan\/credit card application.<\/li>\n<li><b>Account Information<\/b>: This is the most important section. It contains details about all the credit facilities (loans, credit cards etc) availed by you. It shows your payment behaviour, current loan\/credit card balances, default history, month on month payment record for the last three years. Banks\/lenders can use this information along with the income details to easily assess your repayment ability.<\/li>\n<li><b>Enquiry Information<\/b>: This section contains details about credit enquiries made by banks. The date and purpose of enquiry along with approximate amount is mentioned.<\/li>\n<\/ol>\n<\/ol>\n<blockquote><p>Note: All the information above (except credit score) is reported to CIBIL by banks\/financial institutions. Hence, there may be errors in reporting from banks or even by you while filling out various application forms. For better understanding about the CIBIL report, you can visit<a href=\"https:\/\/www.cibil.com\/faq\/understand-your-credit-score-and-report\"> FAQ section<\/a> on CIBIL website.<\/p><\/blockquote>\n<h3><b>What Is A Credit Score?<\/b><\/h3>\n<p>Your <a href=\"https:\/\/emicalculator.net\/cibil-score-an-introduction\">credit score<\/a> ranges between 300 and 900. Higher the score, the better is your credit history.  A higher credit score means you are more likely to meet your debt obligation. The credit score is calculated using information in the Accounts and Enquiries section of your CIBIL report.<\/p>\n<p>The exact methodology behind calculation of credit score is proprietary and is not disclosed. However, CIBIL has disclosed the factors that can affect your credit score.<\/p>\n<h3><b>What Is A Good Credit Score?<\/b><\/h3>\n<p>It is difficult to put a number to it. Various banks\/financial institutions may have different internal guidelines about usage of credit scores. They may or may not have a cut-off based on credit score.<\/p>\n<p>However, as per CIBIL, nearly 90% of the new loans are sanctioned to people with a credit score greater than or equal to 700. Therefore, higher the credit score, better the chances of your loan getting approved.<\/p>\n<p>This does not mean individuals with low credit scores will not get any loans sanctioned.  But yes, the chances go down if you have a low credit score.<\/p>\n<p>A high credit score can create a good first impression. And first impression matters.<\/p>\n<h3><b>What Does “NA” Or “NH” In The Credit Score Mean?<\/b><\/h3>\n<p>This means you are new to credit system or do not have enough credit history for CIBIL to score you. This can also mean that you do not have any credit activity in the last years. Though it is not a bad thing per se, a few lenders may have an internal policy of not extending loans with customer with little credit record.<\/p>\n<h3><b>How Do I Access My CIBIL Report?<\/b><\/h3>\n<p>You can visit <a href=\"http:\/\/www.cibil.com\/\" target=\"_blank\">CIBIL website<\/a> and access your CIBIL report by making an online payment of Rs 500.<\/p>\n<h3><b>Factors That Affect Your CIBIL Score<\/b><\/h3>\n<p>Following are the major factors that affect your credit score:<\/p>\n<ul>\n<li><b>Payment history<\/b>: Late payments on your credit cards or EMI default shows that you are facing issues in keeping up with existing credit obligations. This affects your credit adversely.<\/li>\n<li><b>High utilization of credit limit<\/b>:  A consistently high utilized balance under your credit card indicates increased repayment burden.  This can affect your credit score negatively.<\/li>\n<li><b>Higher percentage of unsecured loans<\/b>: If you have a high percentage of credit card and personal loans, then your credit score may be adversely affected. You need to have balanced mix of secured (auto, home) and unsecured loans (personal loan, credit card). The rationale is that secured loans are used to create an asset while unsecured loans\/credit cards are primarily used for consumption.<br \/>\n<h3><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-3197 img-responsive size-full alignright\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score.png\" alt=\"Factors That Affect Your CIBIL Score\" width=\"485\" height=\"289\" srcset=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score.png 485w, https:\/\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score-300x179.png 300w\" sizes=\"(max-width: 485px) 100vw, 485px\" \/><\/h3>\n<\/li>\n<li><b>Many new accounts opened recently<\/b>: If you have recently got many loans sanctioned and credit cards issued, your repayment ability is expected to down for any further loans.  CIBIL reflects this by negatively impacting your credit score.<\/li>\n<li><b>Too many enquiries for loans\/credit cards<\/b>: It is an extension of point no. 4. If you are applying for loans\/credit cards with too many banks\/financial institutions, it may reflect that you are in desperate need of funds (Credit hungry). This can adversely affect your credit score. Most banks check your credit score as part of their sanction\/approval process. CIBIL uses this information to assess the enquiries made on your behalf.<\/li>\n<\/ul>\n<h3><b>Factors That Do Not Affect Your CIBIL Score<\/b><\/h3>\n<ul>\n<li>Your education<\/li>\n<li>Your savings account behaviour (non-credit behaviour)<\/li>\n<li>Religion\/race\/ethnicity<\/li>\n<li>Gender<\/li>\n<\/ul>\n<p>To sum up, anything that is not related to your credit behaviour does not affect your credit score.<\/p>\n<h3><b>How Do Banks\/Lenders Use CIBIL Report?<\/b><\/h3>\n<p>From lenders’ perspective, they can use CIBIL report to find about applicant’s credit usage\/credit history from the entire banking system in the country. CIBIL report contains information about present and past credit facilities availed by the applicant and his\/her payment behaviour.<\/p>\n<p>Please note that a high credit score or good CIBIL report does not guarantee that you will be sanctioned a loan. However, a good score can certainly make the lender take a positive view of your application. Banks\/other lenders will look at various other parameters such as your repayment ability before they make the final decision.<\/p>\n<p>CIBIL score can be considered a hygiene factor. A high CIBIL score may not guarantee a loan approval but a low credit score will certainly spoil your case.<\/p>\n<h3><b>Why Does Your Credit Score Matter?<\/b><\/h3>\n<p>We have already seen that banks\/lenders consider your credit score while assessing your loan application. Your CIBIL score creates the first impression. Not only does a good credit score improve chances of loan approval, it can also help you negotiate a lower interest rate with banks.<\/p>\n<h3><b>How To Improve Your Credit Score?<\/b><\/h3>\n<p>I have already discussed the factors that affect your credit score negatively. You just need to focus on those areas to improve your credit score.<\/p>\n<ul>\n<li>Make timely payment of EMIs and credit card bills. It is better to make credit card payments in full. By paying the minimum amount due, you may be able to keep your account regular, but consistently high balance on your credit card will not be taken positively by CIBIL.<\/li>\n<li>Avoid unnecessary debt. Have a balanced mix of secured and unsecured loans<\/li>\n<li>Access your CIBIL report on a regular basis and point out the errors in your credit report, if any<\/li>\n<li>Apply for loans\/credit cards after doing proper research. Applying indiscriminately for loans and credit cards will result in <i>hard enquiries<\/i> by credit institutions for your CIBIL report. So, do your research and apply only to select banks. When you access your own credit report, it is considered a <i>soft enquiry<\/i> and does not affect your credit score.<\/li>\n<\/ul>\n<blockquote><p><i>Note: The change in your credit score won’t happen overnight. It will take some time. You need to maintain good credit behaviour on a consistent basis to get a high credit score.<\/i><\/p><\/blockquote>\n<h3><b>What To Do If The Information In The CIBIL Report Is Not Correct?<\/b><\/h3>\n<p>You can raise a dispute with CIBIL by submitting an online dispute resolution form if you see a mistake in your CIBIL report. CIBIL takes up your request with the concerned credit institution. Once the credit institution confirms the error, CIBIL reflects the correct information in its database. If you are not satisfied with the resolution, you can raise a request again or directly approach your lender\/bank\/credit card company.<\/p>\n<blockquote><p><i>Note: As per Credit Information Companies Act of 2005, CIBIL cannot modify any information in its database without confirmation from concerned bank\/financial institution.<\/i><\/p><\/blockquote>\n<p>Alternatively, you can directly approach your bank\/credit institution and request to rectify the errors in their reporting to CIBIL.<\/p>\n<h3><b>Conclusion<\/b><\/h3>\n<p>If you are planning to apply for a loan, do make it point to download your credit score before you apply. If you see the score is too low, try to improve the score by improving your credit behaviour. On the other hand, if you notice an error in the report, raise a dispute with CIBIL. Additionally, request the credit institution to rectify the error reporting to CIBIL. A good CIBIL score not only increases chances of getting your loan application approved but with a high score, you may also be able to negotiate a lower interest rate with the bank\/credit institution.<\/p>\n<p>Since it takes time to improve your credit score, it won’t be unwise to access your CIBIL report on a regular basis. Improve the credit behaviour, if required and get the errors in your report rectified.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You had recently applied for home loan with a private bank. You had done thorough research and were really keen to avail loan from this bank. However, your loan application got rejected. You were informed that your loan could not be approved since your CIBIL score was too low. You had never heard of CIBIL&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[37,52,36,5,8],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"You had recently applied for home loan with a private bank. You had done thorough research and were really keen to avail loan from this bank. However, your loan application got rejected. You were informed that your loan could not be approved since your CIBIL score was too low. You had never heard of CIBIL&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2015-08-31T05:19:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-08-31T05:23:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score.png\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\",\"url\":\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\",\"name\":\"CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2015-08-31T05:19:44+00:00\",\"dateModified\":\"2015-08-31T05:23:14+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"CIBIL Score – Understand How It Affects Your Loan Application\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","og_locale":"en_US","og_type":"article","og_title":"CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator","og_description":"You had recently applied for home loan with a private bank. You had done thorough research and were really keen to avail loan from this bank. However, your loan application got rejected. You were informed that your loan could not be approved since your CIBIL score was too low. You had never heard of CIBIL&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","og_site_name":"EMI Calculator","article_published_time":"2015-08-31T05:19:44+00:00","article_modified_time":"2015-08-31T05:23:14+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/Factors-That-Affect-Your-CIBIL-Score.png"}],"author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","url":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/","name":"CIBIL Score – Understand How It Affects Your Loan Application - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2015-08-31T05:19:44+00:00","dateModified":"2015-08-31T05:23:14+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/cibil-score-understand-how-it-affects-your-loan-application\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"CIBIL Score – Understand How It Affects Your Loan Application"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Ps","jetpack-related-posts":[{"id":4398,"url":"https:\/\/emicalculator.net\/how-to-check-cibil-score-on-whatsapp-for-free\/","url_meta":{"origin":3190,"position":0},"title":"How to Check CIBIL Score on Whatsapp for Free?","date":"October 12, 2018","format":false,"excerpt":"Recently, I came across an interesting article in Mint about accessing your CIBIL score on WhatsApp. Your credit score is a measure of your credit worthiness. Higher your score, greater your credit worthiness. TransUnion CIBIL is one of the credit bureaus and the credit score CIBIL provides is known as…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"CIBIL Score on WhatsApp","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/image1.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2101,"url":"https:\/\/emicalculator.net\/cibil-score-an-introduction\/","url_meta":{"origin":3190,"position":1},"title":"CIBIL Score &#8211; An Introduction","date":"November 12, 2012","format":false,"excerpt":"What is credit history? If you would know the value of money, go and try to borrow some. - Benjamin Franklin Credit history is the information about your past financial behaviour that takes into account the number of outstanding loans you have, the number of credit card(s) you have, your…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3763,"url":"https:\/\/emicalculator.net\/your-credit-score-will-determine-your-home-loan-emi\/","url_meta":{"origin":3190,"position":2},"title":"Your Credit Score Will Determine Your Home Loan EMI","date":"January 30, 2017","format":false,"excerpt":"You know that your credit score plays an important role in getting a loan. A lower credit score can simply ruin your chances of getting a loan. What you perhaps didn’t know was that a good credit score could get you better interest rates. Although it may already be happening…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7145,"url":"https:\/\/emicalculator.net\/sbi-reduces-home-loan-interest-rates-for-those-with-good-cibil-scores\/","url_meta":{"origin":3190,"position":3},"title":"SBI Reduces Home Loan Interest Rates for Those with Good CIBIL Scores","date":"March 16, 2023","format":false,"excerpt":"While trying to figure out a good home loan product for a client, I stumbled upon these revised interest rates on SBI home loan website. You can read the SBI campaign offer document here. There are a few points that stand out in this interest rate chart. #1 SBI Has…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"sbi home loan interest rates","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/sbi-home-loan-interest-rates.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3384,"url":"https:\/\/emicalculator.net\/factors-to-consider-while-taking-car-loans\/","url_meta":{"origin":3190,"position":4},"title":"6 Factors to Consider While Taking Car Loans","date":"February 14, 2016","format":false,"excerpt":"You have been planning to buy a car.  In fact, you have been looking to buy one ever since you finished college. You have also accumulated money for down payment. And have been planning to take loan for the remaining amount. In this post, I will discuss a few things…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3350,"url":"https:\/\/emicalculator.net\/9-things-to-consider-before-availing-personal-loan\/","url_meta":{"origin":3190,"position":5},"title":"9 Things to Consider before Availing Personal Loan","date":"December 24, 2015","format":false,"excerpt":"These days, it is not uncommon to find at least one e-mail per day about instant or pre-approved personal loan in your mailbox.  The creative teams at banks can actually make you feel that the offer has specifically been customized for you. Do not fall for the attractive advertisement. You…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3190"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3190"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3190\/revisions"}],"predecessor-version":[{"id":3212,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3190\/revisions\/3212"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3190"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3190"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3190"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}