{"id":3214,"date":"2015-09-06T17:23:27","date_gmt":"2015-09-06T11:53:27","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3214"},"modified":"2015-09-06T17:33:47","modified_gmt":"2015-09-06T12:03:47","slug":"should-you-buy-home-insurance","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/","title":{"rendered":"Should You Buy Home Insurance?"},"content":{"rendered":"<p>A house, for most of us, is the biggest investment we make in life. Not just that, you enter into long term commitment to pay off those EMIs and call your dream house truly yours. So, most of us dedicate a better part of our professional lives to make this dream house a reality. Any damage to your dream house can not only give you emotional trauma but also subject you to financial nightmares.<\/p>\n<p>Recent earthquakes in Nepal and floods in Uttarakhand last year wreaked havoc on human life and property. Events such as these highlight the need for purchasing protection against loss to your house\/property due to these calamities. Purchasing a home insurance plan won’t prevent these natural calamities from happening. However, such plans can ease the financial stress while restoring the damaged property.<\/p>\n<p>The concept is simple. Home insurance, as the name suggest, covers damages to the structure of your house due to perils such as fire, flood, lightning and earthquakes. You can also cover damages to the contents\/belonging\/valuables under such a plan. In this post, I will cover the basics of home insurance plans.<\/p>\n<h2>What Are the Two Types of Home\/property Insurance Plans?<\/h2>\n<h3><img decoding=\"async\" loading=\"lazy\" class=\"img-responsive size-full wp-image-3227 aligncenter\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Home-Insurance.png\" alt=\"Home Insurance\" width=\"727\" height=\"650\" srcset=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Home-Insurance.png 727w, https:\/\/emicalculator.net\/wp-content\/uploads\/Home-Insurance-300x268.png 300w\" sizes=\"(max-width: 727px) 100vw, 727px\" \/><\/h3>\n<p>Home insurance plans cover two kinds of damages to your house:<\/p>\n<ol>\n<li><b>Damage to the structure.<\/b> Under such a cover, you will be provided construction costs in the event of damage to the property due to natural calamity, riots, fire (or any other event as mentioned in the policy document). Only damages to the structure are covered.<\/li>\n<li><b>Damage to the contents\/belongings.<\/b> You will be compensated for any damage to household belongings and contents such as furniture, appliances etc due to natural calamities, fire, rioting etc. There can be many variants which cover loss due to burglary and theft.<\/li>\n<\/ol>\n<p>There are comprehensive policies around that offer cover both kinds of damages. If you are an owner, you can purchase cover for both structure and contents. On the other hand, tenants can only purchase cover for contents.<\/p>\n<p><b>Please note not all types of damages to your property will be covered under the plan.<\/b> The extent of coverage will vary across policies. For instance, a particular policy may cover damage to the structure due to an earthquake while the other plan may not. So, you need to be sure of the nature and extent of coverage before you purchase the plan. For someone living in a region of high seismic activity, it is extremely important to purchase a policy that compensates for damages due to an earthquake. Not all insurance plans cover earthquake in the basic policy but offer as an additional cover.<\/p>\n<blockquote><p>Editor&#8217;s Note: Home Insurance is different from Home Loan Insurance (aka Home Loan Protection Plan), although some innovative banks\/insurers sometimes combine both features in one product. You can read more about <a href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\">Home Loan Protection Plan<\/a> here.<\/p><\/blockquote>\n<h3>Common Add-on Covers<\/h3>\n<ul>\n<li><strong>Rent cover. <\/strong>This cover provides expenses towards rent (for alternative accommodation) for the duration you have to move out of your house for repair work. The amount can be capped through a sub-limit.<\/li>\n<li><strong>Terrorism cover.<\/strong> This covers for the damages to structure and content through acts of terrorism.<\/li>\n<li><strong>Burglary and theft cover<\/strong>. Covers damage to structure\/content due to burglary and theft.<\/li>\n<\/ul>\n<p>There may be many more add-on covers. You can go through the policy brochure\/wordings to get the full list of add-on covers available.<\/p>\n<h3>Exclusions<\/h3>\n<p>Though you must refer to the policy wordings for the exact set of exclusions, common exclusions are listed below:<\/p>\n<ul>\n<li>Wilful damage to the structure or contents or gross negligence<\/li>\n<li>Misrepresentation or non-disclosure of material information<\/li>\n<li>Damages (to contents and structure) which are pre-existing in nature<\/li>\n<li>Foreign enemy hostility or war-like operation<\/li>\n<li>Manufacturing defects in case of contents<\/li>\n<\/ul>\n<p>These are only some of the common exclusions. If you go through the policy documents, you will find the exclusion list running into many pages.<\/p>\n<h3>Premium Applicable<\/h3>\n<p>In terms of quantum of premium payable, home insurance is similar to term life insurance. Premium payable is quite low as compared to the extent of coverage provided. The premium will depend on Sum Insured, which will in turn depend on the construction cost and the built up area of the property. Construction cost will, in turn, depend on quality of construction and also locality to an extent.<\/p>\n<p>I checked the premium rates for a home insurance plan on the website of a private insurer. For a property with a built up area of 1000 sq feet and construction cost of Rs 3000 \/sq. feet, sum insured came out to Rs 30 lacs. The premium of such coverage was Rs 11,970 for 10 year (inclusive of service tax and terrorism cover). This means your property will be protected for 10 year by paying a single premium of Rs 11,970. Therefore, pure structure cover is quite inexpensive.<\/p>\n<p>For the same property and construction, if you add content insurance for Rs 10 lacs and jewellery of Rs 2.5 lacs, the premium rises to Rs 44,033 for five years. The rise is understandable since the chance of damage to household items is much higher than damage to the structure.<\/p>\n<h3>Tenure of the Cover<\/h3>\n<p>Typically, you have an option to go for an annual cover or a multi-year policy. Under an annual cover, you can revisit your cover every year. On the other hand, in a multi-year policy, you can get heavy discounts.<\/p>\n<h2>How Do I Arrive at a Proper Sum Insured?<\/h2>\n<p>There are three methods that can be used to arrive at an appropriate value. Not all insurers will  offer you all three options. In fact, the same plan may use one method for the structure and another method for content\/belongings.<\/p>\n<ol>\n<li><b>Market value method:<\/b> Under this method, depreciation is deducted from the cost of asset. Therefore, at the time of claim, the value of the asset might have depreciated considerably. Insurance company will pay only the depreciated cost. Thus, if you opt for such policy, you may not get enough money to replace the asset (or belonging). For instance, if you purchase a TV for Rs. 50,000. The depreciated cost of the same TV will be approximately Rs 30,000 (10% depreciation every year). In the event of theft (if your policy covers theft), insurance company will pay you only Rs 30,000. This amount may not be enough for you to purchase a new TV.<\/li>\n<li><b>Reinstatement Value method:<\/b>  Under this method, no depreciation is levied. Insurance company pays the full cost of replacement subject to the ceiling of Sum Insured. <b>It covers only the cost of construction (and not the land)<\/b>. Therefore, the insurer pays you the actual cost of construction\/repair of the property subject to the ceiling of Sum Insured.<br \/>\n<blockquote><p>Typically, the structure of the house is insured as per the re-instatement value method while the contents are valued at the market value method. However, there will be exceptions across policies.<\/p><\/blockquote>\n<\/li>\n<li><b>Agreed Value Basis:<\/b> This is not offered by too many insurance companies. Under this method, the value of the property is arrived at by multiplying the area of the house with the Ready Reckoner Rate (used for property taxes and stamp duty purpose) for the locality. <b>Hence, if you purchase insurance on Agreed Value Basis, you are also covered for the cost of land<\/b>.<br \/>\n<blockquote><p>This type of insurance is suited for those who have purchased an apartment\/flat in a multi-storey building. In case of structural damage to the building, your apartment cannot be constructed till all the flats below have not been constructed. This can be a problem, especially if your housing society has not purchased home insurance for the entire building. In such a case, the insurance will pay you Sum Insured. You can purchase a new property using those funds. Please note that if you exercise such option, the ownership of your old house will be transferred to the insurance company.<\/p><\/blockquote>\n<\/li>\n<\/ol>\n<h3>What If You Declare Too High a Value for Your Home?<\/h3>\n<p>There are people who might be tempted to do that. Premium for property insurance is not so high. In a way, you are trying to profit out of loss to your property. Don’t do that. Insurance companies are far too smart to let you make merry at their expense. You will only end up paying high premium. When you purchase insurance, you should use the current construction cost of the property or reinstatement value of the property to arrive at sum insured. Try to get as accurate an assessment as possible. It is important to get the sum insured right. You can try to assess the actual reconstruction costs from local builder, Municipal Corporation or real estate websites. It is not easy to get an accurate assessment but try to get a number as close as possible.<\/p>\n<p>Let’s see what will happen if you under-insure or over-insure your property. <b>Suppose the reinstatement value (construction cost) of the property is Rs 50 lacs<\/b>. Let’s consider the following two scenarios:<\/p>\n<ul>\n<li><strong>Over-insurance<\/strong>: You purchase cover of Rs 1 crore. The property is damaged completely. Let’s say a covered event destroys the property completely. The insurance company in such a case will pay you only Rs 50 lacs (and not Rs 1 crore) as Rs 50 lacs is enough to reinstate the property.<\/li>\n<li><strong>Under-insurance<\/strong>: You purchase the cover for Rs 30 lacs. A covered event causes partial damage to the property. The repair cost is estimated as Rs 40 lacs. The insurance company will pay only Rs 24 lacs (30\/50*40 lacs). Well, you could have saved premium by opting for lower sum insured. But you can see insurance company will pay only the proportional damage (Condition of Average). You can refer to “Condition of Average” in the policy document for the exact definition.<\/li>\n<\/ul>\n<p><b>The idea behind home insurance is not to make profit out of loss\/covered event.<\/b> Opting for over-insurance also goes against the basic tenet of insurance. Occurrence of an insured event should affect you adversely. In case of over insurance, you might actually want the insured event to happen.  Such behaviour is to be strictly avoided.<\/p>\n<h2>Claims Process<\/h2>\n<p>On filing of claim request, the insurance company will send a surveyor to your property. You will be required to submit all the required documents to the surveyor. Tentative list of documents are provided in the policy document. Exact list will be conveyed by the insurer at the time of claim. The surveyor will send to final survey report to the insurance company. The insurance company will subsequently process the claim. Though I don’t have any experience about home insurance claims, it is not going to be as easy as it sounds.<\/p>\n<h3>Things to Be Prepared for<\/h3>\n<p>Insurance companies don’t do much due diligence while issuing such policies. This is unlike life and health insurance plans where you have to go through medical tests. They rely on your declaration while issuing the policy. It is only when you make the claim that they ask for documents (pertaining to valuation etc) for verification. The basis for estimation of construction cost can be very subjective. Policy wordings are quite vague. <b>Hence, this leaves the scope for dispute between you and the insurance company at the time of claim. Even if the claim is admissible, the claim settlement amount can be a serious bone of contention.<\/b><\/p>\n<p>The penetration of home\/property insurance in India is quite low. Serious damage to the property\/house structure (of an insured house) is a relatively low probability event. I have not been able to find much information about the claim experience for home insurance.<\/p>\n<p><b>Should you buy home insurance? The answer is an unequivocal Yes<\/b>. You must purchase one. It is not very expensive either. However, you must do due diligence and be prepared that getting the claim approved is not going to be an easy job.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A house, for most of us, is the biggest investment we make in life. Not just that, you enter into long term commitment to pay off those EMIs and call your dream house truly yours. So, most of us dedicate a better part of our professional lives to make this dream house a reality. Any&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[14,120,117,99],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Should You Buy Home Insurance? - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Should You Buy Home Insurance? - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"A house, for most of us, is the biggest investment we make in life. Not just that, you enter into long term commitment to pay off those EMIs and call your dream house truly yours. So, most of us dedicate a better part of our professional lives to make this dream house a reality. Any&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2015-09-06T11:53:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-09-06T12:03:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/Home-Insurance.png\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\",\"url\":\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\",\"name\":\"Should You Buy Home Insurance? - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2015-09-06T11:53:27+00:00\",\"dateModified\":\"2015-09-06T12:03:47+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Should You Buy Home Insurance?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Should You Buy Home Insurance? - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/","og_locale":"en_US","og_type":"article","og_title":"Should You Buy Home Insurance? - EMI Calculator","og_description":"A house, for most of us, is the biggest investment we make in life. Not just that, you enter into long term commitment to pay off those EMIs and call your dream house truly yours. So, most of us dedicate a better part of our professional lives to make this dream house a reality. Any&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/","og_site_name":"EMI Calculator","article_published_time":"2015-09-06T11:53:27+00:00","article_modified_time":"2015-09-06T12:03:47+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/Home-Insurance.png"}],"author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/","url":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/","name":"Should You Buy Home Insurance? - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2015-09-06T11:53:27+00:00","dateModified":"2015-09-06T12:03:47+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/should-you-buy-home-insurance\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/should-you-buy-home-insurance\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Should You Buy Home Insurance?"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-PQ","jetpack-related-posts":[{"id":4441,"url":"https:\/\/emicalculator.net\/taking-a-home-loan-beware-of-what-the-bankers-may-sell-you\/","url_meta":{"origin":3214,"position":0},"title":"Taking a Home Loan? Beware of What the Bankers May Sell You","date":"October 27, 2018","format":false,"excerpt":"When you take a home loan, you want to make sure that the loan is repaid even in your absence. After all, you want your family to inherit your house (and not your liabilities). This is a reason why you purchase life insurance. Many times, even banks try to convince\/persuade\/force…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3488,"url":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","url_meta":{"origin":3214,"position":1},"title":"ICICI Bank Home Safe Plus — A Review","date":"March 14, 2016","format":false,"excerpt":"When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan. Repayment of a home loan…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3154,"url":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","url_meta":{"origin":3214,"position":2},"title":"Home Loan Protection Plan – What Bank Officials Won&#8217;t Tell You","date":"August 24, 2015","format":false,"excerpt":"You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4058,"url":"https:\/\/emicalculator.net\/6-things-keep-mind-taking-home-loan\/","url_meta":{"origin":3214,"position":3},"title":"6 Things to Keep in Mind While Taking a Home Loan","date":"November 27, 2017","format":false,"excerpt":"A home loan is a long term commitment. Therefore, if you are planning to take one to purchase a house, here are a few things you must keep in mind when you take a home loan. Focus on the Property First, and Then the Home Loan I am quite sure…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4139,"url":"https:\/\/emicalculator.net\/pnb-housing-unnati-home-loan-scheme\/","url_meta":{"origin":3214,"position":4},"title":"PNB Housing Unnati Home Loan Scheme","date":"December 20, 2017","format":false,"excerpt":"We have reviewed many home loan products on this blog. However, most of those loan products were for established self-employed professionals and salaried individuals working with Government Organizations or established corporates. However, the desire to own a home is much deep rooted and almost everyone wants to own a house. And…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3425,"url":"https:\/\/emicalculator.net\/do-you-have-these-insurance-plans-in-your-portfolio\/","url_meta":{"origin":3214,"position":5},"title":"Do You Have These Insurance Plans in Your Portfolio?","date":"March 1, 2016","format":false,"excerpt":"Why do we purchase insurance? Well, the answer is simple. You purchase insurance to guard against the impact of a particular event on your family’s finances. That event could be death, illness, disability or damage to expensive belongings. You don’t insure your pen or clothes but you insure your car.…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3214"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3214"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3214\/revisions"}],"predecessor-version":[{"id":3231,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3214\/revisions\/3231"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3214"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3214"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3214"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}