{"id":3373,"date":"2016-01-13T12:47:59","date_gmt":"2016-01-13T07:17:59","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3373"},"modified":"2016-01-13T12:48:08","modified_gmt":"2016-01-13T07:18:08","slug":"tax-benefits-on-joint-home-loans","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","title":{"rendered":"Tax Benefits on Joint Home Loans"},"content":{"rendered":"<p>With real estate prices at elevated levels, purchase of a dream house is not easy anymore. Higher residential real estate prices lead to requirement for higher value loans too. If the bank or housing finance company feels that your salary is not enough to service the loan comfortably, it can even decline your loan application. In such a case, it helps if yours is a double income household. You can take a joint loan with your spouse. With twin salaries, your borrowing capacity gets enhanced and banks may be more comfortable lending to you.<\/p>\n<p>I discussed the <a href=\"https:\/\/emicalculator.net\/understanding-tax-benefits-on-home-loan-updated\">tax benefits on home loan<\/a> earlier. Can both you and your spouse claim exemption for principal repayment under Section 80C and interest payment under Section 24? Does that mean you can get double the tax benefits? In this post, I shall try to answer such questions about tax benefits on joint home loans.<\/p>\n<h3>Who Can Apply for a Joint Loan?<\/h3>\n<p>Typically, banks allow you to take a joint loan with your spouse, parents and children. Some banks may even allow brothers to take joint loan. Most banks wouldn’t allow you to take joint loans with your sister or friends. Additionally, unmarried couples are not offered joint loans. <i>Banks may also insist that all the co-borrowers are also the co-owners of the property. <\/i>However, each bank has a different credit policy. Hence, the banks may not allow all the relationship combinations mentioned above. You are advised to check these conditions with your bank. Additionally, in this post, I will focus on situation where you have taken a joint home loan with your spouse i.e. only two co-borrowers.<\/p>\n<h3>Repayment Process<\/h3>\n<p>You can issue post dated cheques or give an ECS mandate from a single or joint bank account. Banks may or may not insist on a joint bank account. From bank’s perspective, it does not matter who is really repaying the loan. All the banks worry about is that you should have enough money in the account on the date of EMI payment. However, from the taxation perspective, it matters who is repaying the loan. Let’s understand the tax benefits that joint home loans offer.<\/p>\n<h3>What about the Tax Benefits?<\/h3>\n<p>For principal repayment, each of you can avail to the extent of Rs 1.5 lacs per financial year under Section 80C. Hence, the combined tax benefit for principal repayment goes up to Rs 3 lacs per financial year.<\/p>\n<p>For interest payment, each of you can avail to the extent of Rs 2 lacs per financial year under Section 24 of the Income Tax Act. This is for a self occupied property. The combined tax benefit, therefore, for interest payment can be up to Rs 4 lacs per financial year.<\/p>\n<p><i>Please note that the conditions to be met before you start availing tax benefits on principal repayment or interest payment remain the same (as in case of an individual borrower).<\/i> You can go through the following post to find out more about such<a href=\"https:\/\/emicalculator.net\/understanding-tax-benefits-on-home-loan-updated\"> pre-conditions<\/a>. I will list down such conditions in short here.<\/p>\n<ul>\n<li>You cannot avail these benefits for an under-construction property. You can start availing these benefits from the financial year in which the house is acquired or construction is completed.<\/li>\n<li>For claiming maximum benefits under Section 24, the construction of the house has to be completed or the house has to be acquired within 3 years from the end of financial year in which the loan was taken. If this condition is not met, then the maximum benefit under Section 24 (for interest payment on home loan) shall be limited to Rs 30,000 per financial year. Hence, the combined benefit will go down to Rs 60,000 per financial year.<\/li>\n<li>For the interest paid during the under-construction period, the interest can be aggregated and claimed as deduction under Section 24 in equal installments over the next five years, starting from the financial year in which the construction is completed. However, the cap of Rs 2 lacs (or Rs 30,000 as the case may be) still applies.<\/li>\n<li>For the let out property (or deemed to be let out property), there is no cap on deduction that you (and the co-borrower) can avail for interest payment. The entire interest amount can be deducted from the rental income (income from house property) while calculating total income of the borrowers (or co-borrowers).<\/li>\n<\/ul>\n<h3>Are There Any Conditions to Be Met?<\/h3>\n<p><b>Well, you have to be a co-borrower on the home loan.<\/b> Makes sense too. You have to be a borrower before you start availing tax benefits on repayment of such loan. So, if your spouse has taken the loan (you are not a co-borrower) and you are transferring a portion of the EMI from your salary account to bank account, you won’t get any tax benefits.<\/p>\n<p><b>In addition, you have to be a co-owner too.<\/b> Banks may not insist on co-borrower being a co-owner. However, if both of you want to avail tax benefits, both of you have to be co-owners too. Hence, the residential property must be registered in the names of both of you.<\/p>\n<p>To sum up, in case both you and your spouse want to avail tax benefits,<\/p>\n<ol>\n<li>Both of you have to be co-owners of the property.<\/li>\n<li>Both of you have to be co-borrowers (or co-applicants) in the loan.<\/li>\n<\/ol>\n<h3>How Are Tax Benefits Shared among the Co-Borrowers?<\/h3>\n<p>On some of the blogs and tax<a href=\"http:\/\/taxguru.in\/income-tax\/tax-benefits-home-loan-joint-names.html\"> websites<\/a>, I read that the tax benefits should also be in the ratio of ownership in the house property. For instance, let’s assume you and your spouse have paid interest of Rs 2 lacs in a financial year. The ownership of the house is in the ratio 75:25 (or 3:1). Then, you can claim Rs 1.5 lacs and your spouse can claim (Rs 50,000) under Section 24 for the financial year. Tax benefit for principal repayment shall also be shared in the same ratio (ownership). So, as per this approach, you cannot claim Rs 2 lacs as interest deduction even if you want to.<\/p>\n<p>However, as per my understanding of Income Tax Act, the Act requires ownership interest in the house in order to avail income tax benefit. However, it stops short of explicitly mentioning whether the tax benefits claimed by you and your spouse should be in ratio of your ownership in the property. For instance, if the property is owned by you and your spouse in the ratio of 75:25, should the tax benefits also be in ratio of 75:25? Or if you are paying the entire EMI, should you get the entire tax benefit? To me, this is a grey area and I did not get a clear answer even after talking to a few tax consultants. So, what should you do? To avoid any confusion,<\/p>\n<ul>\n<li>Get the ownership ratio mentioned in the property documents.<\/li>\n<li>Keep a clean record for your share of payments. If you are making EMI payments through a joint account, both of you should transfer your share of EMI to the joint account. Alternatively, if you have given an ECS mandate on your account, your spouse must transfer his\/her share of EMI to your bank account. This way, you can easily show to the assessing officer that you (and your wife) have made payments as mentioned in the respective income tax returns.<\/li>\n<li>Do not claim more than you have paid. For instance, you paid interest of Rs 3 lacs during the entire year. However, you and your spouse claimed Rs 2 lacs each under Section 24. Both of us combined cannot claim more than the actual interest paid.<\/li>\n<\/ul>\n<p>This is the safest approach and you won’t face any issues. There can be certain conditions where you might be allowed to avail tax benefits as per the amount you are repaying (and not just based on ownership ratio). However, I wouldn’t go into such conditions.<\/p>\n<blockquote><p><b>Note: Please understand I am not a tax expert. I would advise you to seek services of a tax consultant before making any decision.<\/b><\/p><\/blockquote>\n<h3>Points to Note<\/h3>\n<ol>\n<li>Some banks may offer a discount of a few basis points if the first applicant is a female. Hence, married couples can apply in a way that the wife is the first applicant and the husband is the co-applicant (co-borrower).<\/li>\n<li>Please understand the liability of the co-borrower is towards the entire loan (and not just towards the share of ownership in the property). This can assume importance in case of separation in the future or demise of one of the co-borrowers.<\/li>\n<li>Do purchase term insurance for your share of loan. This ensures that in case of demise of one of the co-borrowers, the other co-borrowers do not have to share the additional burden. The proceeds from the insurance policy can be used to settle part loan.<\/li>\n<li>You can decide the ownership ratio in the property on the basis of your income levels. So, for instance, if you fall in the 30% tax bracket and your spouse is in 10% tax bracket, you can have ratio as 75:25 or 80:20 as the case may be.  Since you fall in the highest tax bracket, you will save more on taxes. And yes, do ensure you have a record of payments to prove that you (and your spouse) are paying your share of EMI.<\/li>\n<\/ol>\n<h3>Conclusion<\/h3>\n<p>By going for joint home loans, you can not only increase your loan eligibility but also become eligible for double tax benefits. For large value home loans, a single person may not even be able to take tax benefit for the entire interest payment made (or principal repayment made). For a loan of Rs 50 lacs at 10% p.a. for 20 years, you will pay total interest of ~Rs 5 lacs in the first year. However, if you are the sole borrower, you will get benefit for only Rs 2 lacs under Section 24. If you have taken a joint loan with your wife, she can claim benefits for Rs 2 lacs too. Hence, there are clear tax benefits in case you opt for a joint home loan.<\/p>\n<p>Do remember, you need to co-owner as well co-borrower in order to avail tax benefits. You won’t get any tax benefits if you are not the co-owner. And get the ownership ratio right to get maximum tax benefits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With real estate prices at elevated levels, purchase of a dream house is not easy anymore. Higher residential real estate prices lead to requirement for higher value loans too. If the bank or housing finance company feels that your salary is not enough to service the loan comfortably, it can even decline your loan application.&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[7,110,30],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Tax Benefits on Joint Home Loans - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Tax Benefits on Joint Home Loans - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"With real estate prices at elevated levels, purchase of a dream house is not easy anymore. Higher residential real estate prices lead to requirement for higher value loans too. If the bank or housing finance company feels that your salary is not enough to service the loan comfortably, it can even decline your loan application.&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2016-01-13T07:17:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-01-13T07:18:08+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\",\"url\":\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\",\"name\":\"Tax Benefits on Joint Home Loans - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2016-01-13T07:17:59+00:00\",\"dateModified\":\"2016-01-13T07:18:08+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Tax Benefits on Joint Home Loans\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Tax Benefits on Joint Home Loans - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","og_locale":"en_US","og_type":"article","og_title":"Tax Benefits on Joint Home Loans - EMI Calculator","og_description":"With real estate prices at elevated levels, purchase of a dream house is not easy anymore. Higher residential real estate prices lead to requirement for higher value loans too. If the bank or housing finance company feels that your salary is not enough to service the loan comfortably, it can even decline your loan application.&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","og_site_name":"EMI Calculator","article_published_time":"2016-01-13T07:17:59+00:00","article_modified_time":"2016-01-13T07:18:08+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","url":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/","name":"Tax Benefits on Joint Home Loans - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2016-01-13T07:17:59+00:00","dateModified":"2016-01-13T07:18:08+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/tax-benefits-on-joint-home-loans\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Tax Benefits on Joint Home Loans"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Sp","jetpack-related-posts":[{"id":3553,"url":"https:\/\/emicalculator.net\/8-lesser-known-details-about-home-loan-tax-benefits\/","url_meta":{"origin":3373,"position":0},"title":"8 Lesser Known Details About Home Loan Tax Benefits","date":"June 17, 2016","format":false,"excerpt":"You are aware that you get tax benefit of up to Rs 1.5 lacs for principal repayment under Section 80C of the Income Tax Act. You are also aware about tax benefit of up to Rs 2 lacs for interest payment for a housing loan for a self-occupied house. In…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6117,"url":"https:\/\/emicalculator.net\/an-education-loan-or-a-loan-for-education\/","url_meta":{"origin":3373,"position":1},"title":"An Education Loan or a Loan for Education?","date":"August 23, 2021","format":false,"excerpt":"Higher education is getting expensive and many of us need to take an education loan to fund higher education for children. Fortunately, all the banks offer education loan products. And, given the product nature, there are a few peculiarities about education loans. Since the student won’t earn while studying (or…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3277,"url":"https:\/\/emicalculator.net\/understanding-tax-benefits-on-home-loan-updated\/","url_meta":{"origin":3373,"position":2},"title":"Understanding Tax Benefits on Home Loan (Updated)","date":"October 12, 2015","format":false,"excerpt":"For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house,…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3831,"url":"https:\/\/emicalculator.net\/tax-benefits-on-education-loan\/","url_meta":{"origin":3373,"position":3},"title":"Tax Benefits on Education Loan","date":"April 4, 2017","format":false,"excerpt":"Higher education is getting expensive each year. Management education at any premier management institute in India will cost north of Rs 15 lacs for two years. And the high cost is not just limited to management education. Not everyone may have the resources to fund such education on own. Those…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6276,"url":"https:\/\/emicalculator.net\/3-benefits-for-women-home-buyers-in-india\/","url_meta":{"origin":3373,"position":4},"title":"3 Benefits for Women Home Buyers in India","date":"November 9, 2021","format":false,"excerpt":"Asset ownership is one of the ways of women empowerment. Thus, the Government tries to incentivise women house ownership. In this post, let’s look at 3 benefits available to women home buyers in India. #1 Banks Offer Lower Interest Rates to Women The lenders usually offer lower interest rates to…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/4024254468_a87e291efa_w-300x240.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4946,"url":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","url_meta":{"origin":3373,"position":5},"title":"Home Loan Tax Benefits 2019","date":"July 31, 2019","format":false,"excerpt":"For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house,…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3373"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3373"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3373\/revisions"}],"predecessor-version":[{"id":3378,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3373\/revisions\/3378"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3373"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3373"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3373"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}