{"id":3397,"date":"2016-02-21T07:44:43","date_gmt":"2016-02-21T02:14:43","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3397"},"modified":"2016-02-14T08:25:59","modified_gmt":"2016-02-14T02:55:59","slug":"how-to-save-tax-on-sale-of-a-house","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","title":{"rendered":"How to Save Tax on Sale of a House"},"content":{"rendered":"<p>You made a killing recently on a house that you had purchased 15 years ago.  You had bought this house for Rs 7 lacs. Recently, you sold the same house for Rs 1.5 crores. Net absolute gain of Rs 1.43 crores. You are aware of the indexation benefit on sale of a long term capital asset. However, even after applying indexation, you are making a capital gain of Rs 1.2 crores. That means a tax liability of Rs 24 lacs. Who wants to pay so much tax? For most of us, this amount is more than the annual income.<\/p>\n<p>You feel like the Government is robbing you. What do you do? Is there a way in which you could avoid paying this hefty tax bill?<\/p>\n<p>Yes, there are a few ways. I will discuss certain provisions in the Income Tax law where you can seek relief. Before jumping to those provisions, let’s first discuss the taxation of capital gains arising out of sale of a residential house.<\/p>\n<h3>Capital Gains and Taxation<\/h3>\n<p>If you sell the house within 3 years of purchase, the resulting capital gain is treated as short term capital gains. Such short term capital gain is taxed at your marginal income tax rate (as per income tax slab). There is no way to save tax on short term capital gain on sale of a residential house.<\/p>\n<p>If you sell the house after 3 years of purchase, the resulting capital gain is <a href=\"http:\/\/www.personalfinanceplan.in\/financial-planning\/capital-gains-tax-simplified-part-ii\/\">long term capital gain<\/a>. Such capital gain is taxed at 20%. However, indexed cost of acquisition (purchase) is considered while arriving at capital gains amount.<\/p>\n<h3>Is There a Way to Avoid Tax on Capital Gains on Sale of Residential House?<\/h3>\n<p><b>There is no way to save tax on short term capital gains arising out of sale of residential property. <\/b><\/p>\n<p>However, as far as long term capital gains are concerned, there are certain provisions under the Income Tax Act that can provide relief.<\/p>\n<ol>\n<li><b>Under Section 54<\/b>: You can use capital gains to purchase or construct a new residential house.<\/li>\n<li><b>Under Section 54 EC<\/b>: Invest in capital gains bonds by NHAI (National Highway Authority of India) and REC (Rural Electrification Corporation).<\/li>\n<\/ol>\n<p>Well, nothing comes without caveats and provisions of Section 54 and 54EC are no different. In the subsequent sections, I will discuss various sub-conditions in detail.<\/p>\n<h3>Section 54 (Purchase or Construction of a Residential House within Specified Timelines)<\/h3>\n<p>To avoid paying capital gains tax, you can<\/p>\n<ol>\n<li>Purchase a residential house within a period of 1 year before or 2 years after the sale of such house, or<\/li>\n<li>Construct a residential house within a period of 3 years from the date of sale of such house.<\/li>\n<\/ol>\n<p>Please note that you need to reinvest only the <b>Capital gains (and not the entire sales proceed)<\/b> for relief under Section 54. For instance, if you sold the house for Rs 50 lacs and the long term capital gain was Rs 15 lacs. You need to purchase or construct house for only Rs 15 lacs to avoid tax liability. You can, of course, spend more (and still save taxes) but to save tax, you need to spend just Rs 15 lacs.<\/p>\n<p><i>On the other hand, if the cost of new house is less than capital gains, you will have to pay tax on the difference.<\/i> For instance, if the long term capital gain on the transaction was Rs 50 lacs and you purchase a new house for Rs 35 lacs, you will have to pay tax on Rs 15 lacs. 20% of Rs 15 lacs is Rs 3 lacs.<\/p>\n<p><b>Note that relief under Section 54 of the Income Tax is available to only long term capital gains arising out of sale of residential property.<\/b>  <b>No such relief is available to short term capital gains on sale of residential property. You can avail relief under Section 54 for any number of residential properties sold during the financial year.<\/b><\/p>\n<h3>Are There Any Conditions to Be Met for Relief under Section 54?<\/h3>\n<p>Yes, there are a few conditions to be met.<\/p>\n<ul>\n<li>The relief is available only for long term capital gains on sale of a residential house.<\/li>\n<li>You cannot use long capital gains to purchase a commercial property. The relief is only for purchase\/construction of residential property.<\/li>\n<li><b>You can use the capital gains to purchase or construct just one residential house.<\/b> For instance, if your long term capital gain on sale transaction is Rs 50 lacs, you cannot purchase two houses for Rs 35 lacs and Rs 15 lacs each. If you do, the relief under Section 54 shall be limited to Rs 35 lacs only and you have to pay tax on Rs 15 lacs. Even if you purchase two properties for Rs 40 lacs each, the relief will be limited to Rs 40 lacs only. So even though you have spent Rs 80 lacs for capital gain of Rs 40 lacs, the relief is still limited to Rs 40 lacs.<\/li>\n<li><b>The new residential house must be located in India.<\/b> There is no exemption if you purchase\/construct a house outside India.<\/li>\n<\/ul>\n<h3>Capital Gains Account Scheme (for Relief under Section 54)<\/h3>\n<p>Though there is time of two years (for purchase) and three years (for construction), it does not exactly work that way. Income Tax Department can never be sure of your intentions. Hence, they want some proof of your motives before you file returns for the financial year in which the sale was made. Therefore, if you cannot purchase\/construct a house before filing returns for the financial year, you must deposit the un-utilized capital gains in Capital Gains Deposit Account Scheme before filing income tax return (or due date of filing income tax return, whichever is earlier). Withdrawals from the scheme can only be made for purchase\/construction of house.<\/p>\n<p>For instance, if you sold the property in December 2015 and made long term capital gain of Rs 50 lacs, you must either purchase\/construct property before the date of filing income tax return. If you have not done so, put the un-utilized gains in Capital Gains Account Scheme. Please understand you must file income returns before the due date of filing returns. Typically, the due date is July 31.<\/p>\n<p>You can open such account in 28 Public Sector Banks. You will have to submit proof of deposit in Capital Gains Account while filing income tax return to seek relief under Section 54.  Interest earned on such account is taxable.<\/p>\n<h3>Can the Tax Benefit under Section 54 Be Reversed?<\/h3>\n<ul>\n<li>If you do not utilize the capital gains for construction or purchase of new house within specified timelines, the tax benefit under Section 54 shall be reversed. For instance, you may have deposited the capital gains amount in Capital Gains Account Scheme but did not utilize the amount for constructing or purchasing a house, the tax benefit shall be reversed. You will have to pay tax in the year such deadline expires.<\/li>\n<li>You had claimed while filing returns that you had deposited the entire capital gain in Capital Gains Account Scheme. However, you utilized the capital gains amount only partially. For the remaining unutilized amount, pay the long term capital gains tax at 20% in the year of expiry of deadline.<\/li>\n<li>If you sell the new house (constructed or purchased) within 3 years of purchase or completion on construction, the tax benefit under Section 54 shall be reversed. Suppose you sold a house on July 31, 2014 and made long term capital gain of Rs 50 lacs. You purchased a new house for Rs 80 lacs on December 31, 2014. You availed tax benefit of Rs 50 lacs during the year. However, you sold the new house for Rs 1 crore in November, 2015.  Since you have sold the new house within 3 years, the benefit under Section 54 will be reversed. In such a case, you will have to pay <b>short term capital gains tax on Rs 70 lacs <\/b>(Rs 1 crore – Rs 80 lacs + Rs 50 lacs).<\/li>\n<\/ul>\n<h4>Illustration<\/h4>\n<p>Let’s combine all the elements discussed above and consider an example.<\/p>\n<p><b>You sold a residential house on January 31, 2015 and made long term capital gain of Rs 50 lacs.<\/b><\/p>\n<p>For relief under Section 54, you must either purchase a house on or before January 30, 2017. Alternatively, you can construct a residential house on or before January 30, 2018.<\/p>\n<p>The due date of filing return for FY2015 is July 31, 2015 (assumed).  You must either purchase or construct a new house before July 31, 2015 (or the date you file your Income tax return). If you cannot do that, put the un-utilized capital gains in Capital Gains Account Scheme before filing return (or due date of filing return, whichever is earlier).<\/p>\n<p><i>As I understand, the restriction of filing return on time is only when you have to deposit un-utilized gains in Capital Gains Account Scheme. If you have utilized the entire long term capital gains for constructing or purchasing a residential house, there is no such restriction. So, if you purchased or constructed a house by say December 15, 2015, you can file return on December 20, 2015 and still claim benefit under Section 54.<\/i><\/p>\n<p><b>Suppose you deposited the entire capital gain of Rs 50 lacs in Capital Gains Account on June 30, 2015.<\/b><\/p>\n<ol>\n<li><b>Case I (Partial Utilization of Capital Gains) — <\/b>You purchase a house for only Rs 40 lacs in December, 2016. Since you have utilized only Rs 40 lacs, you must pay long term capital gains tax on unutilized gain of Rs 10 lacs. <b>You will pay this tax while filing return for FY2017.<\/b><\/li>\n<li><b>Case II (Sale of new house within three years) — <\/b>Let’s further assume you sell this new property (as discussed in case I) in December 2018 for Rs 80 lacs. You have sold the property within 3 years of purchase of new property. Hence, the tax benefit under Section 54 will be reversed. <b>Short term capital gains for FY2019 will be (Rs 80 lacs – Rs 40 lacs) + Rs 40 lacs (reversal of tax benefit) = Rs 80 lacs<\/b><\/li>\n<li><b>Case III (Non-utilization of Capital Gains) — <\/b>You do not utilize the funds in Capital Gains Account at all. You had time till January 30, 2017 for purchase of house or January 30, 2018 for construction of house. <b>You will have to pay long Term capital gains tax on Rs 50 lacs while filing return for FY2019.<\/b><\/li>\n<\/ol>\n<h3>Section 54 EC (Purchase of Capital Gains Bonds from NHAI or REC)<\/h3>\n<p>If you do not want to purchase a new residential  house and still want to avoid paying long term capital gains tax, you can invest in <b>Capital Gains bonds from NHAI or REC within six months of date of sale of old residential house.<\/b><\/p>\n<p>At present, the interest rate of offer for these bonds is 6% p.a. The interest on these bonds is taxable. These bonds mature in three years. You can find more information about these bonds from respective websites of NHAI and REC.<\/p>\n<ul>\n<li>You can avail relief under Section 54EC only for long term capital gains.<\/li>\n<li>Though unrelated to the topic under discussion, you can seek relief under Section 54EC for long term capital gain on any asset (and not just residential house). You can even avail tax relief by investing long term capital gains from sale of gold, debt, commercial real estate etc. Do note under Section 54, you can seek relief only for capital gain on sale of residential property.<\/li>\n<li><b>You cannot invest more than Rs 50 lacs in these bonds in a single financial year. Thus, benefit under the scheme is limited to Rs 50 lacs per financial year.<\/b><\/li>\n<li><b>Another point to note is that for residential house (or houses) sold in any financial year, the maximum relief under Section 54EC should be Rs 50 lacs.<\/b> For instance, you sell a house a December 2015 and make LTCG of Rs 1 crore. Technically, you can invest Rs 50 lacs in March 2016 and Rs 50 lacs in April 2016.  Both the investments have been made within six months of sale of property and you have kept within Rs 50 lacs of investment limit. This way, you can get relief of Rs 1 crore. <b>However, this is not allowed.<\/b><\/li>\n<li>As per Income Tax Act, the tax relief under Section 54EC for any asset (residential property in this case) is limited to Rs 50 lacs in the financial year of sale and the subsequent financial year. <b>Hence, for the house sold in December 2015, the maximum relief under Section 54EC is Rs 50 lacs. <\/b>This is to prevent people from splitting capital gains across two financial years and get double tax relief.<\/li>\n<li>To put it other way, the investment cap of Rs 50 lac is for all the long term capital gains made in a particular financial year. So, even if you sold 5 houses in FY2016, the combined investment cap for all the houses sold in FY2016 is Rs 50 lacs.<\/li>\n<\/ul>\n<h3>Can Benefit under Section 54EC Be Reversed?<\/h3>\n<p>Yes, that can happen if you sell these bonds within 3 years from the date of purchase of these bonds. Tax benefits will be reversed if you take a loan against these bonds or monetize these bonds in any way within 3 years.<\/p>\n<h3>Can I Avail Benefit under Both Section 54 and Section 54EC?<\/h3>\n<p>Suppose you make LTCG of Rs 50 lacs on sale of a property. You purchase new house for Rs 35 lacs and invest remaining Rs 15 lacs in NHAI capital gains bonds. Is this allowed?<\/p>\n<p>This is tricky. As I understand, the benefit under Section 54 is restrictive. So, if you have availed benefit under Section 54, you cannot seek relief for the same asset (house) under Section 54EC.  So, you cannot avail benefit under both Section 54 and Section 54EC for LTCG arising out of sale of residential house<\/p>\n<p>However, if you have sold 2 residential houses in the same financial year, you can claim benefit under Section 54 for LTCG for first house and under Section 54EC for the second house.<\/p>\n<p>Moreover, as I understand, if you have sold two houses, you can combine LTCG from sale of two properties and purchase\/construct a single residential house to avail benefit under Section 54.<\/p>\n<h3>Conclusion<\/h3>\n<p>There are enough provisions in tax laws to allow you to save income tax on long term capital gains arising out of sale of residential house.  However, you need to be aware of the pre-conditions to avoid any negative surprises.<\/p>\n<blockquote><p>Disclaimer: I am not a tax expert. You are advised to seek services of tax consultant for your particular situation.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>You made a killing recently on a house that you had purchased 15 years ago.  You had bought this house for Rs 7 lacs. Recently, you sold the same house for Rs 1.5 crores. Net absolute gain of Rs 1.43 crores. You are aware of the indexation benefit on sale of a long term capital&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[97,134,133,135,30],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Save Tax on Sale of a House - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Save Tax on Sale of a House - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"You made a killing recently on a house that you had purchased 15 years ago.  You had bought this house for Rs 7 lacs. Recently, you sold the same house for Rs 1.5 crores. Net absolute gain of Rs 1.43 crores. You are aware of the indexation benefit on sale of a long term capital&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2016-02-21T02:14:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-14T02:55:59+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\",\"url\":\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\",\"name\":\"How to Save Tax on Sale of a House - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2016-02-21T02:14:43+00:00\",\"dateModified\":\"2016-02-14T02:55:59+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Save Tax on Sale of a House\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Save Tax on Sale of a House - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","og_locale":"en_US","og_type":"article","og_title":"How to Save Tax on Sale of a House - EMI Calculator","og_description":"You made a killing recently on a house that you had purchased 15 years ago.  You had bought this house for Rs 7 lacs. Recently, you sold the same house for Rs 1.5 crores. Net absolute gain of Rs 1.43 crores. You are aware of the indexation benefit on sale of a long term capital&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","og_site_name":"EMI Calculator","article_published_time":"2016-02-21T02:14:43+00:00","article_modified_time":"2016-02-14T02:55:59+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","url":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/","name":"How to Save Tax on Sale of a House - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2016-02-21T02:14:43+00:00","dateModified":"2016-02-14T02:55:59+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/how-to-save-tax-on-sale-of-a-house\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"How to Save Tax on Sale of a House"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-SN","jetpack-related-posts":[{"id":7087,"url":"https:\/\/emicalculator.net\/union-budget-2023-highlights-of-an-action-packed-budget\/","url_meta":{"origin":3397,"position":0},"title":"Union Budget 2023: Highlights of an Action Packed Budget","date":"February 1, 2023","format":false,"excerpt":"The Finance Minister presented the Union Budget 2023 today. In the past, taxpayers have had big expectations from the Union Budgets but the budget announcement turned out to be a damp squib. Yes, there are always policy changes but not many seem to affect the salaried class directly. The Union…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"remittance rates","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/remittance-rates.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":4895,"url":"https:\/\/emicalculator.net\/budget-july-2019-salient-points\/","url_meta":{"origin":3397,"position":1},"title":"Budget (July) 2019 — Salient Points","date":"July 5, 2019","format":false,"excerpt":"The Finance Minister, Nirmala Sitharaman, presented the final budget for the FY2019-2020 on July 5, 2019. The Interim Budget was present in February this year.  The new budget retains the relief offered to the taxpayers and adds a few tax incentives for the taxpayers. At the same time, there will…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":5817,"url":"https:\/\/emicalculator.net\/budget-2021-highlights\/","url_meta":{"origin":3397,"position":2},"title":"Budget 2021 Highlights","date":"February 1, 2021","format":false,"excerpt":"The Finance Minister presented the Union Budget 2021 on February 1, 2021. Here are the key highlights. Tax Slabs Remain Unchanged No changes have been made to the existing income tax slabs. Interest on EPF Becomes Taxable If you contribute more than Rs 2.5 lacs to your EPF account every…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3792,"url":"https:\/\/emicalculator.net\/budget-2017-salient-points\/","url_meta":{"origin":3397,"position":3},"title":"Budget 2017 — Salient Points","date":"February 3, 2017","format":false,"excerpt":"This year’s Union Budget is a mixed bag for salaried class and the real estate investors. Here is a look at key budget announcements. Reduction in tax rate from 10% to 5% for income tax slab of Rs 2.5 lacs to Rs 5 lacs (Positive) Introduction of Surcharge of 10%…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":5227,"url":"https:\/\/emicalculator.net\/budget-2020-highlights\/","url_meta":{"origin":3397,"position":4},"title":"Budget 2020 Highlights","date":"February 2, 2020","format":false,"excerpt":"The Finance Minister, Nirmala Sitharaman, presented the Union Budget 2020 in the parliament yesterday. In this post, let’s look at the highlights of the Budget proposal. We will look at the proposals from personal taxation perspective only. #1 Restructuring of Income Tax Slabs, Lowering of Personal Tax Rates and a…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/nirmala-sitharaman.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3703,"url":"https:\/\/emicalculator.net\/tax-matters-when-you-are-selling-the-property\/","url_meta":{"origin":3397,"position":5},"title":"Tax Matters When You Are Selling the Property","date":"November 29, 2016","format":false,"excerpt":"If you have purchased a residential property as an investment, you must be on a lookout to exit your investment with heavy capital gains. Finding a buyer at a price that you are willing to sell at may be a difficult task these days. However, amidst this concern about finding the…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3397"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3397"}],"version-history":[{"count":3,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3397\/revisions"}],"predecessor-version":[{"id":3406,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3397\/revisions\/3406"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3397"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3397"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3397"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}