{"id":3477,"date":"2016-03-17T07:55:31","date_gmt":"2016-03-17T02:25:31","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3477"},"modified":"2016-03-09T08:23:25","modified_gmt":"2016-03-09T02:53:25","slug":"reverse-mortgage-loan","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/","title":{"rendered":"Reverse Mortgage Loan"},"content":{"rendered":"<p>When you retire, the routine of a hefty salary credit to your bank account at the beginning of every month comes to an abrupt end. You have purchased a pension plan but that pension is merely a fraction of your last salary. Inflation seems a much bigger demon now. The ability to recover from unplanned expenses or medical emergencies is much lower. There is a never-ending cash flow pressure.<\/p>\n<p>Amidst all this, you can still thank yourself that you had purchased a house many years ago. At least, you don’t have to worry about rent. If your house is big enough, then you can rent out a few rooms or a floor and ease some cash flow pressure. Notice the big “If”.<\/p>\n<p>Do you know you can monetize your house without renting it out to someone? You can do that through a reverse mortgage loan. Not everyone likes this scheme, but it is an option you can explore.<\/p>\n<h3>How Reverse Mortgage Loans Work?<\/h3>\n<ol>\n<li>You mortgage your house to a bank\/financial institution.<\/li>\n<li>In return, bank makes you periodic payments for a fixed number of years.<\/li>\n<li>You and your spouse can continue to stay in the house till either of you is alive.<\/li>\n<li>You do not have to pay anything to the bank during your lifetime.<\/li>\n<li>After your (and your spouse’s) demise, the bank can sell the home to settle the loan.<\/li>\n<li>Reverse Mortgage Loans have no-recourse guarantee i.e. the lender cannot force you to make any payment or ask for additional security.<\/li>\n<li>You can repay the loan whenever you want to and take back full control of the house. This is your discretion.<\/li>\n<li>After your demise (demise of both you and your spouse), your legal heirs have the first right to settle the loan with the bank and take back ownership of the house.<\/li>\n<\/ol>\n<h3>Who Can Take Reverse Mortgage Loan?<\/h3>\n<ul>\n<li>You have to be over 60 years of age to be eligible to avail <a href=\"https:\/\/emicalculator.net\/understanding-reverse-mortgages\">Reverse Mortgage Loan<\/a> Facility. You can also apply along with your spouse. At least one of you should be above 60 and the other should be at least 55. Respective financial institutions may have even stringent policies.<\/li>\n<li>You must be the owner of the mortgaged property. The property should be free of any encumbrances.<\/li>\n<li>The residual life of the property should be at least 20 years.<\/li>\n<li><b>The property must be a self-occupied property.<\/b> You must be using the property as your permanent primary residence. The lender may look at multiple factors such as general correspondence, utility bills, taxes and bank account statements to establish if the property is indeed your permanent residence.<\/li>\n<li>You cannot avail the facility for a let-out property.<\/li>\n<li>You cannot avail RML facility against a commercial property.<\/li>\n<\/ul>\n<h3>Your Income Is Not Considered during Loan Sanction<\/h3>\n<p>This is in sharp contrast to any other kind of loan, where your repayment ability is the primary criterion. However, in reverse mortgage loans, the borrowers are not required to pay anything back to the bank during their lifetime. Hence, there is no point in considering the repayment ability of the borrower. <b>What matters is the market value (or assessed value) of your residential property. This is because the bank relies on sale of such property to get back its investment (loan).<\/b><\/p>\n<h3>How Much Amount Do I Get under Reverse Mortgage Loan Facility?<\/h3>\n<p><b>The amount of loan depends on the value of the property, age of the borrower and the prevailing interest rate. <\/b>While offering such loans, the banks typically keep a margin. The margin could be 10%, 20% or any other number depending upon lender’s policy.<\/p>\n<p>For instance, if the value of your house is Rs 1 crore and lender keeps a margin of 20%, you can get a loan equivalent of Rs 80 lacs. Now, that does not mean the bank will give you Rs 80 lacs. The bank will give an amount per month that, by the time payment period ends, will become Rs 80 lacs.<\/p>\n<p>So, if you take a reverse mortgage loan for 20 years and the prevailing rate is 12.0%, the bank will pay you Rs 8,000 per month. Rs 8,000 per month for 20 years adds up to Rs 19.2 lacs. This is nowhere close to Rs 80 lacs that we were talking about.<\/p>\n<p>Why Rs 8,000 and no other number? Simple. If you invest Rs 8,000 per month in an instrument that returns 12.0% for 20 years, you will have Rs 80 lacs at the end of 20 years.  Now, you know where this number came from.<\/p>\n<p>If you had opted for a loan of 10 years for the same property, you would have received Rs 34,560 per month for 10 years. Rs 34,560 per month for 10 years at 12.0% gives Rs 80 lacs at the end of 10 years. No surprises here too.<\/p>\n<p>Many banks offer Reverse Mortgage Loan Facility. Here’s the installment table available for<a href=\"https:\/\/www.pnbindia.in\/En\/ui\/ReverseMortgageScheme.aspx\"> <b>PNB Baghban Reverse Mortgage Loan Scheme<\/b><\/a>.<\/p>\n<p>Punjab National Bank offers the scheme at Base Rate+2.5%. At prevailing base rate of 9.6%, the applicable interest rate becomes Rs 12.1%. The following table contains monthly installment per lac of Rupees at <b>12.0% <\/b>(and not 12.1%) per annum for different loan tenor.<\/p>\n<table>\n<tbody>\n<tr>\n<td style=\"text-align: right;\"><b>Tenor (yrs)<\/b><\/td>\n<td style=\"text-align: right;\"><b>10<\/b><\/td>\n<td style=\"text-align: right;\"><b>11<\/b><\/td>\n<td style=\"text-align: right;\"><b>12<\/b><\/td>\n<td style=\"text-align: right;\"><b>13<\/b><\/td>\n<td style=\"text-align: right;\"><b>14<\/b><\/td>\n<td style=\"text-align: right;\"><b>15<\/b><\/td>\n<td style=\"text-align: right;\"><b>16<\/b><\/td>\n<td style=\"text-align: right;\"><b>17<\/b><\/td>\n<td style=\"text-align: right;\"><b>18<\/b><\/td>\n<td style=\"text-align: right;\"><b>19<\/b><\/td>\n<td style=\"text-align: right;\"><b>20<\/b><\/td>\n<\/tr>\n<tr>\n<td style=\"text-align: right;\">Monthly Installment (Rs.)<\/td>\n<td style=\"text-align: right;\">432<\/td>\n<td style=\"text-align: right;\">365<\/td>\n<td style=\"text-align: right;\">311<\/td>\n<td style=\"text-align: right;\">267<\/td>\n<td style=\"text-align: right;\">229<\/td>\n<td style=\"text-align: right;\">198<\/td>\n<td style=\"text-align: right;\">172<\/td>\n<td style=\"text-align: right;\">150<\/td>\n<td style=\"text-align: right;\">130<\/td>\n<td style=\"text-align: right;\">114<\/td>\n<td style=\"text-align: right;\">100<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>For 20 years, Rs 80 lacs (Rs 1 crores – 20% margin) translates to 80X100=8,000 per month.<\/p>\n<p>Interest rate is important. If the interest rate is 11% (and not 12%), the monthly payment will be Rs 9,157 per month for 20 years. For 10 year loan, the monthly payment will be Rs 36,531.<\/p>\n<p><b>Lower the interest rate, higher the monthly payout. Lower the loan tenor, higher the monthly payout.<\/b><\/p>\n<h3>How Will I Receive Payment under Reverse Mortgage Schemes?<\/h3>\n<p>You can receive periodic payments (monthly, quarterly, half-yearly or annual) depending upon the agreement between you and the lender. The maximum is Rs 50,000 per month.<\/p>\n<p>Alternatively, you can also choose to receive lump sum payment. However, there are a few restrictions on lump sum receipts. You can receive only up to 50% of the eligible loan amount subject to a cap of Rs 15 lacs. Moreover, the lump sum amount can be withdrawn only for medical treatment of self, spouse and dependants. You can withdraw the balance amount in periodic payments.<\/p>\n<p>You can also have a committed line of credit with the bank and withdraw as and when you want.<\/p>\n<p>You may not get all the options under every reverse mortgage plan.<\/p>\n<h3>What Is the Tenor of Reverse Mortgage Loans?<\/h3>\n<p><b>The maximum tenor of Reverse Mortgage Loans is 20 years. <\/b>This means that the lender will make monthly payment only up to a maximum of 20 years. You don’t have to repay the loan at the end of 20 years. You can continue to live in the house for the entire lifetime.<\/p>\n<h3>How Do I Repay Such Loan?<\/h3>\n<p><b>There is no compulsion to repay the loan.<\/b> After you are gone, the bank will sell the house to recover money. However, if you or your heirs want, you can take back the house from the bank.<\/p>\n<ul>\n<li>You can repay the loan yourself anytime. However, since you opted for facility in the first year, the chances of this happening are quite low.<\/li>\n<li>Your legal heirs can repay the loan after your demise and take back the house.<\/li>\n<li>The lender cannot sell the property if you or your legal heirs are willing to settle the loan. Hence, lender’s discretion is limited.<\/li>\n<\/ul>\n<h3>Tax Treatment of Payment Received from the Lender under Reverse Mortgage Scheme<\/h3>\n<p>Such payments received from the lender are exempt from tax under Section 10(43) of the Income Tax Act. After all, it is a loan, not your income.<\/p>\n<h3>The Lender Has Some Rights<\/h3>\n<p>And it is justified too. The only recourse that the lender has is your property. So, it is entirely correct if it tries to ensure that the property is being properly maintained.<\/p>\n<ul>\n<li>The bank may make property insurance mandatory. In fact, it can deduct the payment from your monthly payouts.<\/li>\n<li>The bank may require you to submit proofs of payment for utility bills and municipal charges.<\/li>\n<li>The bank can inspect your residential property on a periodic basis.<\/li>\n<li>If you are not paying taxes and other statutory charges or are not maintaining the property well, the bank can foreclose the loan. So, either you repay the loan or the bank will sell the property to recover its money.<\/li>\n<li>There are a few other conditions of default defined under Clause 18 of<a href=\"http:\/\/nhb.org.in\/RML\/guidelines.php\"> Reverse Mortgage Loan guidelines<\/a> by National Housing Bank.  If the event of default happens, the bank can foreclose the loan.  You are advised to go through terms and conditions of the loan agreement properly.<\/li>\n<\/ul>\n<h3>What Are the Issues?<\/h3>\n<p>The bank pays you money.  You don’t have to pay it back in your lifetime. It looks like a really sweet deal. Are there any issues? Yes, plenty of them.<\/p>\n<ol>\n<li><b>Most of us have emotional attachment to our houses<\/b>. Even though the house can be sold only after borrower’s demise, many of us will struggle with the feeling that we won’t be able to bequeath the house to the next generation if we opt for reverse mortgage scheme.<\/li>\n<li><b>The maximum tenor of payments is only 20 years.<\/b> What do you do after that?<\/li>\n<li><b>The yield is too low<\/b>. For a house that has a market value of Rs 1 crore, you will get Rs 8,000 per month for 20 years. That makes Rs 96,000 per annum.  For Rs 96,000 per annum, the bank will take away your house after your demise. Hence, the annual yield is 0.96%. A number of people won’t be content with that. There are many other options worth exploring.<\/li>\n<\/ol>\n<p>You could sell your house and find a smaller place in the same city or a similar place in smaller city. For instance, if you sell your house for Rs 1 crore in Mumbai and purchase another house for Rs 50 lacs in Pune, you will still have Rs 50 lacs left with you (ignoring capital gains taxes). If you make a FD of Rs 50,00,000 at 8%, you will get Rs 33,333 per month. And the new house and principal amount of Rs 50 lacs is still yours.<\/p>\n<p>Let’s contrast the two choices. Under RML option, you get Rs 8,000 per month for 20 years and your family does not get the house after your demise. Under the second option, you get Rs 33,333 per month (for life, if the interest rate remains constant at 8% p.a.) and you still own a house and principal of Rs 50 lacs. Second option looks much better. However, under the second option, you have to make an emotionally difficult decision to sell your old house.<\/p>\n<h3>Conclusion<\/h3>\n<p>Reverse Mortgage Schemes do offer an alternative to senior citizens to earn regular income by mortgaging their house to the banks. This option won’t be the top choice of many but sometimes your hand is forced.<\/p>\n<p>The yields are low and the payment is for a limited tenor. However, you can’t really blame the bank. The bank is taking considerable risk. You borrow from bank when you are 60. The bank pays you till you are 80.  You go on to live till the age of 100. The bank has not seen a single penny from you for 40 years. All it has is your house. So, the bank is taking a significant longevity risk.<\/p>\n<p>If you face cash flow pressure during retirement and do not want to part with your house during your lifetime, then you can think about Reverse Mortgage Loans.<\/p>\n<p>However, if you can make the emotionally difficult decision of selling the old house and shifting to a new one, then you have other options too.<\/p>\n<h3>Additional Read<\/h3>\n<ol>\n<li><i><\/i>       <i>Guidelines on Reverse Mortgage Loans on<\/i><a href=\"http:\/\/nhb.org.in\/RML\/guidelines.php\"> <b><i>National Housing Board’s website<\/i><\/b><\/a><\/li>\n<li><i><\/i>       <i>Notification on<\/i><a href=\"http:\/\/nhb.org.in\/RML\/notifications.php\"> <b><i>Reverse Mortgage Scheme, 2008<\/i><\/b><\/a><i> by Central Board of Direct Taxes.<\/i><\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>When you retire, the routine of a hefty salary credit to your bank account at the beginning of every month comes to an abrupt end. You have purchased a pension plan but that pension is merely a fraction of your last salary. Inflation seems a much bigger demon now. The ability to recover from unplanned&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[134,5,8,128,78,129,135,79],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Reverse Mortgage Loan - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Reverse Mortgage Loan - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"When you retire, the routine of a hefty salary credit to your bank account at the beginning of every month comes to an abrupt end. You have purchased a pension plan but that pension is merely a fraction of your last salary. Inflation seems a much bigger demon now. The ability to recover from unplanned&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2016-03-17T02:25:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-03-09T02:53:25+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\",\"url\":\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\",\"name\":\"Reverse Mortgage Loan - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2016-03-17T02:25:31+00:00\",\"dateModified\":\"2016-03-09T02:53:25+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/reverse-mortgage-loan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Reverse Mortgage Loan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Reverse Mortgage Loan - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/","og_locale":"en_US","og_type":"article","og_title":"Reverse Mortgage Loan - EMI Calculator","og_description":"When you retire, the routine of a hefty salary credit to your bank account at the beginning of every month comes to an abrupt end. You have purchased a pension plan but that pension is merely a fraction of your last salary. Inflation seems a much bigger demon now. The ability to recover from unplanned&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/","og_site_name":"EMI Calculator","article_published_time":"2016-03-17T02:25:31+00:00","article_modified_time":"2016-03-09T02:53:25+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/","url":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/","name":"Reverse Mortgage Loan - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2016-03-17T02:25:31+00:00","dateModified":"2016-03-09T02:53:25+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/reverse-mortgage-loan\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/reverse-mortgage-loan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Reverse Mortgage Loan"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-U5","jetpack-related-posts":[{"id":4488,"url":"https:\/\/emicalculator.net\/should-you-opt-for-a-reverse-mortgage-loan\/","url_meta":{"origin":3477,"position":0},"title":"Should You Opt for a Reverse Mortgage Loan?","date":"November 14, 2018","format":false,"excerpt":"A Reverse Mortgage Loan (RML) can provide a useful income stream for senior citizens during their retirement. You can monetize your residential property and generate income while continuing to retain the ownership so long as you are alive. I have discussed Reverse Mortgage loans in detail in another post. In…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2806,"url":"https:\/\/emicalculator.net\/understanding-reverse-mortgages\/","url_meta":{"origin":3477,"position":1},"title":"Understanding Reverse Mortgages","date":"November 4, 2014","format":false,"excerpt":"Once a person has crossed his (her) earning years, but has not planned for the retirement years, or financial planning has gone awry due to heavy unforeseen expenses\/losses, or inflation has taken away the purchasing power of savings etc., what does he (she) do to live the remaining years on…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3610,"url":"https:\/\/emicalculator.net\/ways-to-generate-regular-income-during-retirement\/","url_meta":{"origin":3477,"position":2},"title":"Ways to Generate Regular Income During Retirement","date":"August 28, 2016","format":false,"excerpt":"As you start your retirement, you will need to replace your salary with another source of regular income. If you have been part of a defined benefit pension scheme or have been investing in a pension plan during your working years, you will not feel as much pinch. Those who have…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6501,"url":"https:\/\/emicalculator.net\/piramal-gruh-setu-home-loan-longer-tenure-and-higher-eligibility\/","url_meta":{"origin":3477,"position":3},"title":"Piramal Gruh Setu Home Loan: Longer Tenure and Higher Eligibility","date":"March 25, 2022","format":false,"excerpt":"It is not easy to get a home loan. You must have the right job\/profession, age, income, and creditworthiness to get a home loan. Many times, the lender is willing to offer you the loan but not the quantum you desire. And don’t pin the blame on lenders. The lenders…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7162,"url":"https:\/\/emicalculator.net\/move-over-buy-now-pay-later-here-comes-rent-now-pay-later\/","url_meta":{"origin":3477,"position":4},"title":"Move over &#8216;Buy Now, Pay Later&#8217;. Here Comes &#8216;Rent Now, Pay Later&#8217;","date":"April 6, 2023","format":false,"excerpt":"We know about 'Buy Now, Pay Later' (BNPL). We know about platforms that allow us to pay rent using a credit card. If we combine these two products, a resulting permutation could be 'Rent Now, Pay Later' (RNPL). Transfer Rent on credit. And credit comes through a loan and not…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4433,"url":"https:\/\/emicalculator.net\/sbi-home-loan-for-non-salaried-differential-offerings\/","url_meta":{"origin":3477,"position":5},"title":"SBI Home Loan for Non-Salaried — Differential Offerings","date":"October 1, 2018","format":false,"excerpt":"It is easier to get a loan if you are a salaried employee. Not so much if you are self-employed, proprietor or a professional. If you were not salaried when you applied for a home loan, you would know. By the way, most bank offer loans to non-salaried under the…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"SBI Home Loan for Non-Salaried â\u0080\u0094 Differential Offerings Interest Rates","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/SBI-Home-Loan-for-Non-Salaried-â\u0080\u0094-Differential-Offerings.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3477"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3477"}],"version-history":[{"count":5,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3477\/revisions"}],"predecessor-version":[{"id":3483,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3477\/revisions\/3483"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3477"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3477"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3477"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}