{"id":3488,"date":"2016-03-14T07:23:28","date_gmt":"2016-03-14T01:53:28","guid":{"rendered":"https:\/\/emicalculator.net\/?p=3488"},"modified":"2021-02-02T18:29:59","modified_gmt":"2021-02-02T12:59:59","slug":"icici-bank-home-safe-plus-a-review","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","title":{"rendered":"ICICI Bank Home Safe Plus — A Review"},"content":{"rendered":"<p>When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan.<\/p>\n<p>Repayment of a home loan is a long term activity. If something were to happen to you, your family should have enough to settle the loan and own the house completely.  There are many ways to ensure this. You purchase life cover enough to settle all your outstanding liabilities and provide for life milestones.<\/p>\n<p>Alternatively, you can purchase Home Loan Protection Plans (HLPP) when you avail a home loan. With HLPPs, the insurance company settles the home loan with the bank in case of borrower’s demise. In one of my previous posts, I had discussed Home Loan Protection Plans in details and also highlighted many issues with HLPPs.<\/p>\n<p><b>Must Read:<\/b><a href=\"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\"> Home Loan Protection Plan: What bank officials won’t tell you<\/a><\/p>\n<p>In my opinion, a pure term plan is a far better option than a HLPP. In this post, I will discuss one of the plans sold by ICICI Bank for loan protection in detail. I will discuss Home Safe Plus issued by ICICI Lombard for ICICI Bank Home Loan customers. Of course, the customers can’t be forced to purchase the product. This is not a HLPP in true sense since it is not a group policy per se. But the policy is assigned in favour of the bank to give it a similar flavour.<\/p>\n<p>Home Safe Plus provides six kinds of insurance covers:<\/p>\n<ul>\n<li>Critical Illness Cover<\/li>\n<li>Accidental Death Cover<\/li>\n<li>Permanent Total Disability Cover<\/li>\n<li>Loss of Employment Cover<\/li>\n<li>Property Insurance<\/li>\n<li>Content Insurance<\/li>\n<\/ul>\n<p>The bank sells two policies as part of the Home Safe Plus product.<\/p>\n<ol>\n<li><b>ICICI Lombard Secure Mind<\/b> – Provides the first four covers i.e. Critical illness, accidental death cover, Permanent Total Disability Cover and loss of employment cover.<\/li>\n<li><b>ICICI Lombard Home Insurance<\/b>  &#8211; For property and content insurance.<\/li>\n<\/ol>\n<p>Bizarre, isn’t it? Home Safe Plus is essentially a wrap product.<\/p>\n<h3><b>Salient Features<\/b><\/h3>\n<ul>\n<li>It is a single premium product.<\/li>\n<li>You pay once and get coverage for five years.<\/li>\n<li>The bank will offer a top-up loan for purchase of this product. The repayment term of the top-up loan will be in line with the repayment term of your home loan. Though the coverage is for 5 years, you will pay EMI on top-up loan for 15 or 20 years.<\/li>\n<li>It is a level cover product (and not reducing cover product) i.e. the Sum Assured remains constant irrespective of the outstanding principal amount.<\/li>\n<li>If the insured event were to happen, the insurance company settles the loan with the bank and any excess amount will be paid to the borrower or its nominee.<\/li>\n<\/ul>\n<p>I will not go into whether it is economical to purchase Home Safe Plus or not. I will also not go in ICICI Lombard Home insurance product. It is a regular home insurance product that provides you financial protection against damage to your property and household items from natural calamities such as flood, lightning etc. The plan may also cover you for losses due to burglary. For more on Home Insurance plan, go through this<a href=\"https:\/\/emicalculator.net\/should-you-buy-home-insurance\"> post<\/a>. <b>In this post, I will focus my attention only on ICICI Lombard Secure Mind Product and whether it makes for a good loan protection cover.<\/b><\/p>\n<h3><b>ICICI Lombard Secure Mind (<\/b><a href=\"https:\/\/www.irda.gov.in\/ADMINCMS\/cms\/Uploadedfiles\/36.Secure%20Mind_Policy.pdf\"><b>Policy Wordings<\/b><\/a><b>)<\/b><\/h3>\n<p>It is a <b>critical illness plan<\/b> which provides a lump sum payout in case the policyholder gets diagnosed with a specific critical illness. Common critical illnesses are cancer, kidney failure, multiple sclerosis, heart attack etc. Critical illness plans are fixed benefit plans (and not indemnity plans) and provide a fixed benefit irrespective of medical expenses incurred. So, if you get diagnosed with a critical illness, the insurance company will settle the loan with the bank and any excess amount will be paid to the policyholder\/nominee. For more on Critical Illness plans in general, you can go through this<a href=\"http:\/\/www.personalfinanceplan.in\/insurance\/critical-illness-insurance-plan-should-you-buy\/\"> post<\/a>.<\/p>\n<p>In addition, it also provides a <b>personal accident cover<\/b>. So, this insurance plan will make a payment if the policyholder dies or gets permanently disabled (total) due to an accidental injury. The death or permanent disability should happen within 12 months of the accident. For more on personal accident plans, you can go through this<a href=\"http:\/\/www.personalfinanceplan.in\/opinion\/do-you-need-a-personal-accident-insurance-plan\/\"> post<\/a>.<\/p>\n<p>Apart from above, the plan also covers 3 EMIs of the home loan in case of <b>loss of job<\/b>. And the termination should be due to dismissal, temporary suspension or retrenchment by the employer. This cover is only applicable to salaried individuals. Voluntary resignation is excluded.<\/p>\n<p>There are many caveats as you would expect in any insurance plan. However, those are typical of Critical Illness Plans and personal accident plans. There is nothing special in this plan.<\/p>\n<p>The plan does offer some utility. In case the borrower gets diagnosed with cancer, he will have to spend huge sums on treatment. This critical illness plan will ensure that he does not have to worry about home loan EMIs anymore. In case of permanent disability due to an accident, the earning ability of the member can be compromised. Secure Mind plan will be helpful in this case too.<\/p>\n<h3><b>Points to Note<\/b><\/h3>\n<ol>\n<li>The premium paid for Secure Mind (Critical Illness Plan) is not eligible for tax benefit under Section 80C. This is because Secure Mind is not life insurance.<\/li>\n<li>Only the part of premium towards purchase of critical illness cover is eligible for tax benefit under Section 80D of the Income Tax Act. The insurance company provides you separate receipt for Section 80D tax benefit.<\/li>\n<li>There are no tax benefits for personal accident insurance covers. Hence, the premium paid for the personal accident cover is not eligible for tax benefit.<\/li>\n<li>The loan repayment term may be 10, 15 or 20 years. However, the maximum tenor for Secure Mind is only 5 years. If you need insurance beyond 5 years, you will have to purchase another plan.<\/li>\n<\/ol>\n<h3><b>Issues<\/b><\/h3>\n<ul>\n<li><b>There is no life cover. Life cover is only for accidental death and if a critical illness results in death. <\/b>I am not a medical expert but I am sure that there are ways other than accident and critical illnesses which can lead to person’s death.<\/li>\n<li>If the borrower were to die due to some other cause, there shall be no payout from the insurance company. Do go through this<a href=\"http:\/\/www.gbic.co.in\/GIC\/individualpersonalaccident\/IndividualPersonal-Book13.pdf\"> case<\/a> filed in consumer forum. Search for Home Safe Plus. You will realize the shortcomings of this product. Even the forum took cognizance of the shortcomings.<\/li>\n<li>If the borrower were to die suddenly (say, in sleep because of a heart attack), would the borrower’s family get post mortem done to establish the cause of death? The insurance companies never indulge in charity. If they can find a way not to honor the claim, they won’t.<\/li>\n<li>As per a Critical Illness insurance plan, every critical illness has a severity attached to it. Hence, it is quite possible that what may be a heart attack according to you may not be a heart attack as per insurance company.<\/li>\n<li>Definition of accident is also quite complex. An Accident is an unexpected, unforeseen and undesirable event. And the injury must be due to external, violent, visible and evident causes. So, if the borrower dies or gets disabled after slipping from stairs in his bathroom or in his home, it may not be covered. However, if the same thing happens in your office, it may be covered.<\/li>\n<\/ul>\n<p>The question I have for ICICI Bank management: <b>Why does this loan protection plan not provide life cover? It is completely beyond me. Yes, critical illness plan and personal accident cover are good add-ons. But what about plain vanilla life cover? <\/b>Does the borrower not need a life cover?  If the borrower were to die due to some other reason, who will settle the loan? Will this insipid Home Safe Plus save the family financial and mental agony?<\/p>\n<p><b>ICICI Home Safe Plus is a poor product and serves little purpose in your insurance portfolio. I don’t think ICICI Bank thought anything beyond their commissions while deciding to offer this plan to its customers. And yes, ICICI Bank gets commission from ICICI Lombard for selling these plans.<\/b><\/p>\n<h3><b>Conclusion<\/b><\/h3>\n<p><b>ICICI Bank sells loan protection without a proper life cover.<\/b> And I am not joking. I don’t think there is a way ICICI Bank can defend itself on this. It is sad that banks indulge in such tactics to earn commission.  They are not satisfied with the interest rate spread that they are earning on the loan. They want to earn hefty commission selling products that customers don’t really need.  And ICICI Bank is not the only bank indulging in such tactics. I am okay with ICICI Bank earning commissions on the sale of insurance products. Every salesperson gets commission on the products sold. ICICI Bank is no different. But they shouldn’t make mockery of customer’s trust. What will happen if the borrower were to die due to some other reason? Who will settle the loan? The insurance company won’t, for sure.<\/p>\n<p>I am not saying you don’t need financial protection against unfortunate events in life. You do. But you must purchase the right type of insurance. If you want financial protection against death, purchase a pure term cover. If you want to avoid a hit to your finances in case of a critical illness, purchase a critical illness cover. If you want to safeguard against accidental death and disability, purchase a personal accident cover.<\/p>\n<p><b>Only if Home Safe Plus (Secure Mind) had plain vanilla term life cover, it would have been an acceptable product. Unfortunately, that’s not the case. Home Safe Plus has been around for a long time. It is difficult to imagine that ICICI Bank does not realize what they are selling.  There is just one explanation: They don’t care. <\/b><\/p>\n<p><b>There is just one way to counter this brazen attitude of banks: Awareness. Be aware and make informed decisions. You don’t have to buy what banks sell. You can say No.<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan. Repayment of a home loan is a long term activity.&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[345],"tags":[120,7,117,19,104,8],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>ICICI Bank Home Safe Plus — A Review - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"ICICI Bank Home Safe Plus — A Review - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan. Repayment of a home loan is a long term activity.&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2016-03-14T01:53:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-02T12:59:59+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\",\"url\":\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\",\"name\":\"ICICI Bank Home Safe Plus — A Review - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2016-03-14T01:53:28+00:00\",\"dateModified\":\"2021-02-02T12:59:59+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"ICICI Bank Home Safe Plus — A Review\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"ICICI Bank Home Safe Plus — A Review - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","og_locale":"en_US","og_type":"article","og_title":"ICICI Bank Home Safe Plus — A Review - EMI Calculator","og_description":"When it comes to financial planning, everyone wants to leave behind an asset for their families. Nobody wants to leave behind a liability. And when it comes to your house, you want to ensure that your family inherits your house and not your home loan. Repayment of a home loan is a long term activity.&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","og_site_name":"EMI Calculator","article_published_time":"2016-03-14T01:53:28+00:00","article_modified_time":"2021-02-02T12:59:59+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","url":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/","name":"ICICI Bank Home Safe Plus — A Review - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2016-03-14T01:53:28+00:00","dateModified":"2021-02-02T12:59:59+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/icici-bank-home-safe-plus-a-review\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"ICICI Bank Home Safe Plus — A Review"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-Ug","jetpack-related-posts":[{"id":3154,"url":"https:\/\/emicalculator.net\/home-loan-protection-plan-what-bank-officials-wont-tell-you\/","url_meta":{"origin":3488,"position":0},"title":"Home Loan Protection Plan – What Bank Officials Won&#8217;t Tell You","date":"August 24, 2015","format":false,"excerpt":"You are planning to buy your dream home. You have approached various banks to get the best deal on home loan interest rates and other processing charges. After much hard work, you have finalized a bank. During a visit to the bank to complete formalities, the bank official told you…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4002,"url":"https:\/\/emicalculator.net\/pnb-gen-next-housing-finance-scheme\/","url_meta":{"origin":3488,"position":1},"title":"PNB Gen-Next Housing Finance Scheme","date":"August 31, 2017","format":false,"excerpt":"Young salaried employees are target customers for all the banks. Therefore, you can expect them to come with schemes to lure such prospects to their fold. The core idea behind such products is to offer such customers principal moratorium for a few years (since they may not be able to…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6001,"url":"https:\/\/emicalculator.net\/are-home-loan-insurance-products-failing-you\/","url_meta":{"origin":3488,"position":2},"title":"Are Home Loan Insurance Products Failing You?","date":"June 1, 2021","format":false,"excerpt":"Death in the family brings not just emotional trauma but can also bring financial agony to the family. If the deceased was the primary breadwinner, the family can struggle financially unless the deceased had bought adequate life insurance coverage. If the deceased had taken a home loan, the loan needs…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3995,"url":"https:\/\/emicalculator.net\/icici-bank-extraa-home-loan-our-review\/","url_meta":{"origin":3488,"position":3},"title":"ICICI Bank Extraa Home Loan &#8211; Our Review","date":"August 28, 2017","format":false,"excerpt":"In an earlier post, I had talked about ICICI Bank Step-up Home Loan, where the applicants could get higher loan eligibility than regular home loans due to moratorium on principal repayment for a few years. However, the limitation with Step-up loan was that the maximum age was capped at 40…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":5171,"url":"https:\/\/emicalculator.net\/icici-smart-emi-car-loan-is-it-better-than-the-traditional-car-loan\/","url_meta":{"origin":3488,"position":4},"title":"ICICI Smart EMI Car Loan — Is It Better Than the Traditional Car Loan?","date":"December 27, 2019","format":false,"excerpt":"ICICI Bank has recently launched a car loan product ”Smart EMI” in association with TranzLease (TZL), an automobile leasing company.  The loan facility is currently available for corporate and salaried customers. The Smart EMI car loan takes care of the insurance and maintenance of the car too. i.e., you do…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3871,"url":"https:\/\/emicalculator.net\/signing-up-as-loan-guarantor-beware-of-risks\/","url_meta":{"origin":3488,"position":5},"title":"Signing up as Loan Guarantor? Beware of Risks","date":"May 5, 2017","format":false,"excerpt":"Your close friend has been planning to buy a house for a long time. However, when he approached the bank to apply for a home loan, bank insisted to getting someone to sign as a guarantor for the loan. Lenders can ask for a financial guarantor if the credit history is…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3488"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=3488"}],"version-history":[{"count":5,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3488\/revisions"}],"predecessor-version":[{"id":5832,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/3488\/revisions\/5832"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=3488"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=3488"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=3488"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}