{"id":4193,"date":"2018-02-13T13:27:52","date_gmt":"2018-02-13T07:57:52","guid":{"rendered":"https:\/\/emicalculator.net\/?p=4193"},"modified":"2021-02-02T16:01:33","modified_gmt":"2021-02-02T10:31:33","slug":"mudra-loan-small-businesses","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/","title":{"rendered":"Mudra Loan for Small Businesses"},"content":{"rendered":"<p><span style=\"font-weight: 400;\"><img decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-4206 alignright\" src=\"https:\/\/emicalculator.net\/wp-content\/uploads\/mudra.png\" alt=\"Mudra\" width=\"260\" height=\"85\" \/>MUDRA stands for <strong>Micro Units Development and Refinance Agency<\/strong> Ltd. MUDRA was setup by the Union Government in FY2016 to provide funding to non-corporate, non-farm small business enterprises and entrepreneurs. <\/span><span style=\"font-weight: 400;\">The biggest problem that small businesses and entrepreneurs face is that of funding. It is a known fact that banks and financial institutions are not very keen to lend to small\/micro business. Well, banks have their reasons too. <\/span><span style=\"font-weight: 400;\">Such businessmen are unable to provide sufficient collateral (security) and this becomes a roadblock. MUDRA (or the Mudra loan scheme) seeks to remove this hurdle by providing collateral-free loans to small business and budding entrepreneurs. And the range of business activities for which you can borrow under Mudra loan scheme is seemingly endless. <\/span><b>You can get term loans or working capital loans (Cash credit and Overdraft) under Mudra loan scheme. <\/b><span style=\"font-weight: 400;\">Let’s find out more about the Mudra loan scheme.<\/span><\/p>\n<h2>What Are the Different Types of Loans under Mudra Scheme?<\/h2>\n<p><span style=\"font-weight: 400;\">There are three types of loan products under Mudra Scheme.<\/span><\/p>\n<ol>\n<li><b>Shishu Category<\/b><span style=\"font-weight: 400;\">: Loans up to Rs 50,000. Meant for those who are starting out.<\/span><\/li>\n<li><b>Kishore Category<\/b><span style=\"font-weight: 400;\">: Loans from Rs 50,000 to Rs 5 lacs. Meant for those who have started the business but have not yet established their business.<\/span><\/li>\n<li><b>Tarun Category<\/b><span style=\"font-weight: 400;\">: Loans from Rs 5 lacs to Rs 10 lacs. Meant for those who want to expand their already established businesses.<\/span><\/li>\n<\/ol>\n<p>As you can see, the maximum loan amount under the Mudra scheme is Rs 10 lacs.<\/p>\n<h2>Who Can Apply for Mudra Loan?<\/h2>\n<p><span style=\"font-weight: 400;\">The only requirement is to be a citizen of India. <\/span><span style=\"font-weight: 400;\">And yes, you can take a loan to set up a business or augment\/enhance your existing business. <\/span><span style=\"font-weight: 400;\">And you shouldn’t be a defaulter with any of the banks. <\/span>You can’t take Mudra loan for personal purposes such as purchasing a car or for higher education. <span style=\"font-weight: 400;\">However, if you are purchasing a car for taxi, auto rickshaw or a truck, you can apply for a Mudra loan. <\/span><b>The loan purpose has to be business and income generation. <\/b><span style=\"font-weight: 400;\">You are eligible for Mudra loan if you indulge in manufacturing, processing, trading and services. <\/span><span style=\"font-weight: 400;\">If you go through the list of eligible activities on Mudra website, almost everything (that is legal) under the sun is covered. <\/span><span style=\"font-weight: 400;\">Mudra loans can be extended for:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Business loan for Vendors, Traders, Shopkeepers and service providers<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Working Capital Loans through Mudra card (discussed later in this article)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Equipment Finance for micro units<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Transport Vehicle Loans (auto-rickshaws, 3 wheelers, e-rickshaw, passenger cars, taxis etc.)<\/span><\/li>\n<li>Community, Social &amp; Personal Service Activities<span style=\"font-weight: 400;\"> (Saloons, beauty parlours, gymnasium, boutiques, tailoring shops, dry cleaning, cycle and motorcycle repair shop, DTP and Photocopying Facilities, Medicine Shops, Courier Agents etc.)<\/span><\/li>\n<li>Food Products Sector<span style=\"font-weight: 400;\"> (Activities such as papad making, achaar making, jam \/ jelly making, agricultural produce preservation at rural level, sweet shops, small service food stalls and day to day catering \/ canteen services, cold chain vehicles, cold storages, ice making units, ice cream making units, biscuit, bread and bun making etc.)<\/span><\/li>\n<li>Textile Products Sector \/ Activity<span style=\"font-weight: 400;\"> (Handloom, powerloom, khadi activity, chikan work, zari and zardozi work, traditional embroidery and hand work, traditional dyeing and printing, apparel design, knitting, cotton ginning, computerized embroidery, stitching and other textile non garment products such as bags, vehicle accessories, furnishing accessories etc.)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Activities allied to agriculture (Pisciculture, bee keeping, poultry, livestock, rearing, grading, sorting, aggregation agro industries, diary, fishery, agriclinics and agribusiness centres, food &amp; agro-processing etc. excluding crop loans, land improvement such as canal, irrigation and wells and services supporting these activities)<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Please understand this is merely an illustrative list (and by no means exhaustive) provided on <a href=\"http:\/\/mudra.org.in\/\">Mudra website<\/a> to show the breadth of activities that are covered under Mudra loan scheme. <\/span><span style=\"font-weight: 400;\">Additionally, <\/span><b>individuals, sole proprietorships, partnerships, trusts, private limited company and public company or any other legal structure can borrow under Mudra loan scheme.<\/b><\/p>\n<h2>How to Apply for Mudra Loan?<\/h2>\n<p><span style=\"font-weight: 400;\">You don’t have to go to MUDRA or Mudra Bank. In fact, as on date, there is no such thing as Mudra Bank. MUDRA does not give loans to any individuals. It deals with financial institutions. <\/span><b>You have to go to your neighbourhood bank to apply for a loan under Mudra Scheme. <\/b><b>All major banks, NBFCS and MFI provide loan under the scheme. You can see <a href=\"file:\/\/\/D:\/Vasu\/Downloads\/Shortlisted_Lending_Institutions_eng.pdf\">the complete list of participating financial institutions<\/a> on<\/b> <b>MUDRA website<\/b><b>.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">You can download application forms from <\/span><a href=\"https:\/\/www.mudra.org.in\/Home\/PMMYBankersKit\">here<\/a>. You can collect forms from respective banks and financial institutions too. Shishu loans have 1-page form and a shorter document list. Kishore and Tarun loans have a common 3-page form and expectedly a longer requirement list. Do note you are not guaranteed a loan under Mudra Scheme. The bank retains its discretion in lending to you. <span style=\"font-weight: 400;\">It is just that, since the Government is promoting entrepreneurship through this scheme, it may be easier to get a loan under Mudra scheme. <\/span><b>You can apply for Mudra loan online too (discussed later in the article).<\/b><\/p>\n<h2>What Documents Are Needed for Mudra Loan?<\/h2>\n<p><span style=\"font-weight: 400;\">Well, the list is provided in the forms itself. Shishu loans have a much shorter document list. <\/span><span style=\"font-weight: 400;\">Applications for Kishore and Tarun have to be supported by extensive documentations. <\/span><span style=\"font-weight: 400;\">Copying the list from the requirements for Kishore and Tarun loans:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Proof of identity &#8211; Self certified copy of Voter’s ID card \/ Driving License \/ PAN Card \/ Aadhar Card\/Passport<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Proof of Residence &#8211; Recent telephone bill, electricity bill, property tax receipt (not older than <\/span> <span style=\"font-weight: 400;\">2 months), Voter’s ID card, Aadhar Card &amp; Passport of Proprietor\/Partners\/Directors<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Proof of SC\/ST\/OBC\/Minority<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Proof of Identity\/Address of the Business Enterprise &#8211; Copies of relevant licenses\/registration certificates\/other documents pertaining to the ownership, identity and address of business unit<\/span><\/li>\n<li><b><\/b>Applicant should not be a defaulter in any Bank\/Financial institution<\/li>\n<li><span style=\"font-weight: 400;\">Statement of accounts (for the last six months), from the existing banker, if any<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Last two years balance sheets of the units along with income tax\/sales tax return etc. (Applicable for all cases from Rs 2 Lacs and above)<\/span><\/li>\n<li>Projected balance sheets for one year<span style=\"font-weight: 400;\"> in case of working capital limits and for the period of the loan in case of term loan (Applicable for all cases from Rs 2 Lacs and above)<\/span><\/li>\n<li>Sales achieved during the current financial year up to the date of submission of application<\/li>\n<li>Project report (for the proposed project) containing details of technical &amp; economic viability<\/li>\n<li><span style=\"font-weight: 400;\">Memorandum and articles of association of the company\/Partnership Deed of Partners etc.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">In absence of third party guarantee, Asset &amp; Liability statement from the borrower including Directors &amp; Partners may be sought to know the net-worth<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Photos (two copies) of Proprietor \/ Partners \/ Directors<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The bank can also ask for additional documents, if needed. <\/span><span style=\"font-weight: 400;\">Such an exhaustive list is likely to send shivers down anyone’s spine. However, it is possible that many of these items may not be applicable in your case. Or that you may already have many of these documents readily available with you. <\/span><span style=\"font-weight: 400;\">At the same time, you must see that you have been asked to furnish business plan, sales details etc. Therefore, don’t expect bank to give you money without any effort from your end. You need to be serious in making the loan application.<\/span><\/p>\n<h2>What Are the Interest Rates for Mudra Loans? What Is the Loan Tenure?<\/h2>\n<p><b>Your bank will decide the interest rate for your loan. <\/b><b>Mudra or the Government of India does not control the interest rate or provide any interest rate subsidy. <\/b><span style=\"font-weight: 400;\">As for any loan, the interest rate will depend on business plan, cash flows, credit score and your repayment ability. <\/span><span style=\"font-weight: 400;\">The maximum loan tenure for Shishu category loan can be 5 years. <\/span><span style=\"font-weight: 400;\">The loan tenure for Kishore and Tarun shall be decided by the bank based on business cashflows and credit worthiness. You can also request a moratorium on principal repayment from the bank.<\/span><\/p>\n<h2>How to Apply for Mudra Loan Online?<\/h2>\n<p><span style=\"font-weight: 400;\">You need to go to MudraMitra website (<\/span><a href=\"https:\/\/mudramitra.in\/\"><span style=\"font-weight: 400;\">https:\/\/mudramitra.in\/<\/span><\/a><span style=\"font-weight: 400;\">).<\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\">Go to the Login page (<\/span><a href=\"https:\/\/mudramitra.in\/Login\"><span style=\"font-weight: 400;\">https:\/\/mudramitra.in\/Login<\/span><\/a><span style=\"font-weight: 400;\">)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">You need to register on the website, provide details about yourself and your business (plans), select the lender and submit the application. As mentioned before, the bank decides whether to lend to you or not.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">To register, Click on “New User” or directly go to this<\/span> <a href=\"https:\/\/mudramitra.in\/Login\/Register\"><span style=\"font-weight: 400;\">link<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">While registering, you will have to enter details such as name, address, gender, caste, business details, mobile number, e-mail and select a username.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">You will get an e-mail with the password.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">You can now login into to the portal and start filling up the application.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">The loan application is a 6-step process.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 1: Business Information<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 2: Information about you and other directors and the partners<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 3: Details about current banking facilities. If you need support in filing up the application form, you can select an option. Virtual handholding will be provided to you<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 4: Business performance details (Sales, profit, capital etc)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 5: Business registration details and document upload<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Step 6: Declaration and Submission<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Subsequently, you need to select the lender<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Your application will be forwarded to the bank and the bank will act on your application.<\/span><\/p>\n<p><b>Note<\/b><span style=\"font-weight: 400;\">: I have merely viewed the information needed on the online form and not applied for any loan under Mudra scheme.<\/span><\/p>\n<h2>What Is a Mudra Card?<\/h2>\n<p><span style=\"font-weight: 400;\">In case you opt for Cash Credit or Overdraft scheme, you will get a Mudra card. Using Mudra card, you can withdraw money up to the sanctioned limit from any ATM or swipe at any place. Of course, you have to pay interest on the outstanding amount. When you repay the borrowed amount, the limit becomes available (free) to you again.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You will not get this card if you have applied for term loan (since you have already withdrawn the money).<\/span><\/p>\n<h2>What Are the Benefits of Taking a Mudra Loan?<\/h2>\n<p><span style=\"font-weight: 400;\">You might argue that if you have to provide all the documents and go through the hassles of evaluation and loan documentation, what good is Mudra loan scheme? <\/span><span style=\"font-weight: 400;\">Well, there are a couple of points you must ponder over.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As per data posted on Mudra website, <\/span><b>crores of Indians have already availed loans under the Mudra scheme. Therefore, I believe banks are a little lenient during evaluation<\/b><span style=\"font-weight: 400;\">. A part of the reason is work that MUDRA does on the institutional side.<\/span> <a href=\"https:\/\/www.mudra.org.in\/Offerings\"><span style=\"font-weight: 400;\">It provides loan refinancing and securitization facility to banks and participating financial institutions.<\/span><\/a><\/p>\n<p><span style=\"font-weight: 400;\">Additionally, it shares the risk with the lenders by providing credit guarantee on the portfolio basis (not for individual). The entire Mudra loan portfolio is not covered by a guarantee but<\/span> <a href=\"http:\/\/www.livemint.com\/Politics\/Tj8nTsFFqjWZT8Pr9ATA7L\/Credit-guarantee-fund-for-Mudra-scheme-gets-cabinet-approval.html\"><span style=\"font-weight: 400;\">only 50% of the portfolio is<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This ensures two things:<\/span><\/p>\n<ol>\n<li><span style=\"font-weight: 400;\">Cost of the loan may come down for the end borrower since the bank’s risk has gone down.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Even though you can expect banks or FI to be lenient, banks still have skin in the game. Therefore, they will evaluate loan proposals carefully. If they don’t do this, the Mudra scheme may not achieve its desired purpose.<\/span><\/li>\n<\/ol>\n<p><b>You do not have to put up any security for the loan. This is a huge positive. <\/b><span style=\"font-weight: 400;\">Providing upfront security is the biggest challenge for most small businessmen\/entrepreneurs. <\/span><b>Mudra loan scheme does not require you to provide any collateral.<\/b><\/p>\n<h2>Useful Links<\/h2>\n<p><span style=\"font-weight: 400;\">If you have further queries or grievance, you can mark an e-mail to help@mudra.org.in. Alternatively, you can also approach MUDRA. The contact details are provided at this<\/span> <a href=\"http:\/\/mudra.org.in\/ContactUs\"><span style=\"font-weight: 400;\">link<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<ul>\n<li><a href=\"http:\/\/mudra.org.in\/\"><span style=\"font-weight: 400;\">Mudra Website<\/span><\/a><\/li>\n<li><a href=\"http:\/\/mudra.org.in\/FAQ\"><span style=\"font-weight: 400;\">Mudra FAQ page<\/span><\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>MUDRA stands for Micro Units Development and Refinance Agency Ltd. MUDRA was setup by the Union Government in FY2016 to provide funding to non-corporate, non-farm small business enterprises and entrepreneurs. The biggest problem that small businesses and entrepreneurs face is that of funding. It is a known fact that banks and financial institutions are not very&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[345],"tags":[216,218,50,217],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Mudra Loan for Small Businesses - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Mudra Loan for Small Businesses - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"MUDRA stands for Micro Units Development and Refinance Agency Ltd. MUDRA was setup by the Union Government in FY2016 to provide funding to non-corporate, non-farm small business enterprises and entrepreneurs. The biggest problem that small businesses and entrepreneurs face is that of funding. It is a known fact that banks and financial institutions are not very&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-13T07:57:52+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-02T10:31:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/emicalculator.net\/wp-content\/uploads\/mudra.png\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\",\"url\":\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\",\"name\":\"Mudra Loan for Small Businesses - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2018-02-13T07:57:52+00:00\",\"dateModified\":\"2021-02-02T10:31:33+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Mudra Loan for Small Businesses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Mudra Loan for Small Businesses - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/","og_locale":"en_US","og_type":"article","og_title":"Mudra Loan for Small Businesses - EMI Calculator","og_description":"MUDRA stands for Micro Units Development and Refinance Agency Ltd. MUDRA was setup by the Union Government in FY2016 to provide funding to non-corporate, non-farm small business enterprises and entrepreneurs. The biggest problem that small businesses and entrepreneurs face is that of funding. It is a known fact that banks and financial institutions are not very&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/","og_site_name":"EMI Calculator","article_published_time":"2018-02-13T07:57:52+00:00","article_modified_time":"2021-02-02T10:31:33+00:00","og_image":[{"url":"https:\/\/emicalculator.net\/wp-content\/uploads\/mudra.png"}],"author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/","url":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/","name":"Mudra Loan for Small Businesses - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2018-02-13T07:57:52+00:00","dateModified":"2021-02-02T10:31:33+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/mudra-loan-small-businesses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/mudra-loan-small-businesses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Mudra Loan for Small Businesses"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-15D","jetpack-related-posts":[{"id":4332,"url":"https:\/\/emicalculator.net\/stand-up-india-loan-for-sc-st-or-women-entrepreneurs\/","url_meta":{"origin":4193,"position":0},"title":"Stand Up India Loan for SC\/ST or Women Entrepreneurs","date":"April 27, 2018","format":false,"excerpt":"The Stand Up India scheme is aimed at promoting entrepreneurship at the grassroots sections of the society. The scheme was launched in 2015 to promote funding for green-field projects promoted by SC\/ST\/Women entrepreneurs. The scheme facilitates bank loans between Rs 10 lakhs and Rs 1 crore. Let’s find out more about…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4895,"url":"https:\/\/emicalculator.net\/budget-july-2019-salient-points\/","url_meta":{"origin":4193,"position":1},"title":"Budget (July) 2019 — Salient Points","date":"July 5, 2019","format":false,"excerpt":"The Finance Minister, Nirmala Sitharaman, presented the final budget for the FY2019-2020 on July 5, 2019. The Interim Budget was present in February this year.  The new budget retains the relief offered to the taxpayers and adds a few tax incentives for the taxpayers. At the same time, there will…","rel":"","context":"In &quot;News &amp; Opinion&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":4742,"url":"https:\/\/emicalculator.net\/will-i-get-a-loan-how-much-loan-will-i-get-if-these-questions-trouble-you-think-like-a-bank\/","url_meta":{"origin":4193,"position":2},"title":"Will I Get a Loan? How Much Loan Will I Get? If These Questions Trouble You, Think like a Bank","date":"April 16, 2019","format":false,"excerpt":"We get several queries from readers about if they can get a loan or how much loan will they get. Some queries have details about the income or security too. It is not easy to answer such queries. The banks look at many more things before they sign off your…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":5975,"url":"https:\/\/emicalculator.net\/union-nari-shakti-loan-loan-for-women-entrepreneurs\/","url_meta":{"origin":4193,"position":3},"title":"Union Nari Shakti Loan: Loan for Women Entrepreneurs","date":"May 25, 2021","format":false,"excerpt":"If you are a woman entrepreneur in need of funds for your business, there are a few loan schemes that you can take recourse to. We discussed one such scheme Stand up India in an earlier post. Under the scheme, women entrepreneurs can take loans up to Rs 1 crore.…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2782,"url":"https:\/\/emicalculator.net\/educational-loans-overview\/","url_meta":{"origin":4193,"position":4},"title":"Educational Loans: An Overview","date":"September 19, 2014","format":false,"excerpt":"One of the vital assets a country needs for economic prosperity is an educated population. Economic prosperity cannot be achieved by plentiful natural resources alone. (Of course, there are exceptions like the gulf region which has plentiful deposits of hydrocarbon, and most of the population is not highly educated. They…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6029,"url":"https:\/\/emicalculator.net\/sbi-kavach-collateral-free-personal-loan-for-covid-treatment-expenses\/","url_meta":{"origin":4193,"position":5},"title":"SBI Kavach — Collateral-Free Personal Loan for Covid Treatment Expenses","date":"June 19, 2021","format":false,"excerpt":"We had written about COVID-19 Personal Loan from Public Sector Banks earlier. These loans were not necessarily meant for covid medical expenses. Now, there's some good news for all SBI customers (including salaried, non-salaried and pensioners). SBI is offering Kavach personal loans to its customers who are facing the cash…","rel":"","context":"In &quot;Product Reviews&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4193"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=4193"}],"version-history":[{"count":5,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4193\/revisions"}],"predecessor-version":[{"id":4207,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4193\/revisions\/4207"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=4193"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=4193"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=4193"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}