{"id":4946,"date":"2019-07-31T11:04:04","date_gmt":"2019-07-31T05:34:04","guid":{"rendered":"https:\/\/emicalculator.net\/?p=4946"},"modified":"2019-07-31T11:04:04","modified_gmt":"2019-07-31T05:34:04","slug":"home-loan-tax-benefits-2019","status":"publish","type":"post","link":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","title":{"rendered":"Home Loan Tax Benefits 2019"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house, it also provides financial security to your family.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With the home prices shooting through the sky in most cities, most people cannot afford to purchase their dream house outright. A home loan can help you bridge this gap. High EMIs (equated monthly instalment) can put some pressure on your cash flows. However, tax incentives offered on repayment of home loans can ease that pressure to an extent. Additionally, once you receive possession of your house, you also save on rent.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In this post, I will discuss various tax benefits for home loans and the associated finer details of the Income Tax Act. Let’s first start with the tax benefits that almost every home buyer is aware of. We will look into the finer details subsequently. Repayment of housing loan is eligible for:<\/span><\/p>\n<ul>\n<li><b>Tax deduction of up to Rs 1.5 lacs for principal repayment<\/b><span style=\"font-weight: 400;\"> on a housing loan under Income Tax section 80C in a financial year. Please understand the deduction limit of Rs 1.5 lacs is the combined cap for investment in all the products in the 80C basket such as PPF, EPF, ELSS, tax-saving FDs etc.<\/span><\/li>\n<li><b>Tax deduction of up to Rs 2 lacs for payment of interest<\/b><span style=\"font-weight: 400;\"> on a housing loan in a financial year under Section 24 of the Income Tax act. The actual deduction availed is the lower of actual interest paid and Rs 2 lacs. Tax benefit on interest paid can be availed for loans taken for repair of the house too but tax benefit, in such a case, shall be limited to Rs 30,000 per financial year.<\/span><\/li>\n<\/ul>\n<h2>What Else Is Eligible for Tax Benefits under Section 80C and Section 24?<\/h2>\n<p><span style=\"font-weight: 400;\">Apart from the principal amount on home loan, stamp duty charges and registration fees are also eligible for deduction under Section 80C. Hence, you can claim benefit under Section 80C for such expenses too apart from the principal amount.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Any processing fees for the sanctioned loan, service fees or any prepayment fees are also an allowable deduction under Section 24. These fees can be added to interest paid during the year for the purpose of claiming deduction.<\/span><\/p>\n<h2>When Can I Avail These Benefits under Section 80C and Section 24?<\/h2>\n<p><b>The tax benefit under Section 24 and Section 80C is available only from the financial year in which the house is acquired or construction is completed.<\/b><span style=\"font-weight: 400;\"> There is no tax benefit for principal repayment or interest payment for under-construction property.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For the interest paid prior to the financial year (in which the house was acquired), the interest paid  can be aggregated and the tax benefit can be claimed under Section 24 in equal instalments over the next five years (including the year in which the house was occupied).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For instance, if you take a Rs 20 lac loan for 20 years at 10% in the July 2012 and get the possession of the house in April 2015. Full EMIs began from August 2012. From August 2012 till March 2015, you would have paid 32 EMIs. You would have paid interest of Rs 5.21 lacs in the period. You can claim deduction of Rs 1.04 lacs (Rs 5.21\/5) per year from FY2016 to FY2020. This deduction is in addition to the interest repaid during each of the years from FY2016 to FY2020. Please note total deduction u\/s 24 shall be capped at Rs 2 lacs (for a self occupied property).<\/span><\/p>\n<p><b>For claiming maximum benefits under Section 24, the construction of the house has to be completed or the house has to be acquired within 5 years from the end of the financial year in which the loan was taken.<\/b><span style=\"font-weight: 400;\"> If this condition is not met, then the maximum benefit under Section 24 (for interest payment on home loan) shall be limited to Rs 30,000 per financial year.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There is no such benefit for principal repayment for an under construction property. So, principal repaid, before the construction is over, is not eligible for any tax benefit. You will not get any benefit even if you were paying the full EMI during the period.<\/span><\/p>\n<h2>Are There Tax Benefits Other Than Those under Section 80C and Section 24?<\/h2>\n<p><span style=\"font-weight: 400;\">The tax benefits on principal repayment are limited to Section 80C. However, there are additional tax benefits for home loan interest payment provided you meet certain conditions.<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Section 80EE: You get an additional tax deduction of upto Rs 50,000 per annum for home loan interest payment provided<\/span>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The loan was sanctioned between April 1, 2016 and March 31, 2017.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The loan amount does not exceed Rs 35 lacs.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The value of the residential property does not exceed Rs 50 lacs.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The taxpayer does not hold any house on the date of sanction of loan.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The loan must be taken from a bank or a financial institution.<\/span><\/li>\n<\/ul>\n<\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Section 80EEA: You get an additional tax deduction of upto Rs 1.5 lacs per annum for home loan interest payment provided<\/span>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The loan is sanctioned between April 1, 2019 and March 31, 2020.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The stamp duty value of the house must not exceed Rs 45 lacs.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">You must not own any house on the date of the sanction of the loan.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The loan must be taken from a bank or a financial institution.<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The benefits under Section 80EE and Section 80EEA are over and above the benefit of Rs 2 lacs under Section 24. Therefore, if  you take a home loan in FY2020 and qualify rest of the conditions under Section 80EEA, the total tax deduction for home loan interest payment can go upto Rs 3.5 lacs (Rs 2 lacs under Section 24 and Rs 1.5 lacs under Section 80EEA).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are a few differences between Section 80EE(A) and Section 24. Section 80EE and Section 80EEA are quite restrictive. There are strict eligibility conditions about the loan sanction date, the quantum of loan and the value of the property. Additionally, the loan must be taken from a bank or a financial institution. Under Section 24, even a loan from a friend of a family member would qualify. However, there is one aspect where Section 80EE\/80EEA scores heavily over Section 24.<\/span><\/p>\n<p><b>Section 24 requires possession\/completion of construction before the tax benefits start.<\/b><span style=\"font-weight: 400;\"> Even though Section 24 permits you to avail tax benefit for the interest paid during the pre-construction period in 5 equal installments after possession, the interest paid during those 5 years (after possession) may already be quite high. Adding pre-construction interest to regular interest amount for the year may take the interest beyond Rs 2 lacs. In that case, you may not be able to get the full tax benefit for interest paid during the pre-construction period. <\/span><b>In case of Section 80EE or Section 80EEA, there is no such restriction. You can even get tax benefit for interest paid for an under-construction property.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">If you have purchased an under-construction property, you can start taking tax benefit under Section 80EEA right away (provided you qualify).<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Can the Benefits Availed under Section 80C Be Reversed?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Yes, it can happen if you sell the property within 5 years from the end of the financial year in which the possession of such property is obtained. In such a case<\/span><i><span style=\"font-weight: 400;\">,<\/span><\/i><span style=\"font-weight: 400;\"> the aggregate amount of deductions availed for such housing loan in the previous years shall be added to the income of the assessee in the year of sale and taxed accordingly (as per income tax slab).<\/span><span style=\"font-weight: 400;\"> This is in addition to any capital gains tax implications that may arise on sale of such assets.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Are There Any Tax Benefits for Loans Taken for Home Renovation\/Repair?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If the loan is taken for repairs, renewal or reconstruction, the deduction limit (for interest payment under Section 24) shall be capped at Rs 30,000. There is no provision for availing tax benefits beyond Rs 30,000 per financial year for loans taken for repairs\/renovation\/addition etc.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For any loans taken for any addition, alteration, renovation or repair of house property after issuance of completion certificate (or after the property has been occupied or let out), <\/span><b>there is no tax benefit for principal repayment under Section 80C.<\/b><\/p>\n<h2><span style=\"font-weight: 400;\">Double Whammy<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Looking at the fine print of Section 24 of the Income Tax Act, if you do not get possession of your house within 5 years from the end of the financial year in which the loan was taken; it will be a double loss for you.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You are paying rent and EMI (or pre-EMI, as may be applicable) at the same time. Tax deduction on interest payment will come down to Rs 30,000 (from Rs 2 lacs). For someone in the highest tax bracket, this will result in maximum loss of ~Rs 56,000 per financial year. Additionally, there will be no benefit for principal repaid during the construction period.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For instance, if you took a home loan in July 2011 and you do not get possession of your house by March 31, 2017, you can avail a maximum tax deduction of Rs 30,000 per financial year (after you get possession of the house). A double whammy indeed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If your builder does not deliver on time, not only do you have to go through a lot of mental agony, you might even have to go through a lot of financial pain.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What If the Property Is Not Self-Occupied?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The deduction for principal repayment under Section 80C shall be the same as in case of a self-occupied property. For the tax deduction on the interest payment, the rules are a bit different.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To understand this better, let’s first look at what various Sections of Income Tax Act contain.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Section 23 specifies how annual income (rent\/notional rent) from a residential property is calculated. It also specifies the annual income from a self-occupied property is NIL. Additionally, it specified that there can be 2 self-occupied properties.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Section 24 specified various deductions that you can apply to such annual income. Standard deduction (30% of annual income specified in Section 23) is one such deduction. Another is Rs 2 lacs (or Rs 30,000 as the case may be) for interest payment on a self-occupied property. Even if you have 2 self-occupied properties, the deduction for interest payment is capped at Rs 2 lacs.  Remember Section 24 makes no mention for let-out properties.<\/span><\/p>\n<p><b>Income from House property = Annual Income (as determined under Section 23) &#8211; Standard deduction (30% of annual income) &#8211; Interest payment on home loan<\/b><\/p>\n<p><span style=\"font-weight: 400;\">For self-occupied properties, deduction for interest payment is capped at Rs 2 lacs under Section 24. No such cap for let-out properties.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> Let’s say you have self-occupied properties. Annual income will be considered NIL. Standard deduction will also be NIL. You pay Rs 3 lacs in interest but you can deduct only Rs 2 lacs for self-occupied properties. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Income from House Property= NIL &#8211; NIL &#8211; Rs 2 lacs = &#8211; 2 lacs. Essentially, a loss of Rs 2 lacs under income from house property. You can set this off against other heads of income (apart from capital gains). <\/span><b>And this is how the deduction of Rs 2 lacs for interest payment comes in to picture.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Let’s say you also have a let out property. You get an annual income of Rs 1 lacs and pay interest of Rs 4 lacs.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Income from House Property = (NIL + NIL + Rs 1 lacs) &#8211; (NIL + NIL + Rs 30,000) &#8211; (Rs 2 lacs + 4 lacs) = -5.3 lacs<\/span><\/p>\n<p><b>Does that mean you can get tax benefit of Rs 5.3 lacs?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">No. There is an additional section, Section 71.<\/span><\/p>\n<p><b>Section 71 caps the Loss under House Property (eligible for setoff) at Rs 2 lacs.<\/b><\/p>\n<p><b>For any extra loss, you can carry forward the loss for the next 8 financial years.<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Until FY2017, this limitation under Section 71 did not exist. Therefore, you could have taken tax benefit for the entire interest paid for a let-out property. Unfortunately, that is no longer the case.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Can I Avail These Benefits for Two Loans?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Yes, you can avail these benefits for more than one loan. The benefit under Section 80C shall be capped at Rs 1.5 lacs for all the loans. Benefits under Section 24 (interest payment) shall be as mentioned before. For the self-occupied property, the limit shall be Rs 2 lacs (or Rs 30,000 as the case may be).  For that house (or houses) that has been let out (or deemed to be let out), the limits shall apply as described in the previous section.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What If I Borrow from a Friend?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Interest payment to a friend or a relative is eligible for deduction under Section 24. You will have to produce a certificate of interest payment from them. Expectedly, the friend\/relative is liable to pay income tax on such interest income. <\/span><b>There shall be no benefit on principal repayment under Section 80C.<\/b><span style=\"font-weight: 400;\"> Such relief u\/s 80C is available for loans taken from banks, LIC or other notified institutions.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Can I Avail Tax Benefits under Section 80C and Section 24 and Also Avail HRA?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you are staying in a house owned by you, you cannot avail tax benefits for HRA (House rent allowance). You can avail tax benefits under Section 80C and Section 24 though.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you own a house (taken on a home loan) but stay in a rented accommodation, you can claim tax benefits under Section 24 and Section 80C along with tax benefits for HRA. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Conclusion<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">You can see that the tax deduction under Section 24 and 80C are linked to completion of construction or possession of the property. So, if you are going for an under construction property, do keep these aspects in mind. Project delays are quite common these days. An under construction property might be cheaper but delays will cause not just mental agony but serious financial strain due to dual burden of rent and EMI and lesser tax benefits.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house, it also provides financial security&hellip; <a class=\"excerpt-more btn btn-primary\" href=\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\">Continue Reading <i class=\"fas fa-chevron-circle-right\"><\/i><\/span><\/a><\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false},"categories":[4],"tags":[284,171,287,134,6,274,7,123,151,271,149,31,132,229,98,99,150,135,211,30,152,273],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Home Loan Tax Benefits 2019 - EMI Calculator<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Home Loan Tax Benefits 2019 - EMI Calculator\" \/>\n<meta property=\"og:description\" content=\"For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house, it also provides financial security&hellip; Continue Reading\" \/>\n<meta property=\"og:url\" content=\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\" \/>\n<meta property=\"og:site_name\" content=\"EMI Calculator\" \/>\n<meta property=\"article:published_time\" content=\"2019-07-31T05:34:04+00:00\" \/>\n<meta name=\"author\" content=\"Deepesh Raghaw\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deepesh Raghaw\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\",\"url\":\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\",\"name\":\"Home Loan Tax Benefits 2019 - EMI Calculator\",\"isPartOf\":{\"@id\":\"https:\/\/emicalculator.net\/#website\"},\"datePublished\":\"2019-07-31T05:34:04+00:00\",\"dateModified\":\"2019-07-31T05:34:04+00:00\",\"author\":{\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\"},\"breadcrumb\":{\"@id\":\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/emicalculator.net\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Home Loan Tax Benefits 2019\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/emicalculator.net\/#website\",\"url\":\"https:\/\/emicalculator.net\/\",\"name\":\"EMI Calculator\",\"description\":\"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/emicalculator.net\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0\",\"name\":\"Deepesh Raghaw\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/emicalculator.net\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g\",\"caption\":\"Deepesh Raghaw\"},\"description\":\"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.\",\"sameAs\":[\"http:\/\/www.personalfinanceplan.in\/\"],\"url\":\"https:\/\/emicalculator.net\/author\/deepeshraghaw\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Home Loan Tax Benefits 2019 - EMI Calculator","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","og_locale":"en_US","og_type":"article","og_title":"Home Loan Tax Benefits 2019 - EMI Calculator","og_description":"For most young professionals, buying a house tops the list of priorities. Even those who do not believe real estate makes for a good investment, do not have second thoughts about purchasing a house to stay in. Not only does it give you the comfort of living in own house, it also provides financial security&hellip; Continue Reading","og_url":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","og_site_name":"EMI Calculator","article_published_time":"2019-07-31T05:34:04+00:00","author":"Deepesh Raghaw","twitter_misc":{"Written by":"Deepesh Raghaw","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","url":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/","name":"Home Loan Tax Benefits 2019 - EMI Calculator","isPartOf":{"@id":"https:\/\/emicalculator.net\/#website"},"datePublished":"2019-07-31T05:34:04+00:00","dateModified":"2019-07-31T05:34:04+00:00","author":{"@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0"},"breadcrumb":{"@id":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/emicalculator.net\/home-loan-tax-benefits-2019\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/emicalculator.net\/"},{"@type":"ListItem","position":2,"name":"Home Loan Tax Benefits 2019"}]},{"@type":"WebSite","@id":"https:\/\/emicalculator.net\/#website","url":"https:\/\/emicalculator.net\/","name":"EMI Calculator","description":"Calculate EMI for Home Loan \/ Housing Loan, Car Loan &amp; Personal Loan in India","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/emicalculator.net\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/085c9c2375b21416ad997b19b4bd5be0","name":"Deepesh Raghaw","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/emicalculator.net\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9787ffb7421d0a06ffbed06d04bdb1f3?s=96&d=mm&r=g","caption":"Deepesh Raghaw"},"description":"Deepesh Raghaw is a SEBI registered Investment Adviser and a management graduate from IIM-Lucknow. He writes for leading business publications regularly, runs a personal finance blog and a financial planning firm at www.PersonalFinancePlan.in. He can be reached at deepesh.raghaw[AT]gmail.com.","sameAs":["http:\/\/www.personalfinanceplan.in\/"],"url":"https:\/\/emicalculator.net\/author\/deepeshraghaw\/"}]}},"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p8H5CU-1hM","jetpack-related-posts":[{"id":2068,"url":"https:\/\/emicalculator.net\/understanding-tax-benefits-on-home-loan\/","url_meta":{"origin":4946,"position":0},"title":"Understanding tax benefits on home loan","date":"September 16, 2012","format":false,"excerpt":"Please read our updated article explaining tax benefits on home loan. The hardest thing to understand in the world is the income tax - Albert Einstein Most people would tend to agree with Einstein, as tax related calculations & rules are complex, intimidating and difficult to understand. At the same…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Home Loan Tax","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/2012\/09\/home-loan-tax.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":2597,"url":"https:\/\/emicalculator.net\/pre-emi-vs-full-emi-understanding-payment-schemes-for-under-construction-properties\/","url_meta":{"origin":4946,"position":1},"title":"Pre-EMI vs Full EMI &#8211; Understanding payment schemes for under-construction properties","date":"January 15, 2014","format":false,"excerpt":"When you purchase an under-construction property, your bank may link the disbursal of home loan to the construction stages of the property. In such cases, you will either be asked to pay pre-EMI OR given an option to choose between pre-EMI and full EMI payments. What is Pre-EMI? As you…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Residential Project Delays in Indian Cities","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/project-delays.jpg?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]},{"id":3821,"url":"https:\/\/emicalculator.net\/pre-emi-vs-full-emi-which-is-better\/","url_meta":{"origin":4946,"position":2},"title":"Pre EMI vs. Full EMI &#8211; Which Is Better?","date":"April 3, 2017","format":false,"excerpt":"Almost everyone plans to purchase a house before retirement. Given the inflated real estate prices, buying a house outright is not an option for many of us. Thus, many of us have to resort to home loans to finance purchase of house. Though a home loan repayment schedule can be structured…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3364,"url":"https:\/\/emicalculator.net\/factors-to-consider-when-doing-home-loan-transfer\/","url_meta":{"origin":4946,"position":3},"title":"Factors to Consider When Doing Home Loan Transfer","date":"January 3, 2016","format":false,"excerpt":"Home loans form the biggest pie of loan portfolio for the most of us. Therefore, higher interest rate on a home loan can translate into a greater EMI outgo. If there is a way by which your EMI burden can be reduced, you can ease pressure on your monthly cash…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3812,"url":"https:\/\/emicalculator.net\/what-is-the-ideal-home-loan-tenure\/","url_meta":{"origin":4946,"position":4},"title":"What Is the Ideal Home Loan Tenure?","date":"March 28, 2017","format":false,"excerpt":"Planning to take a home loan? You have shortlisted the bank with the lowest interest rate and the best feedback about the service. Well, have you given thought to the home loan tenure? Along with your loan amount and the interest rate, the home loan tenure is an important variable…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":3091,"url":"https:\/\/emicalculator.net\/which-loan-should-you-prepay-first\/","url_meta":{"origin":4946,"position":5},"title":"Which Loan Should You Prepay First?","date":"August 6, 2015","format":false,"excerpt":"You can check the impact of prepayments on your home loan using our Home Loan EMI Calculator. You recently landed up a hefty bonus. You have the financial wisdom of not splurging the entire bonus amount on expensive gadgets or a long vacation. You have earmarked a significant amount to…","rel":"","context":"In &quot;Articles&quot;","img":{"alt_text":"Loan Prepayment","src":"https:\/\/i0.wp.com\/emicalculator.net\/wp-content\/uploads\/LoanPrepayment.png?resize=350%2C200&ssl=1","width":350,"height":200},"classes":[]}],"_links":{"self":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4946"}],"collection":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/comments?post=4946"}],"version-history":[{"count":5,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4946\/revisions"}],"predecessor-version":[{"id":4952,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/posts\/4946\/revisions\/4952"}],"wp:attachment":[{"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/media?parent=4946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/categories?post=4946"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/emicalculator.net\/wp-json\/wp\/v2\/tags?post=4946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}